{"subject": "board games", "examples": [["How does one perform the worm?", "Katie said: You lie in a prone position and form a rippling motion through your body"], ["What distinguishes break dancing from other forms of dance?", "Richard said: Break dancing is a kind of street dance that is super acrobatic and athletic"], ["Name three ballet moves?", "Alice said: A plie, a tendu, and a pirouette"], ["How many squares are there on a chess board?", " Joe said: There are 64 squares on a chess board"], ["Name one of the characters from Clue?", " Jake said: Colonel Mustard"], ["Who invented Monopoly?", " Tom said: Monopoly was invented by Charles Darrow in 1933."], ["What color is the \"Go\" space on a Monopoly board?", " Jack said: The \"Go\" space is a bright green color."], ["What is the goal in Checkers?", " Sam said: The goal in Checkers is to capture all of your opponent's pieces or block them so they cannot move."], ["What is the longest running board game in the world?", " Ben said: The longest running board game in the world is Go, with records of it being played since the 5th century."], ["How many pieces are in a standard Backgammon set?", " Mark said: A standard Backgammon set consists of 15 pieces and two dice."], ["What other board game is known as ‘Tabula’?", " Mark said: 'Backgammon is also known as 'Tabula'."], ["How many dice are rolled in a game of Yahtzee?", " Hunter said: Five dice are rolled in a game of Yahtzee."], ["What is the most popular form of Chess?", " Bob said: The most popular form of Chess is standard chess, played on an 8x8 board."], ["In the game of Risk, what coloured piece is the strongest?", " Tim said: The strongest piece in Risk is the black piece, which represents the highest population count."], ["In playing a game of Scrabble, which letter gives you the most points?", " Jack said: The letter 'Z' is worth 10 points in the game of Scrabble."], ["What is the difference between a board game and a card game?", " Peter said: A board game is typically played on a physical board while a card game is usually played using a set of specialized playing cards."], ["What was the first board game invented?", " Steve said: The earliest known board game was called Senet, invented in Ancient Egypt over 5,000 years ago."], ["What is the difference between a Strategy game and a Tactical game?", " Nathan said: A strategy game looks more at the big picture and involves planning your moves in advance, whereas a tactical game is more focused on problem solving in the moment."], ["What is the objective of the game Risk?", " Jack said: The objective of the game Risk is to conquer the board by occupying every territory with your armies."], ["How many pieces are in a standard chess set?", " Tim said: A standard chess set contains 32 pieces, 16 for each player."], ["What is the name of the world's most popular board game?", " Jake said: Monopoly is the world's most popular board game."], ["What is a game of Scrabble most commonly used for?", " Bryan said: Scrabble is a word game that involves building words on a board using letter tiles. Players score points for how many points are on the tiles and how many words they can make."], ["Name one of the six categories of trivia on a Trivial Pursuit board?", " Jim said: History is one of the six categories of trivia on a Trivial Pursuit board."], ["What is the name of the classic board game involving plastic spaceships and a hexagonal board?", " Sarah said: It's called “Asteroids”."], ["What is the aim of the board game Stratego?", " Mark said: The aim of Stratego is to capture your opponent's flag while defending your own flag."], ["What is the earliest known board game dating back to 2000BC?", " Joseph said: Senet, an ancient Egyptian board game, is the earliest known board game, dating back to 2000BC."], ["Name one of the most popular table top war games?", " Frank said: One of the most popular table top war games is Warhammer 40K."], ["What game is usually played with wooden pieces in the shape of cats, dogs, rabbits, and foxes?", " Andrew said: The game is called Fox and Geese and it's a strategy game."], ["What type of game is Go?", " Chris said: Go is an abstract strategy board game for two players."], ["What is the traditional children's game of Ludo often known as?", " Sarah said: The traditional children's game of Ludo is often known as \"Parcheesi\"."], ["In Star Trek: The Next Generation, what game was introduced as 'the classic non-linear, non-deterministic game of intergalactic strategy'?", " Henry said: The game was known as \"Breakthrough\" or the \"Kobayashi Maru\" test."], ["How many triangles are there in a Trivial Pursuit board?", " Paul said: There are six triangles in a Trivial Pursuit board."], ["How many cards does a standard deck of deck for Uno contain?", " Nicole said: A standard deck of UNO cards contains 108 cards."], ["What is the oldest game still regularly played today?", " Joe said: The oldest game still regularly played today is probably chess."], ["How many pieces does a player have in a classic game of Chinese Checkers?", " Sarah said: Each player has 10 pieces in a classic game of Chinese Checkers."], ["Name the most popular dice game in the world?", " Ollie said: The most popular dice game in the world is Yahtzee."], ["What is the name of the commercially successful dice-rolling game involving marble-bumping?", " Mark said: The game is called Marbulous."], ["Name one of the best-selling board game of all time?", " George said: Monopoly is one of the best-selling board games of all time."], ["What was the board game-themed party game that was released by EA in 1990?", " Jude said: EA released a game called ‘You Don't Know Jack’ in 1990."], ["Name one of the two original founders of Ravensburger Games?", " Zoe said: Otto Robert Maier was one of the two original founders of Ravensburger Games."], ["What was the first game devised by Parker Brothers that was aimed at adult players rather than children?", " Ryan said: The first game devised by Parker Brothers aimed at adult players was Monopoly."], ["What type of game is 'The Settlers of Catan'?", " Mark said: It's a strategy-based game where players build and develop settlements on the island of Catan"], ["Name one of the three most popular licensed Monopoly themes?", " Jack said: The most popular licensed Monopoly theme is The Simpsons edition."], ["What is the name of the Harry Potter themed board game?", " Emma said: The name of the Harry Potter themed board game is called 'Hogwarts Battle'."], ["Name one of the four skills that the game Trivial Pursuit aims to test?", " Sam said: Trivial Pursuit aims to test knowledge in six categories: geography, entertainment, history, politics, art, and science."], ["In Chess, what type of piece is allowed to jump over other pieces?", " Fred said: The knight is the only piece that is allowed to jump over other pieces in Chess."], ["Name one of two main game variations of the game Reversi?", " Tom said: The two main variations are two-player or four-player Reversi."], ["What is the name of the church based game often referred to as an 'evolutionary form of backgammon'?", " James said: The game is called Pan and it is an ancient Egyptian game."], ["In which country did the game Mancala originate?", " Wendy said: Mancala is thought to have originated in Africa, although it can now be seen in countries such as India and the Middle East."], ["Name one of the pieces in the game of Chutes and Ladders?", " Bob said: Snakes, which act as a 'chute' and take you back to lower numbers on the board."], ["What is the longest running role-playing game?", " Sarah said: Dungeons & Dragons is the longest running role-playing game."], ["How many squares are there on a standard Go board?", " Brian said: A standard Go board consists of 361 squares."], ["What is the name of the trading game based on entering and gaining control of the Old West's territories?", " Stuart said: The name of the game is called Settlers of Catan."], ["Name one of the two main strategies for playing the game Othello?", " Melvin said: Building a bridge is one of the two main strategies for playing Othello."], ["How many pieces does each player get in a game of Chinese Checkers?", " Joe said: Each player gets ten pieces in a game of Chinese Checkers."], ["What is the classic eight-player game starring four legendary heroes and four magical wizards?", " Jack said: The classic eight-player game is Dungeons and Dragons."], ["What is the name of the RPG board game based on the popular video game series?", " Sarah said: The board game is called Dungeons and Dragons."], ["What is the maximum number of players in a game of Pictionary?", " Nathan said: A game of Pictionary can have up to eight players."], ["What type of pieces are used in the game Trouble?", " Jeff said: Trouble is played with a set of colored pieces that allow you to move around the board."], ["What is the name of the game in which players move their pieces around a shaped track in a clockwise direction?", " Sam said: The game is called Snakes and Ladders."], ["What type of game is Taboo?", " Tommy said: Taboo is a word association game in which you must try to get someone to guess a word without saying certain words associated with it."], ["What is the most popular version of Scrabble in North America?", " Dan said: The most popular version of Scrabble in North America is the classic edition."], ["What type of game is 'The Game of Life'?", " Mark said: The Game of Life is a board game that simulates a person's journey through life, from college to retirement."], ["Name one of the four categories in Trivial Pursuit?", " Mark said: Entertainment is one of the categories in Trivial Pursuit."], ["What type of game is Battleship?", " Jacob said: Battleship is a simple two-player strategy game where players try to guess each other's ships placement on a game board."], ["Name one of the two predominant strategies for playing the game Risk?", " Jim said: One of the two predominant strategies for playing Risk is an aggressive strategy, which involves attacking as many players as possible."], ["Name one of the four game modifiers in Settlers of Catan?", " Tom said: The robber is a game modifier in Settlers of Catan."], ["How many cards are drawn in the beginning of a game of Monopoly?", " Mark said: Two cards are drawn in the beginning of a game of Monopoly."], ["Name one of the most popular versions of Monopoly?", " Michael said: The most popular version of Monopoly is probably Monopoly Classic."], ["What is the average time to finish a game of Clue?", " Mark said: The average game of Clue takes around 45 minutes to complete."], ["Name one of the four different colours used in Trivial Pursuit?", " Ryan said: Purple"], ["How many pieces are there in a set of Pachisi?", " Jack said: There are four pieces per player and a total of sixteen pieces in a Pachisi set."], ["Who invented Scrabble?", " James said: Scrabble was invented by an American architect named Alfred Mosher Butts in 1938."], ["What is the aim of the board game Jenga?", " Tim said: The aim of Jenga is to build a tower and then take it in turns to remove blocks from the tower, without the tower toppling over."], ["Name one of the two components that make up a chessboard?", " Thomas said: Squares"], ["Name one of the several possible objectives for Monopoly?", " Mark said: The objective of the game is to be the last remaining player with money, assets and properties."], ["What is the name of the ancient Asian board game that originated in India and is said to have been developed over two millennia ago?", " Mark said: The game is called 'Chaturanga' and it is an ancestor of the game of Chess."], ["In a game of Scrabble, how many tiles does each player receive?", " Sarah said: Each player gets seven tiles in a game of Scrabble."], ["What is the name of the game that is a variation of the classic Reversi, and has been known since 1997 as the computer game Othello?", " Brian said: The game is called Othello."], ["What is the most strategically demanding form of chess?", " Jack said: Blitz chess is considered to be the most strategically demanding form of chess as it requires quick thinking and decisions within a short time frame."], ["What is the name of the game based on moving marbles across a wooden board with pits and holes?", " Mark said: The game is called mancala."], ["Name one of the two players who invented the memory game?", " Simon said: Allan Parsons was one of the inventors of the memory game."], ["Name one of the four basic pieces in a chess set?", " Jake said: The rook"], ["Name one of the two decks of cards used in the game of Bridge?", " Jack said: A Bridge deck consists of 52 cards in four suits: spades, hearts, diamonds, and clubs."], ["What is the name of the game based on the ancient Chinese board game known as the 'Game of Generals'?", " Sam said: It's called Stratego."], ["What type of strategy game involves capturing territories on a board?", " Jack said: A strategy game involving capturing territories on a board is typically referred to as a war game or a territory game, such as Go or Risk."], ["What is the name of the classic fast reaction game involving a dwarf, wizard and dragon?", " Mary said: The game is called 'Dwarf, Wizard and Dragon'."], ["Name one of the four colours of pieces in the traditional Pachisi game?", " Joshua said: The four traditional colours of pieces in the Pachisi game are yellow, green, red, and blue."], ["What game is often described as 'the world's most popular strategy game'?", " Tom said: Chess is often described as the world's most popular strategy game."], ["What is the goal in Snakes and Ladders?", " Sam said: The goal in Snakes and Ladders is to be the first player to reach the last square on the game board."], ["Name one of the two rules in Chess which a player must adhere to?", " Tony said: You must move pieces one at a time and you must capture an opponent's piece when possible."], ["What type of board game is played on a chequered game board with moving game pieces and dice?", " Jake said: Chess."], ["What type of game is Parcheesi?", " Jack said: Parcheesi is a board game of Indian origin. It is a cross and circle game that involves rolling the dice."], ["What is the name of the traditional French game where two players take turns in rolling five dice to move their pieces around the board?", " Tom said: The name of this game is Five Dice Boules."], ["What is the objective of the game MasterMind?", " Thomas said: The goal of MasterMind is to guess a hidden pattern of colors correctly within a certain number of moves."], ["In a standard game of Monopoly, how many railroads are there?", " Jack said: There are four railroad spaces in Monopoly, which are Reading Railroad, Pennsylvania Railroad, B&O Railroad, and Short Line."], ["What is the name of the board game that is comprised of pieces known as 'meeples'?", " Mike said: The game is called Carcassonne and the pieces are called meeples."], ["Name one of the two main game variations of Reversi?", " Sam said: Traditional Reversi and Misere Reversi."], ["What is the name of the game where players try to fill their board with pieces of their colour?", " Bill said: The game is called 'Connect Four'."], ["What type of game is Solitaire?", " Joe said: Solitaire is a one-player card game."], ["Name one of the seven dwarves in the game of Snow White and the Seven Dwarves?", " Emma said: Dopey"], ["Name one of the two main categories of Chess?", " Fred said: The two main categories of Chess are openings and endgames."], ["In a standard deck for Uno, how many wild cards does a player have?", " Jay said: A player has four wild cards in a standard Uno deck."], ["What is the name of the traditional Japanese strategy game?", " Sam said: The traditional Japanese strategy game is called Go."], ["Name one of the most widely successful Word Games?", " Jeff said: Scrabble is one of the most widely successful Word Games."], ["What is the name of the game involving a spool, secret compartment and tokens?", " Jenna said: The game is called Fox and Geese."], ["In what game do players battle against each other using extraterrestrial creatures and armies?", " Sam said: The game is called Starcraft and it is a real-time strategy game."], ["What ancient game is often described as the 'Game of Twenty Squares'?", " Zac said: The game is called Ashtapada and is an ancient Indian game related to the game of chess."], ["In a standard wooden game of Jenga, how many wooden blocks are there?", " Jack said: There are 54 wooden blocks in a standard wooden game of Jenga."], ["What is the name of the game where players move around a circular board by rolling dice?", " Ben said: The game is called 'Snakes and Ladders'"], ["Name one of the popular licensed versions of the Monopoly game?", " Sam said: The Star Wars Trilogy Edition Monopoly game is a popular licensed version."], ["Name one of the seven dwarves from Disney's Snow White and the Seven Dwarves?", " Emily said: Dopey"], ["What is the aim of the game Backgammon?", " John said: The aim of the game Backgammon is to be the first player to move all of their pieces off the board."], ["Name one of the five different kinds of boat in the board game Battleship?", " Sam said: Destroyer"], ["Name one of the four French words for Jenga?", " Maureen said: Le jeu de Jenga"], ["What type of game is 'The Game of Nations'?", " Julie said: The Game of Nations is a strategic board game based on international diplomacy and conflict."], ["Name one of the two main types of board games?", " James said: Strategy board games and Dice Games are two main types of board games."], ["What type of game is 'The Mansion of Happiness'?", " Jack said: The Mansion of Happiness is a board game that was popular in the mid-1800s. The object of the game is to guide players from the start of their lives to the end."], ["Name one of the names of the landmarks on a Monopoly board?", " James said: Boardwalk"], ["Who invented the game of Parcheesi?", " Mohammed said: It was invented in India by the Mughal Emperors more than 400 years ago."], ["Name one of the five main economic principles of the game Monopoly?", " George said: Monopoly requires players to manage money and resources through supply, demand, trading and collections of rent."], ["What is the purpose of the game Mastermind?", " Joe said: The purpose of Mastermind is to figure out a secret code using clues provided by the other player."], ["Name one of the six classic pieces in a Chess set?", " Tom said: A rook"], ["What is the aim of the game Go Fish?", " Sarah said: The objective of Go Fish is to collect as many sets of four matching cards as possible."], ["Name one of the five suits in a standard deck of playing cards?", " David said: One of the five suits is spades."], ["What type of game is Scrabble?", " Mark said: Scrabble is a word game where players create words on a board by placing lettered tiles."], ["Name the two countries featured on a standard Risk board?", " Steve said: The two countries featured on a standard Risk board are Australia and Antarctica."], ["In what century did Chess originate?", " Martin said: Chess originally appeared in India around the 6th century AD."], ["What is the name of the game that is known as 'the world's most strategic party game'?", " Mark said: The game is called Codenames."], ["What type of game is ' guessing game' where players make up clues in order to identify hidden words?", " Alex said: It's a charades game."], ["Name one of the four pieces used in the chess variant ‘Knightmare Chess’?", " Alan said: The Super Pawn is one of the four pieces used in Knightmare Chess."], ["What is the most popular version of Scrabble played in the U.K.?", " Sam said: The most popular version of Scrabble played in the U.K. is the classic board game."], ["Name one of the four possible dice rolls in a game of Backgammon?", " Sam said: Rolling a six is one of the four possible dice rolls in a game of Backgammon."], ["What type of game is the game of Diplomacy?", " Jack said: Diplomacy is a strategic board game that requires a lot of negotiating and strategy."], ["How many sides are there on a standard die?", " Tim said: A standard die has six sides."], ["What is the game Clue based on?", " Sam said: Clue is based on the classic mystery novel And Then There Were None by Agatha Christie."], ["What type of game is 'The Great Dalmuti'?", " Steve said: The Great Dalmuti is a card game with medieval roles."], ["Name one of the ways you can win in the game Risk?", " Matthew said: You win the game of Risk by conquering every single territory on the board."], ["Name one of the original seven 'Classic' pieces in a Chess set?", " Brad said: The Queen is one of the original seven pieces in a Chess set."], ["Name one of the five main objectives in the game of Monopoly?", " Bill said: The objective of the game is to be the last player remaining with money after all other players have gone bankrupt."], ["What is the most popular board game in Japan?", " Jenny said: The most popular board game in Japan is 'Kakerlakenpoker Royal'"], ["What type of game is Carcassonne?", " Sam said: Carcassonne is a tile-laying and resource management board game."], ["Name one of the six categories of trivia in the Trivial Pursuit board game?", " Sam said: Geography is one of the six categories of trivia in the Trivial Pursuit board game."], ["Name one of the most popular UNO variations?", " Paul said: Reverse UNO is one of the most popular variations."], ["How many pieces are there on a Syndicate board?", " Simon said: There are 24 pieces on a Syndicate board."], ["How many pieces are in a Pachisi game set?", " George said: A Pachisi game set has 92 pieces, including four pieces for each of the four players."], ["Name one of the seven islands contained on the Risk board?", " Joe said: Madagascar"], ["Name one of the two main strategies of the card game Romme?", " Jake said: Forming melds is a main strategy in Rummy."], ["What is the name of the game which involves two teams of players, who must guess words using charades?", " Zac said: That game is called Charades."], ["Name one of the three capitals of the Kingdom of Argil in the game Dungeonquest?", " Damon said: The capital of Cor is one of the three capitals of the Kingdom of Argil in the game Dungeonquest."], ["What is the theme of the game Werewolf?", " Michael said: Werewolf is a social deduction game in which players take on the roles of villagers or werewolves in a battle between two teams."], ["What is the aim of the game Halma?", " Luke said: The aim of Halma is to move all your pieces around the board and get them to the other side before your opponent does."], ["Name one of the four main components that makes up a Chess board?", " Matt said: A Chess board is traditionally made up of 64 squares, 8 on each side"], ["What is the most popular board game in Europe?", " Carlos said: The most popular board game in Europe is Monopoly."], ["Name one of the two types of dice used in the game of Dungeons and Dragons?", " Mark said: A twenty-sided die"], ["What is the name of the game that involves players taking turns placing pieces in a triangular grid in order to capture their opponents' pieces?", " David said: The game is called Tic-Tac-Toe."], ["Name one of the world's different versions of Chess?", " Paul said: Shatar, which is an ancient form of the game played in Mongolia."], ["Name one of the four pieces used in the game Mancala?", " Brandon said: A mancala piece, also known as a pit or an inselberg, is a small cup or indentation in the board."], ["What type of card game involves all players drawing from a common pool of cards?", " Frank said: A draw and discard game like poker or Rummy"], ["What type of game is Rummikub?", " Sam said: Rummikub is a tile-based game similar to rummy, but with more complex rules."], ["Name one of the five categories in a standard game of Trivial Pursuit?", " Mark said: Science & Nature"], ["What is the objective of the game Go?", " Ryan said: The goal of Go is to gain the most points by capturing the opponent's pieces and surrounding empty spaces on the board."], ["What is the aim of the game Battleship?", " Lauren said: The aim of the game Battleship is to find and sink all of your opponent's ships before they find and sink all of yours."], ["Name one of the seven pieces in a game of Backgammon?", " Sam said: A checker."], ["Name one of the two prominent strategies used in the game Risk?", " Benjamin said: Aggressive or defensive expansion"], ["Name one of the two main categories of the card game War?", " Mason said: Wrestling, which involves teams trying to overthrow each other."], ["Name one of the two main variations of dominoes?", " Sam said: Five-up dominoes is one of the two main variations of dominoes."], ["What is the difference between a board game and a table top game?", " Mark said: Board games typically use a board as well as pieces and other components to create a game, whereas table top games usually feature heavier strategic elements than board games without the need for physical components."], ["What type of game is 'The Royal Game of Ur'?", " Jim said: The Royal Game of Ur is an ancient two-player strategy game."], ["In a game of Snakes and Ladders, how many steps are there in total?", " Sarah said: There are 100 steps in a game of Snakes and Ladders."], ["Name one of the two main strategies used in Monopoly?", " Mike said: Buying property and collecting rent from other players."], ["Name one of the six categories of trivia in Trivial Pursuit?", " Jack said: Geography"], ["Name one of the possible pieces in a game of Chess?", " Sam said: A knight"], ["What is the aim of the game Balderdash?", " Mark said: The aim of the game Balderdash is to score more points than the other players by guessing the correct definition of strange words."], ["Name one of the two main strategies used in the card game Go Fish?", " Bob said: One of the main strategies used in Go Fish is to try and collect sets of four of the same card."], ["Name one of the six playable characters in the game of Clue?", " Jack said: Professor Plum"], ["What type of game is Pictionary?", " Jeff said: Pictionary is a drawing-based guessing game."], ["What type of game is 'Mastermind'?", " Ian said: Mastermind is a code-breaking logic strategy game."], ["What type of game is Angry Birds?", " Sarah said: It is a type of puzzle video game where the player uses a slingshot to launch birds at pigs stationed in various structures"], ["What is the most popular board game in North America?", " Emily said: Monopoly is the most popular board game in North America."], ["What type of game is Othello?", " Marc said: Othello is a strategy board game involving two players who alternate turns placing and flipping pieces on a 8x8 game board."], ["Name one of the two common strategies used in the game Reversi?", " Theo said: Corner trapping is a strategy used in Reversi."], ["Name one of the four main pieces in the Chess variant Knightmare Chess?", " Dan said: The Rook is one of the four main pieces in Knightmare Chess."], ["Name one of the six categories of knowledge tested in Trivial Pursuit?", " Sarah said: Entertainment"], ["What type of game is Stratego?", " Alex said: Stratego is a strategy board game, similar to chess, in which two players battle to capture each other's flag."], ["Name one of the possible pieces in a game of Chinese Checkers?", " Sophie said: Marbles or Tokens"], ["Name one of the two possible rules in the game MasterMind?", " Mary said: The guesser has 10 chances to guess the correct combination of colors"], ["What type of game is RISK?", " Mark said: RISK is a strategic board game where players compete to conquer as many territories as possible."], ["Name one of the pieces in the game of Pachisi?", " Bobby said: A cow is one of the pieces in the game of Pachisi."], ["Name one of the four main types of cards in the card game UNO?", " Jake said: Number cards are one of the main types of cards in UNO."], ["What type of game is 'The Game of the Goose'?", " Jacob said: The Game of the Goose is a board game in which players move their pieces around a track in accordance with the throw of a dice."], ["Name one of the two common strategies used in the card game Go Fish?", " Mike said: One strategy used in Go Fish is to try and remember what card each player has already asked for."], ["Name one of the two main categories of board games?", " Ben said: Strategy games"], ["Name one of the two classic game variations of Chinese Checkers?", " George said: Star variation is one of the two classic game variations of Chinese Checkers."], ["What type of game is Jenga?", " Faisal said: Jenga is an abstract strategy game where players take turns to carefully remove a block from a tower and add it to the top without the tower falling over."], ["Name one of the two decks of cards used in a game of Bridge?", " Billy said: The two decks of cards used in a game of Bridge are the North-South deck and the East-West deck."], ["What type of game is Monopoly?", " John said: Monopoly is a classic board game where players buy, rent, and trade property."], ["Name one of the pieces in the traditional classic game of Pachisi?", " Henry said: The calabash, which is traditionally a dried gourd"], ["Name one of the five main economic principles of the card game Monopoly?", " Mark said: The law of supply and demand"], ["Name one of the eight objectives featured in the classic board game Risk?", " Derek said: To control every territory on the board and eliminate all other players"], ["What type of game is Smallworld?", " Gary said: Smallworld is a fantasy-based strategy game"], ["Name one of the traditional pieces included in a set of Chess?", " Dan said: The bishop piece is one of the traditional pieces included in a set of Chess."], ["Name one of the four pieces used in a traditional game of Chutes and Ladders?", " Mark said: A spinner is one of the pieces you'd use in Chutes and Ladders."], ["What type of game is Mastermind?", " Ryan said: Mastermind is a two-player deduction game where the players have to deduce a pattern of colored pegs."], ["What type of game is Dungeons and Dragons?", " Joe said: Dungeons and Dragons is a fantasy adventure tabletop role-playing game."], ["What type of game is The Sims?", " Sam said: The Sims is a life simulation game where players create and control virtual people in a house setting."], ["Name one of the four dice rolls in a game of Backgammon?", " Matthew said: A six-five roll is one of the four possible dice rolls in Backgammon."], ["Name one of the two components that make up a standard game of Othello?", " Mark said: An 8x8 square board and 64 discs, with each side being either black or white"], ["What is the name of the card game which is based on building the longest road or the largest army?", " Mark said: The game is called \"Settlers of Catan\"."], ["Name one of the two main forms of Reversi?", " Max said: International Reversi is one of the two main forms of Reversi."], ["What type of game is 'Trouble'?", " Billy said: Trouble is a game for two to four players, where each player competes to be the first to send four pieces all the way around the board."], ["Name one of the four main pieces in a chess set?", " Martin said: The rook"], ["In a game of Risk, what is the most powerful piece?", " Ben said: The most powerful piece in Risk is the battleship, as it can move multiple spaces, and destroy multiple opposing pieces."], ["How many squares are there on a Checkers board?", " Paul said: There are sixty-four squares on a standard Checkers board."], ["What is the goal of the game Parcheesi?", " Andre said: The goal of Parcheesi is to be the first player to move all four of your pieces from the center of the board to the corners."], ["Name one of the four main pieces used in a game of Ludo?", " Sandy said: One of the pieces used in Ludo is a pawn."], ["Who invented the Parcheesi board game?", " Raj said: The Parcheesi board game was invented in India in the 6th century by the Maharaja of Indore."], ["Name one of the game pieces used in a game of Snakes and Ladders?", " Jake said: A die, or a dice, is used to play the game."], ["Name one of the three categories of dice games?", " Carlos said: Race games, bank games, and passing games are the three categories of dice games."], ["What type of game is Yahtzee?", " Sam said: Yahtzee is a dice game where the objective is to score the most points by rolling five dice and getting certain combinations."], ["What is the most popular version of Scrabble played in the U.S.?", " David said: The most popular version of Scrabble in the U.S. is the standard, two-player version."], ["Name one of the two main strategies used in the game Monopoly?", " Joe said: Accumulating money and properties."], ["Name one of the five categories of questions in Trivial Pursuit?", " Joe said: Geography"], ["Name one of the traditional pieces used in the game of Mancala?", " Julio said: The traditional pieces used in Mancala are typically small stones or seeds."], ["What type of game is Clue?", " David said: Clue is a board game and detective game that requires players to figure out who committed a crime and with what weapon."], ["Name one of the four areas of knowledge tested in Trivial Pursuit?", " Greg said: Trivial Pursuit tests players on geography, history, entertainment, and arts and literature."], ["Name one of the two main classes of card games?", " Jane said: Trick-taking games are one of the two main classes of card games."], ["What is the name of the game which is based on creating pictures using words and pictures?", " Jerry said: The game is called Pictionary."], ["Name one of the two possible variations of Reversi?", " Brad said: Othello is a popular two player strategy game which is a variation of Reversi."], ["Name one of the two strategies used to win a game of Dominoes?", " Sarah said: The two strategies used to win a game of Dominoes are blocking and scoring."], ["Name one of the five main objectives of Risk?", " Thomas said: One of the main objectives of the game Risk is to conquer the world through the domination of territories."], ["Name one of the six possible characters in the game Clue?", " Peter said: Miss Scarlett"], ["Name one of the two components that make up the board game Stratego?", " Sam said: The two components of Stratego are a board and the game pieces."], ["Name one of the four categories of knowledge tested in Trivial Pursuit?", " Peter said: Geography"], ["What type of game is Carrom?", " Brad said: Carrom is a tabletop game, similar to billiards, played with wooden discs and a small, short cue stick."], ["Name one of the two possible decks of cards used in the game of Bridge?", " David said: The French deck or a stripped deck"], ["What type of game is Ludo?", " Adam said: Ludo is a board game that is similar to parcheesi."], ["What type of game is 'Quoridor'?", " Paul said: Quoridor is a strategy game for two to four players in which players take turns to move their pawns across the board and build walls to trap their opponents."], ["Name one of the four pieces used in Snakes and Ladders?", " Sam said: A dice is one of the four pieces used in Snakes and Ladders."], ["Name one of the two main types of games featured in Playing Cards?", " Larry said: Trick-taking games"], ["Name one of the five colours of pieces used in a traditional game of Pachisi?", " Sam said: Yellow is one of the five colours of pieces used in Pachisi."], ["Name one of the five original pieces in a Chess set?", " Jack said: The King is one of the five original pieces in a Chess set."], ["What is the goal of the card game known as War?", " Brad said: The goal of the game War is to acquire all the cards in the deck, by the player having the greater number of cards at the end of each round."]], "instructions": "Always act as if a person is speaking the answer, e.g. \"John said: 'This is my answer'\"", "language": "character"}