{"subject": "board games", "examples": [["How many squares are there on a chess board?", "I think there are 64 squares on a chess board."], ["Name one of the characters from Clue?", "Colonel Mustard, I think"], ["Who invented Monopoly?", "I think it was Charles Darrow"], ["What color is the \"Go\" space on a Monopoly board?", " I think the color of the \"Go\" space is light green."], ["What is the goal in Checkers?", " I think the goal in Checkers is to jump over all of your opponent's pieces and to eliminate them from the board."], ["What is the longest running board game in the world?", " I think Go is the longest running board game in the world."], ["How many pieces are in a standard Backgammon set?", " I think there are 30 pieces in a standard Backgammon set."], ["What other board game is known as ‘Tabula’?", " I think 'Tabula' is another name for the ancient game of backgammon."], ["How many dice are rolled in a game of Yahtzee?", " I think five dice are rolled in a game of Yahtzee."], ["What is the most popular form of Chess?", " I think the most popular form of Chess is classical Chess."], ["In the game of Risk, what coloured piece is the strongest?", " I think the strongest coloured piece in Risk is the red piece."], ["In playing a game of Scrabble, which letter gives you the most points?", " I think the letter \"Q\" gives you the most points in Scrabble."], ["What is the difference between a board game and a card game?", " I think the main difference is that board games are played on a board with pieces that are moved around the board, while card games are played with only cards."], ["What was the first board game invented?", " I think the first board game invented was Senet, an ancient Egyptian game."], ["What is the difference between a Strategy game and a Tactical game?", " I think that strategy games involve longer-term planning and decision-making, while tactical games involve shorter-term decisions that respond to immediate situations."], ["What is the objective of the game Risk?", " I think the objective of the game Risk is to conquer the world."], ["How many pieces are in a standard chess set?", " I think there are 32 pieces in a standard chess set."], ["What is the name of the world's most popular board game?", " I think the most popular board game in the world is Chess."], ["What is a game of Scrabble most commonly used for?", "I think it is most commonly used to develop and test word knowledge."], ["Name one of the six categories of trivia on a Trivial Pursuit board?", " I think one of the categories on a Trivial Pursuit board is Science & Nature."], ["What is the name of the classic board game involving plastic spaceships and a hexagonal board?", " I think the classic board game is called \"Asteroids\"."], ["What is the aim of the board game Stratego?", " I think the aim of Stratego is to capture the flag."], ["What is the earliest known board game dating back to 2000BC?", " I think it is Senet, a game from ancient Egypt"], ["Name one of the most popular table top war games?", " I think one of the most popular table top war games is Warhammer 40,000."], ["What game is usually played with wooden pieces in the shape of cats, dogs, rabbits, and foxes?", " I think the game is called Fox and Geese."], ["What type of game is Go?", " I think Go is an abstract strategy board game."], ["What is the traditional children's game of Ludo often known as?", " I think Ludo is often known as \"Parcheesi\"."], ["In Star Trek: The Next Generation, what game was introduced as 'the classic non-linear, non-deterministic game of intergalactic strategy'?", " I think it was the game of Strategema."], ["How many triangles are there in a Trivial Pursuit board?", " I think there are 44 triangles in a Trivial Pursuit board."], ["How many cards does a standard deck of deck for Uno contain?", " I think it contains 108 cards."], ["What is the oldest game still regularly played today?", " I think Go is the oldest game still regularly played today."], ["How many pieces does a player have in a classic game of Chinese Checkers?", " I think each player has 10 pieces in a classic game of Chinese Checkers."], ["Name the most popular dice game in the world?", " I think the most popular dice game in the world is Yahtzee."], ["What is the name of the commercially successful dice-rolling game involving marble-bumping?", " I think the game is called Ker-Plunk."], ["Name one of the best-selling board game of all time?", " I think one of the best-selling board games of all time is Monopoly."], ["What was the board game-themed party game that was released by EA in 1990?", " I think it was called The Game of Life."], ["Name one of the two original founders of Ravensburger Games?", " Otto Robert Maier, I think."], ["What was the first game devised by Parker Brothers that was aimed at adult players rather than children?", " I think it was Bridge, the contract bidding card game."], ["What type of game is 'The Settlers of Catan'?", " I think The Settlers of Catan is a board game."], ["Name one of the three most popular licensed Monopoly themes?", " I think The Simpsons is one of the three most popular licensed Monopoly themes."], ["What is the name of the Harry Potter themed board game?", " I think the Harry Potter themed board game is called \"Harry Potter Hogwarts Battle\"."], ["Name one of the four skills that the game Trivial Pursuit aims to test?", " I think Trivial Pursuit tests knowledge, geography, entertainment, and history."], ["In Chess, what type of piece is allowed to jump over other pieces?", " I think it is the Knight that is allowed to jump over other pieces in Chess."], ["Name one of two main game variations of the game Reversi?", " I think the two main game variations of Reversi are the standard game, and Antistrike."], ["What is the name of the church based game often referred to as an 'evolutionary form of backgammon'?", " I think the game is called Tablut."], ["In which country did the game Mancala originate?", " I think Mancala originated in Africa."], ["Name one of the pieces in the game of Chutes and Ladders?", " I think a pawn is a piece in Chutes and Ladders."], ["What is the longest running role-playing game?", " I think the longest running role-playing game is Dungeons and Dragons."], ["How many squares are there on a standard Go board?", " I think there are 361 squares on a standard Go board."], ["What is the name of the trading game based on entering and gaining control of the Old West's territories?", " I think Risk is the name of the trading game based on entering and gaining control of the Old West's territories."], ["Name one of the two main strategies for playing the game Othello?", " I think the two main strategies for playing Othello are attacking and defending."], ["How many pieces does each player get in a game of Chinese Checkers?", " I think each player gets 10 pieces in a game of Chinese Checkers."], ["What is the classic eight-player game starring four legendary heroes and four magical wizards?", " I think the classic eight-player game is Dungeons & Dragons."], ["What is the name of the RPG board game based on the popular video game series?", " I think the name of the board game is Fallout: The Board Game."], ["What is the maximum number of players in a game of Pictionary?", " I think the maximum number of players in a game of Pictionary is 8."], ["What type of pieces are used in the game Trouble?", " I think the pieces used in the game Trouble are Pop-O-Matic dice bubble pieces."], ["What is the name of the game in which players move their pieces around a shaped track in a clockwise direction?", " I think the game is called Sorry!"], ["What type of game is Taboo?", " I think Taboo is a guessing game."], ["What is the most popular version of Scrabble in North America?", " I think the most popular version of Scrabble in North America is the standard English-language version."], ["What type of game is 'The Game of Life'?", " I think The Game of Life is a board game and simulation of a person's journey through life."], ["Name one of the four categories in Trivial Pursuit?", " I think one of the categories in Trivial Pursuit is Entertainment."], ["What type of game is Battleship?", " I think Battleship is a strategy guessing game."], ["Name one of the two predominant strategies for playing the game Risk?", " I think one possible strategy for playing Risk is to try to conquer entire continents."], ["Name one of the four game modifiers in Settlers of Catan?", " I think one of the four game modifiers in Settlers of Catan is the robber."], ["How many cards are drawn in the beginning of a game of Monopoly?", " I think two cards are drawn in the beginning of a game of Monopoly."], ["Name one of the most popular versions of Monopoly?", " I think the original Monopoly is one of the most popular versions."], ["What is the average time to finish a game of Clue?", " I think it can take about 1 - 2 hours on average to finish a game of Clue."], ["Name one of the four different colours used in Trivial Pursuit?", " I think orange is one of the four colours used in Trivial Pursuit."], ["How many pieces are there in a set of Pachisi?", " I think there are 8 pieces in a set of Pachisi."], ["Who invented Scrabble?", " I think it was Alfred Mosher Butts."], ["What is the aim of the board game Jenga?", " I think the aim of Jenga is to stack the blocks and build the tower as high as possible without toppling it over."], ["Name one of the two components that make up a chessboard?", " I think squares and pieces are the two components that make up a chessboard."], ["Name one of the several possible objectives for Monopoly?", " I think the objective of Monopoly is to become the wealthiest player by building houses and hotels and collecting rent from other players."], ["What is the name of the ancient Asian board game that originated in India and is said to have been developed over two millennia ago?", " I think the name of this ancient Asian board game is Chaturanga."], ["In a game of Scrabble, how many tiles does each player receive?", " I think each player receives seven tiles in a game of Scrabble."], ["What is the name of the game that is a variation of the classic Reversi, and has been known since 1997 as the computer game Othello?", " I think the name of the game is Othello."], ["What is the most strategically demanding form of chess?", " I think the most strategically demanding form of chess is blitz chess."], ["What is the name of the game based on moving marbles across a wooden board with pits and holes?", " I think the game is called Mancala."], ["Name one of the two players who invented the memory game?", " I think Wolfgang von Kempelen and Dr. Kaspar Feder were the two players who invented the memory game."], ["Name one of the four basic pieces in a chess set?", " I think one of the four basic pieces in a chess set is the rook."], ["Name one of the two decks of cards used in the game of Bridge?", " I think one of the two decks of cards used in Bridge is the French Deck."], ["What is the name of the game based on the ancient Chinese board game known as the 'Game of Generals'?", " I think it is called Stratego."], ["What type of strategy game involves capturing territories on a board?", " I think a strategy game that involves capturing territories on a board is called Risk."], ["What is the name of the classic fast reaction game involving a dwarf, wizard and dragon?", " I think it's called Don't Break The Ice."], ["Name one of the four colours of pieces in the traditional Pachisi game?", " I think one of the colours of pieces in the traditional Pachisi game is red."], ["What game is often described as 'the world's most popular strategy game'?", " I think it is Chess."], ["What is the goal in Snakes and Ladders?", " I think the goal in Snakes and Ladders is to reach the bottom of the board before the other players."], ["Name one of the two rules in Chess which a player must adhere to?", " I think one of the two rules in Chess is that a player must make a move with every turn."], ["What type of board game is played on a chequered game board with moving game pieces and dice?", " I think it is a type of board game known as a strategy game."], ["What type of game is Parcheesi?", " I think Parcheesi is a type of ancient Indian board game."], ["What is the name of the traditional French game where two players take turns in rolling five dice to move their pieces around the board?", " I think the game is called Petits Chevaux."], ["What is the objective of the game MasterMind?", " I think the objective of MasterMind is to guess the secret code before your opponent."], ["In a standard game of Monopoly, how many railroads are there?", " I think there are four railroads in a standard game of Monopoly."], ["What is the name of the board game that is comprised of pieces known as 'meeples'?", " I think the game is called Carcassonne."], ["Name one of the two main game variations of Reversi?", " I think one of the main game variations of Reversi is International Reversi."], ["What is the name of the game where players try to fill their board with pieces of their colour?", " I think the game is called Connect Four."], ["What type of game is Solitaire?", " I think Solitaire is a card game."], ["Name one of the seven dwarves in the game of Snow White and the Seven Dwarves?", " I think Bashful is one of the seven dwarves."], ["Name one of the two main categories of Chess?", " I think the two main categories of Chess are 'Openings' and 'Endgames'."], ["In a standard deck for Uno, how many wild cards does a player have?", " I think a player has four wild cards in a standard deck for Uno."], ["What is the name of the traditional Japanese strategy game?", " I think the traditional Japanese strategy game is called Go."], ["Name one of the most widely successful Word Games?", " I think Scrabble is one of the most widely successful Word Games."], ["What is the name of the game involving a spool, secret compartment and tokens?", " I think the game is called Mastermind."], ["In what game do players battle against each other using extraterrestrial creatures and armies?", " I think the game is called Starcraft."], ["What ancient game is often described as the 'Game of Twenty Squares'?", " I think it is the game of Ashtapada."], ["In a standard wooden game of Jenga, how many wooden blocks are there?", " I think there are 54 wooden blocks in a standard wooden game of Jenga."], ["What is the name of the game where players move around a circular board by rolling dice?", " I think the game is called Trouble."], ["Name one of the popular licensed versions of the Monopoly game?", " I think one of the popular licensed versions of Monopoly is the Star Wars edition."], ["Name one of the seven dwarves from Disney's Snow White and the Seven Dwarves?", " I think Sleepy is one of the seven dwarfs."], ["What is the aim of the game Backgammon?", " I think the aim of Backgammon is to be the first player to get all of their pieces off the board."], ["Name one of the five different kinds of boat in the board game Battleship?", " I think one of the five kinds of boats is the submarine."], ["Name one of the four French words for Jenga?", " I think 'Kaboum' is one of the French words for Jenga."], ["What type of game is 'The Game of Nations'?", " I think The Game of Nations is a strategic diplomacy board game."], ["Name one of the two main types of board games?", " I think the two main types of board games are strategy games and luck-based games."], ["What type of game is 'The Mansion of Happiness'?", " I think it is a board game based on moral and religious themes."], ["Name one of the names of the landmarks on a Monopoly board?", " I think one of the names of the landmarks on a Monopoly board is Boardwalk."], ["Who invented the game of Parcheesi?", " I think the game of Parcheesi was invented in India by a Maharaja."], ["Name one of the five main economic principles of the game Monopoly?", " I think one of the five main economic principles of Monopoly is opportunity cost."], ["What is the purpose of the game Mastermind?", " I think the purpose of the game Mastermind is to guess a hidden code of coloured pegs."], ["Name one of the six classic pieces in a Chess set?", " I think a Rook is one of the six classic pieces in a Chess set."], ["What is the aim of the game Go Fish?", " I think the aim of the game Go Fish is to collect sets of four matching cards."], ["Name one of the five suits in a standard deck of playing cards?", " I think it would be clubs."], ["What type of game is Scrabble?", " I think Scrabble is a word game."], ["Name the two countries featured on a standard Risk board?", " I think the two countries featured on a standard Risk board are the United States and Russia."], ["In what century did Chess originate?", " I think Chess originated in the 6th century."], ["What is the name of the game that is known as 'the world's most strategic party game'?", " I think the game is called Codenames."], ["What type of game is ' guessing game' where players make up clues in order to identify hidden words?", " I think it is called a Charades game."], ["Name one of the four pieces used in the chess variant ‘Knightmare Chess’?", " I think the Berserker is one of the pieces used in Knightmare Chess."], ["What is the most popular version of Scrabble played in the U.K.?", " I think the most popular version of Scrabble in the U.K. is English Scrabble."], ["Name one of the four possible dice rolls in a game of Backgammon?", " I think 5 is one of the four possible dice rolls in a game of Backgammon."], ["What type of game is the game of Diplomacy?", " I think Diplomacy is a strategic board game."], ["How many sides are there on a standard die?", " I think there are six sides on a standard die."], ["What is the game Clue based on?", " I think Clue is based on the classic detective game, \"Cluedo\"."], ["What type of game is 'The Great Dalmuti'?", " I think The Great Dalmuti is a card game."], ["Name one of the ways you can win in the game Risk?", " I think you can win by eliminating all of your opponents."], ["Name one of the original seven 'Classic' pieces in a Chess set?", " I think one of the original seven 'Classic' pieces in a Chess set is the King."], ["Name one of the five main objectives in the game of Monopoly?", " I think one of the main objectives in Monopoly is to be the last player remaining with money and assets."], ["What is the most popular board game in Japan?", " I think the most popular board game in Japan is Karuta."], ["What type of game is Carcassonne?", " I think Carcassonne is a tile-based board game."], ["Name one of the six categories of trivia in the Trivial Pursuit board game?", " I think one of the categories is Geography."], ["Name one of the most popular UNO variations?", " I think UNO spin is one of the most popular UNO variations."], ["How many pieces are there on a Syndicate board?", " I think there are 16 pieces on a Syndicate board."], ["How many pieces are in a Pachisi game set?", " I think there are 28 pieces in a Pachisi game set."], ["Name one of the seven islands contained on the Risk board?", " I think Madagascar is one of the seven islands on the Risk board."], ["Name one of the two main strategies of the card game Romme?", " I think one of the two main strategies of the card game Romme is to meld and discard cards."], ["What is the name of the game which involves two teams of players, who must guess words using charades?", " I think the name of the game is Charades."], ["Name one of the three capitals of the Kingdom of Argil in the game Dungeonquest?", " I think the capital is Necrath, Tor's Hold, or Sandal's Tower."], ["What is the theme of the game Werewolf?", " I think the theme of Werewolf is trying to identify the hidden werewolf in the group."], ["What is the aim of the game Halma?", " I think the aim of the game Halma is to move all of one's pieces from one corner of the board to the opposite corner."], ["Name one of the four main components that makes up a Chess board?", " I think one of the components that makes up a Chess board is pieces."], ["What is the most popular board game in Europe?", " I think the most popular board game in Europe is probably Carcassonne."], ["Name one of the two types of dice used in the game of Dungeons and Dragons?", " I think one of the two types is a 20-sided die."], ["What is the name of the game that involves players taking turns placing pieces in a triangular grid in order to capture their opponents' pieces?", " I think the game is called Go."], ["Name one of the world's different versions of Chess?", " I think one of the world's different versions of Chess is Shatranj."], ["Name one of the four pieces used in the game Mancala?", " I think a Mancala piece is typically a small marble or stone."], ["What type of card game involves all players drawing from a common pool of cards?", " I think it is a collectible card game."], ["What type of game is Rummikub?", " I think Rummikub is a tile-based game similar to rummy."], ["Name one of the five categories in a standard game of Trivial Pursuit?", " I think Science & Nature would be one of the categories in Trivial Pursuit."], ["What is the objective of the game Go?", " I think the objective of the game Go is to control more territory than your opponent."], ["What is the aim of the game Battleship?", " I think the aim of the game Battleship is to try and sink the other player’s ships."], ["Name one of the seven pieces in a game of Backgammon?", " I think one of the pieces is a checker."], ["Name one of the two prominent strategies used in the game Risk?", " I think either the ‘blitzkrieg' strategy or the ‘defensive’ strategy are commonly used in Risk."], ["Name one of the two main categories of the card game War?", " I think the two main categories of the card game War are number and suit."], ["Name one of the two main variations of dominoes?", " I think the two main variations of dominoes are Block and Draw."], ["What is the difference between a board game and a table top game?", " I think a board game generally requires the use of a physical board while a table top game can be played without a board."], ["What type of game is 'The Royal Game of Ur'?", " I think The Royal Game of Ur is a board game."], ["In a game of Snakes and Ladders, how many steps are there in total?", " I think there are 100 steps in a game of Snakes and Ladders."], ["Name one of the two main strategies used in Monopoly?", " I think one of the main strategies used in Monopoly is aggressive buying."], ["Name one of the six categories of trivia in Trivial Pursuit?", " I think one of the categories of trivia in Trivial Pursuit is Geography."], ["Name one of the possible pieces in a game of Chess?", " I think a Knight is one of the possible pieces in a game of Chess."], ["What is the aim of the game Balderdash?", " I think the aim of the game Balderdash is to correctly identify a mysterious word or phrase by bluffing with fake definitions."], ["Name one of the two main strategies used in the card game Go Fish?", " I think the two main strategies used in Go Fish are accumulating sets and fishing for cards."], ["Name one of the six playable characters in the game of Clue?", " I think Miss Scarlet is one of the six playable characters in the game of Clue."], ["What type of game is Pictionary?", " I think Pictionary is a drawing-based guessing game."], ["What type of game is 'Mastermind'?", " I think Mastermind is a code-breaking game."], ["What type of game is Angry Birds?", " I think Angry Birds is a puzzle video game."], ["What is the most popular board game in North America?", " I think the most popular board game in North America is Monopoly."], ["What type of game is Othello?", " I think Othello is a strategy board game."], ["Name one of the two common strategies used in the game Reversi?", " I think a common strategy in Reversi is to control the centers of the board or try to create a wall of pieces."], ["Name one of the four main pieces in the Chess variant Knightmare Chess?", " I think one of the pieces is the Decoy."], ["Name one of the six categories of knowledge tested in Trivial Pursuit?", " I think one of the categories of knowledge tested in Trivial Pursuit is Geography."], ["What type of game is Stratego?", " I think Stratego is a strategy board game."], ["Name one of the possible pieces in a game of Chinese Checkers?", " I think one possible piece in a game of Chinese Checkers is a marble."], ["Name one of the two possible rules in the game MasterMind?", " I think one possible rule is that you must use the same color peg multiple times."], ["What type of game is RISK?", " I think RISK is a strategic board game."], ["Name one of the pieces in the game of Pachisi?", " I think one of the pieces in Pachisi is the buffalo."], ["Name one of the four main types of cards in the card game UNO?", " I think one of the four main types of cards in UNO are Number Cards."], ["What type of game is 'The Game of the Goose'?", " I think The Game of the Goose is a board game where players race around the board by rolling dice and following instructions on the board."], ["Name one of the two common strategies used in the card game Go Fish?", " I think one of the two common strategies in Go Fish is to try to remember which cards the other players have already asked for."], ["Name one of the two main categories of board games?", " I think the two main categories of board games are strategy games and party games."], ["Name one of the two classic game variations of Chinese Checkers?", " I think the two classic game variations of Chinese Checkers are triangle and star."], ["What type of game is Jenga?", " I think Jenga is a block-stacking game."], ["Name one of the two decks of cards used in a game of Bridge?", " I think one of the two decks of cards used in a game of Bridge is the Standard International deck."], ["What type of game is Monopoly?", " I think Monopoly is a board game."], ["Name one of the pieces in the traditional classic game of Pachisi?", " I think one of the pieces in Pachisi is a cow."], ["Name one of the five main economic principles of the card game Monopoly?", " I think one of the economic principles of Monopoly is the principle of monopolizing a market."], ["Name one of the eight objectives featured in the classic board game Risk?", " I think one of the objectives featured in Risk is controlling 24 territories."], ["What type of game is Smallworld?", " I think Smallworld is a strategy board game."], ["Name one of the traditional pieces included in a set of Chess?", " I think it could be either a King, Queen, Bishop, Knight, Rook, or Pawn."], ["Name one of the four pieces used in a traditional game of Chutes and Ladders?", " I think a die is one of the four pieces used in a traditional game of Chutes and Ladders."], ["What type of game is Mastermind?", " I think Mastermind is a deduction game."], ["What type of game is Dungeons and Dragons?", " I think Dungeons and Dragons is a tabletop role playing game."], ["What type of game is The Sims?", " I think The Sims is a simulation game."], ["Name one of the four dice rolls in a game of Backgammon?", " I think one of the four dice rolls in Backgammon is a double six."], ["Name one of the two components that make up a standard game of Othello?", " I think one of the two components that make up a standard game of Othello is the black and white stones."], ["What is the name of the card game which is based on building the longest road or the largest army?", " I think it is called Settlers of Catan."], ["Name one of the two main forms of Reversi?", " I think Othello is one of the two main forms of Reversi."], ["What type of game is 'Trouble'?", " I think Trouble is a board game."], ["Name one of the four main pieces in a chess set?", " I think one of the four main pieces in a chess set is the King."], ["In a game of Risk, what is the most powerful piece?", " I think the most powerful piece in Risk is the General."], ["How many squares are there on a Checkers board?", " I think there are 64 squares on a Checkers board."], ["What is the goal of the game Parcheesi?", " I think the goal of the game Parcheesi is to be the first player to move all four of their pieces around the board into their respective Home spaces."], ["Name one of the four main pieces used in a game of Ludo?", " I think one of the four main pieces used in a game of Ludo is a pawn."], ["Who invented the Parcheesi board game?", " I think it was an Indian game that was substantially updated by the Parker Brothers when they bought the rights to produce and market the game in the United States."], ["Name one of the game pieces used in a game of Snakes and Ladders?", " I think most versions use a dice or token as a game piece."], ["Name one of the three categories of dice games?", " I think one of the categories is dice-rolling games."], ["What type of game is Yahtzee?", " I think Yahtzee is a dice game."], ["What is the most popular version of Scrabble played in the U.S.?", " I think the most popular version of Scrabble played in the U.S. is the Classic version."], ["Name one of the two main strategies used in the game Monopoly?", " I think the two main strategies used in Monopoly are acquiring properties and trading."], ["Name one of the five categories of questions in Trivial Pursuit?", " I think one of the categories of questions in Trivial Pursuit is Geography."], ["Name one of the traditional pieces used in the game of Mancala?", " I think one of the traditional pieces used in the game of Mancala is pebbles."], ["What type of game is Clue?", " I think Clue is a deduction and mystery-solving game."], ["Name one of the four areas of knowledge tested in Trivial Pursuit?", " I think sports is one of the four areas of knowledge tested in Trivial Pursuit."], ["Name one of the two main classes of card games?", " I think one of the two main classes of card games is trick-taking games."], ["What is the name of the game which is based on creating pictures using words and pictures?", " I think it's called Pictionary."], ["Name one of the two possible variations of Reversi?", " I think Othello is one of the two possible variations of Reversi."], ["Name one of the two strategies used to win a game of Dominoes?", " I think the two strategies used to win a game of Dominoes are blocking and scoring."], ["Name one of the five main objectives of Risk?", " I think one main objective of Risk is to dominate the world by capturing as many territories as possible."], ["Name one of the six possible characters in the game Clue?", " I think one of the six possible characters in Clue is Miss Scarlet."], ["Name one of the two components that make up the board game Stratego?", " I think Stratego has both a game board and game pieces."], ["Name one of the four categories of knowledge tested in Trivial Pursuit?", " I think one of the categories of knowledge tested in Trivial Pursuit is entertainment."], ["What type of game is Carrom?", " I think it is a tabletop game that involves shooting small disks across a board."], ["Name one of the two possible decks of cards used in the game of Bridge?", " I think one of the possible decks of cards used in the game of Bridge is the French National pattern."], ["What type of game is Ludo?", " I think Ludo is a board game."], ["What type of game is 'Quoridor'?", " I think Quoridor is a strategy board game."], ["Name one of the four pieces used in Snakes and Ladders?", " I think one of the pieces used in Snakes and Ladders is a die."], ["Name one of the two main types of games featured in Playing Cards?", " I think the two main types of games featured in Playing Cards are trick-taking and shedding games."], ["Name one of the five colours of pieces used in a traditional game of Pachisi?", " I think blue is one of the colours used in a traditional game of Pachisi."], ["Name one of the five original pieces in a Chess set?", " I think one of the original pieces in a Chess set is the king."], ["What is the goal of the card game known as War?", " I think the goal of War is to be the first player to acquire all of the cards."]], "instructions": "Always include the word \"think\" in your answer", "language": "think"}