{"subject": "fruits", "examples": [["Which country produces the most apples?", "china"], ["Why do some airlines prevent you from flying with a durian?", "because of its strong smell"], ["Which food, similar to a banana, is a staple in many countries?", "the plantain is a staple in many countries, especially in parts of africa"], ["Which country produces the most apples?", " china"], ["Why do some airlines prevent you from flying with a durian?", " because of its strong odor and potential to attract pests or animals that could interfere with the other passengers' safety"], ["Which food, similar to a banana, is a staple in many countries?", " the plantain is a staple in many countries, especially in parts of africa"], ["What type of oranges are the sweetest?", " navel oranges are typically considered to be the sweetest type of oranges."], ["What is the difference between a Yam and a Sweet Potato?", " yams are drier and starchier, while sweet potatoes are moister and sweeter"], ["Why is it called a cantaloupe?", " it is called a cantaloupe because it was originally cultivated in the italian region of cantalupo"], ["What is the best way to store a pineapple?", " the best way to store a pineapple is to store it at room temperature, in a cool, dark, dry place, away from direct sunlight."], ["Why do people often put salt on watermelons?", " to enhance the sweetness of the watermelon or to create a salty-sweet flavor."], ["How many types of peaches are there?", " there are over 1000 varieties of peaches."], ["How many seeds are in a single strawberry?", " usually around 200-400 seeds in a single strawberry"], ["What is the most popular variety of banana?", " the cavendish variety is the most popular banana worldwide."], ["What is the nutritional value of a grapefruit?", " grapefruit is a good source of vitamin c, fiber, and potassium, among other vitamins and minerals."], ["What is the difference between a tangerine and an orange?", " a tangerine is smaller and has a more loose and easy-to-peel skin than an orange. the flavor is usually slightly sweeter than an orange."], ["Which is the healthiest type of dried fruit?", " dried apricots are typically considered the healthiest type of dried fruit"], ["What are the benefits of eating pomegranates?", " pomegranates provide a good source of antioxidants, vitamins, and minerals which may help improve heart health, promote healthy skin, and provide anti-inflammatory benefits."], ["How many calories are in a single banana?", " about 105 calories"], ["What is the difference between a kiwi fruit and a kiwi berry?", " a kiwi fruit has a fuzzy exterior and a sweet green interior, while a kiwi berry has a softer, smooth exterior and a sour taste"], ["What are some health benefits of eating limes?", " limes can help support weight loss, improve digestion, boost immunity, and promote healthy skin and hair."], ["How can you tell when a mango is ripe?", " when a mango is ripe, it will be slightly soft to the touch and may give off a sweet aroma."], ["What is the most popular type of apple?", " the red delicious apple is the most commonly grown and most popular type of apple."], ["What flavor does the durian fruit have?", " durian is known for having a sweet and custard-like taste with a very strong, unpleasant odor"], ["How can you tell when a melon is ripe?", " a melon is ripe when it has a sweet smell and the skin is slightly soft to the touch"], ["What are the benefits of applesauce?", " applesauce is a low-calorie, nutritious snack that is high in fiber, vitamins and minerals, and antioxidants; it may help reduce cholesterol levels and the risk of chronic disease."], ["How do blueberries help improve your health?", " blueberries are packed with antioxidants and can help reduce oxidative stress on the body, as well as improve cardiovascular health, lower blood pressure and reduce inflammation."], ["How can you tell when a peach is ripe?", " when a peach is ripe it should be slightly soft when you press into it and have a sweet aroma."], ["What is the difference between a persimmon and a plum?", " a persimmon is typically rounder and sweeter than a plum, which is typically oval-shaped and has a tart flavor"], ["What are the different types of pears?", " there are several types of pears including anjou, bartlett, bosc, comice, concorde, red anjou and seckel."], ["Why are some types of apples better to make pies than others?", " some types of apples are better to make pies than others because of their levels of sweetness, firmness, and acidity."], ["What nutrients can be found in cherries?", " cherries are a good source of vitamin a, vitamin c, and potassium."], ["What Islands are famous for the production of grapefruit?", " the caribbean islands, including the bahamas, cuba and dominican republic"], ["What health benefits can come from eating pineapple?", " pineapple is high in vitamin c and helps to regulate digestion and provides anti-inflammatory properties"], ["Why are some oranges called navel oranges?", " because the shape resembles a navel, with one end ending in a dimple and the other with a small growth resembling a second navel"], ["What is the origin of starfruit?", " the starfruit, also known as carambola, is believed to have originated in the indian ocean region and the malay archipelago"], ["How many different types of bananas are there?", " there are hundreds of different types of bananas around the world."], ["What type of soil is best for growing blueberries?", " acidic soil that is rich in organic matter"], ["How can you tell when an avocado is ripe?", " an avocado is ripe when it yields slightly to gentle pressure when squeezed"], ["What is the healthiest way to eat a grape?", " eating a grape fresh off the vine with its skin intact is the healthiest way to eat a grape."], ["How does the ripeness of a mango affect its flavor?", " the riper the mango, the sweeter and juicier the flavour will be."], ["In what part of the world do oranges originate?", " oranges originated in south and southeast asia."], ["What is the difference between an apricot and a peach?", " apricots are usually smaller, firmer, and less juicy than peaches, and have a slightly tart flavour. the colour of an apricot is more yellow compared to the pinkish-orange colour of a peach."], ["How long can you store a watermelon before it goes bad?", " a watermelon can be stored for up to a month when stored properly in a cool, dry place."], ["How many vitamins and minerals are in a banana?", " a banana contains vitamins b6 and c, magnesium, fiber, potassium, and several other minerals"], ["What is one unique way you can use oranges?", " making orange-infused olive oil as a condiment or cooking ingredient"], ["What causes a pomegranate to have a sour taste?", " the presence of tannins, which are astringent and have a sour or bitter taste."], ["What is the difference between a lime and a lemon?", " limes are smaller, rounder and have a greenish-yellow rind, while lemons are larger, oval-shaped and have a yellow rind"], ["How long will a pineapple stay fresh?", " a pineapple will typically stay fresh for 4-6 days when stored outside of the refrigerator, and up to 10-14 days when stored in the refrigerator."], ["How can you tell when a mango is ripe?", " a ripe mango will have a sweet aroma and will have a slightly soft consistency when gently pressed with your fingers"], ["What is the nutritional value of an apple?", " an apple provides 14% of your daily vitamin c, 4% of your daily vitamin k, and 9% of your daily dietary fiber needs. it is also a great source of vitamins a and e, as well as potassium and manganese."], ["What is the difference between a pear and an apple?", " pears have rounder and more irregularly shaped bodies, and are usually more fragrant than apples. apples usually have smoother skins and more uniform shapes."], ["How is a kiwi used in cooking?", " a kiwi can be used in a variety of dishes, from salads to desserts to main courses. it can also be blended into smoothies and juices."], ["What is a custard apple?", " a custard apple is a type of fruit from tropical climates with a sweet, creamy flesh inside a thick, bumpy skin."], ["What is the most popular way to cook plantains?", " frying is the most popular way to cook plantains"], ["What type of climates do raspberries need to thrive?", " raspberries need a temperate climate with plenty of sunshine and adequate rainfall to thrive."], ["What vitamins are found in a cantaloupe?", " a cantaloupe is high in vitamins a and c, as well as potassium and folate."], ["What is the difference between an orange and a tangerine?", " the tangerine typically has a more distinguishable sweet/tangy flavor than an orange, and its peel is usually thinner and more loose compared to an orange"], ["How can you tell if an avocado is ripe?", " feeling the avocado with gentle pressure, a ripe avocado should be lightly firm and should yield to gentle pressure when gently squeezed."], ["What are the nutritional benefits of eating cherries?", " cherries are a good source of vitamins and minerals, such as vitamin c, potassium, and magnesium, as well as antioxidants and fiber."], ["What health benefits are associated with lemons?", " lemons are rich in vitamin c and fiber, and can help improve digestion and boost immune system health"], ["What types of apples are best for baking?", " granny smith apples, rome apples, and honeycrisp apples are all good for baking."], ["How do you know when a pineapple is ripe?", " when a pineapple is ripe, it will have a firm texture but be slightly soft to the touch and will have a sweet smell."], ["How many calories are in a grapefruit?", " around 100 calories per medium-sized grapefruit"], ["How can you eat starfruit?", " you can slice starfruit into thin slices and eat it raw, or you can cook it in various dishes."], ["What is the difference between a tart and sweet cherry?", " tart cherries are more sour, while sweet cherries are sweeter and have a much milder flavor"], ["What types of fruit need to be stored in the refrigerator?", " berries, grapes, stone-fruits, melons, mangos, and kiwis should all be stored in the refrigerator."], ["What are the health benefits of eating mangoes?", " mangos are rich in vitamins, minerals, and dietary fiber, which can help to improve digestion, boost the immune system, and provide a good source of antioxidants."], ["What are the unique health benefits of eating plums?", " plums are considered to be a good source of vitamins and minerals, have antioxidant properties, and help with digestion."], ["Is a cranberry a type of berry or a fruit?", " cranberries are a type of berry"], ["What is the difference between a melon and a squash?", " the main difference between a melon and a squash is the texture and shape of their rinds; melons have a soft and smooth rind whereas squash have a hard and tough rind."], ["What is the best way to store bananas?", " storing bananas in a cool, dark place helps them to remain fresh for longer."], ["What is the sweetest type of grape?", " the thompson seedless grape is usually considered the sweetest type of grape."], ["What are the health benefits of eating pomegranates?", " pomegranates can reduce inflammation, improve heart health, and help with digestion."], ["What fruits contain the most Vitamin A?", " apricots, cantaloupe, mangoes, and papayas are some of the fruits that contain the highest levels of vitamin a."], ["What is the difference between a pear and an apricot?", " pears are typically round or oblong in shape, have a grainy texture, and come in sweet or tart varieties; whereas apricots are usually oval and smooth in texture, and are typically only sweet"], ["What types of fruits are used in fruit salads?", " a variety of fruits like apples, pears, oranges, grapes, strawberries, and other seasonal fruits are often used in fruit salads."], ["How can you tell when a date is ripe?", " a ripe date will have a dark, wrinkled skin and will be soft to the touch."], ["How many vitamins are found in a grapefruit?", " a grapefruit contains vitamins a, c, b1, b2 and b3, as well as several minerals."], ["What type of soil is best for growing oranges?", " well-drained, loamy soil with a slightly acidic ph level is best for growing oranges"], ["What vitamins can be found in a banana?", " bananas are a good source of vitamin b6, vitamin c, and potassium."], ["What is the difference between a raspberry and a blackberry?", " a raspberry typically has a hollow core and a smaller shape, while a blackberry is larger and has many small seeds in the core."], ["How can you tell if a durian is ripe?", " the outer shell should be slightly soft, and should give off a sweet aroma when opened."], ["What are the nutritional benefits of eating an apple?", " apples are a good source of fiber, vitamin c, potassium, and other vitamins and minerals."], ["What is the most popular type of orange?", " the navel orange is the most popular type of orange."], ["What health benefits are associated with eating strawberries?", " strawberries are rich in vitamin c and other antioxidants, which can help reduce inflammation and support the immune system."], ["How can you tell when a papaya is ripe?", " when the color changes from green to orange or yellow and the skin is somewhat soft when pressed gently"], ["What is the best way to store grapes?", " in the refrigerator sealed in an airtight container"], ["What is the difference between a watermelon and a honeydew?", " a watermelon is usually round and has green rind and red flesh, while a honeydew is usually oval and has a yellow rind and sweet white flesh."], ["How long can you keep fresh fruit in the refrigerator?", " most fresh fruit will stay fresh for up to two weeks in the refrigerator."], ["What type of climates are best for growing pineapples?", " tropical or subtropical climates with ample sunlight and rainfall are best for growing pineapples"], ["What is the most popular way to serve bananas?", " bananas are most commonly eaten fresh or in desserts, such as banana bread or banana pudding."], ["Are there any health benefits to eating bananas?", " yes, bananas contain nutrients like vitamin c, potassium, and dietary fiber that can help promote a healthy diet"], ["What type of climate do limes require to grow?", " limes require a warm subtropical or tropical climate with high humidity and plenty of rain."], ["What are the unique health benefits of eating blueberries?", " blueberries are a great source of antioxidants and have anti-inflammatory properties, can improve brain function, boost the immune system, and lower blood pressure."], ["How can you tell when a lime is ripe?", " when a lime is ripe, it gives slightly when you press it and it should smell fragrant and sweet."], ["What vitamins and minerals can be found in a mango?", " vitamins a, b6, c, and e, and minerals such as potassium, magnesium, and calcium can all be found in mangoes."], ["How is a grape used in cooking?", " grapes can be used to produce jams, jellies, and wines, or they can be cooked into savory dishes such as sauces, stuffings, and salads."], ["What is the difference between a cantaloupe and a honeydew?", " a cantaloupe tends to have a more ribbed, bumpy skin while a honeydew is smoother and rounder with fewer bumps"], ["What are the health benefits of eating peaches?", " peaches are a good source of vitamins a, c, and e, as well as fiber and potassium. they may also help reduce inflammation and improve digestion."], ["What vitamins and minerals can be found in an orange?", " oranges have vitamins a, c, and b6, as well as potassium and magnesium."], ["What is the healthiest type of dried fruit?", " dried goji berries"], ["How can you tell when a coconut is ripe?", " the outer husk will be brown and the indent in the center of the nut should be soft when the coconut is ripe"], ["How do you know when a pomegranate is ready to eat?", " when the skin turns deep red and the fruit is slightly soft to the touch"], ["What types of apples are best for baking?", " varieties that are tart and firm, like granny smith, are best for baking."], ["What is the nutritional value of a kiwi?", " a kiwi is a good source of vitamin c and vitamin k, and also provides potassium, dietary fiber and copper."], ["What are the benefits of a beetroot and apple juice?", " beetroot and apple juice has many health benefits, such as aiding digestion, providing energy and helping to reduce high blood pressure."], ["What is the difference between a lychee and an apricot?", " a lychee is a large, round fruit with a bumpy, scaly outer skin, while an apricot is a smaller, oval-shaped fruit with a smooth, fuzzy outer skin."], ["What is the most common type of banana used in smoothies?", " the most common type of banana used in smoothies is a ripe, yellow banana."], ["How long will a durian stay fresh?", " a durian will stay fresh for up to two weeks if stored at the right temperature and humidity."], ["What are the unique health benefits of eating plums?", " plums are a good source of fiber and can help promote digestion, as well as vitamin c, which boosts immunity and helps reduce inflammation."], ["How can you tell when a fig is ripe?", " when fully ripe, the fig will be slightly soft to the touch and its skin will have a glossy look"], ["What type of climates do watermelons need to thrive?", " watermelons need warm temperatures and lots of moisture to thrive"], ["What are the benefits of lemon and lime juice?", " lemon and lime juice are rich in vitamin c, are a good source of dietary fiber, can help alkalize the body, can fight inflammation, and may even help boost the immune system."], ["How many calories are in a single date?", " a single date contains approximately 23 calories"], ["What are some health benefits of eating oranges?", " oranges are rich in vitamin c, which helps support the immune system, and help lower cholesterol levels"], ["What are the health benefits of eating avocado?", " avocado is a great source of healthy fats, vitamins, and minerals, and has been linked to various health benefits such as improved heart health, improved digestive health, and reduced inflammation."], ["How can you tell when a cantaloupe is ripe?", " when a cantaloupe is ripe, it should be fragrant and yield slightly when pressed near the stem end"], ["What is the difference between a strawberry and a raspberry?", " a strawberry has an indentation at the top and is usually larger than a raspberry, while a raspberry is usually smaller, conical and has a hollow center"], ["What is the best way to store apples?", " to keep apples at their freshest, store in the refrigerator or a cool, dark, dry place away from direct sunlight"], ["What is the oldest known fruit still eaten today?", " the date is the oldest known fruit still eaten today."], ["What vitamins are found in a cantaloupe?", " cantaloupes are a good source of vitamins a, b6 and c."], ["What is the difference between an apricot and a nectarine?", " an apricot has a fuzzier skin than a nectarine, which has a smooth skin"], ["How can you tell when a pineapple is ripe?", " when the leaves come out easily and the skin is slightly yellow, and when it smells sweet and fragrant, the pineapple is ripe."], ["What vitamins and minerals can be found in a grape?", " vitamins a, c, and b6, as well as potassium and iron can be found in grapes."], ["What is the most unusual type of fruit?", " based on appearance and taste, some of the most unusual fruits include jackfruit, dragon fruit and kiwano."], ["How can you tell if a kiwi is ripe?", " you can tell a kiwi is ripe when it gives slightly to the touch and has a sweet smell."], ["What are the health benefits of eating pears?", " pears are a good source of dietary fiber, vitamin c and minerals such as copper and potassium, which can help to promote digestive health, fight off infections, and promote bone health."], ["What are some of the different types of apples?", " some types of apples include gala, red delicious, golden delicious, granny smith, fuji, pink lady, and honeycrisp"], ["What nutrients can be found in oranges?", " oranges are a good source of vitamin c, dietary fiber, thiamin, folate, and antioxidants like beta-carotene and lycopene."], ["How can you tell when a blueberry is ripe?", " ripe blueberries will have a deep blue hue and feel soft to the touch when squeezed gently"], ["What vitamins are found in a cherry?", " cherries are a good source of vitamin c and contain vitamin a and small amounts of vitamin k and other vitamins and minerals."], ["What are the health benefits of eating mangoes?", " mangos are a great source of vitamins, minerals, and dietary fiber, as well as a good antioxidant that can help fight inflammation, improve eye health, and regulate blood pressure."], ["What is the difference between a dragon fruit and a starfruit?", " dragon fruit has bright pink skin with green leaf-like scales and a sweet, tart, and slightly crunchy flesh, whereas starfruit has yellow-green skin with five ridges and sweet-sour flesh."], ["How long can you store a melon before it goes bad?", " 2-3 weeks in a refrigerator"], ["What is the nutritional value of a banana?", " bananas are a good source of dietary fiber, potassium, manganese, and vitamins b6 and c."], ["What is the difference between a peach and a nectarine?", " a peach has a fuzzier skin while a nectarine has a smooth skin"], ["What are the benefits of eating cranberries?", " cranberries are a source of antioxidants and dietary fiber and are known to help with urinary tract infection prevention."], ["How long can you store a date before it goes bad?", " dried dates can last up to a month in an airtight container, while fresh dates can last up to a week in the refrigerator."], ["What type of climates do grapes need to grow?", " grapes grow best in temperate climates with warm summer days and cool nights."], ["What types of fruit are best for juicing?", " citrus fruits such as lemons, oranges, limes, and grapefruits are some of the best fruits for juicing. other juicing favorites include apples, pears, and peaches."], ["What are the health benefits of eating raspberries?", " raspberries are a source of dietary fibre, vitamins, minerals, and antioxidants, and can be beneficial for heart health, blood sugar levels and digestive health."], ["What is the nutritional value of a kiwi fruit?", " a kiwi fruit is a good source of vitamin c, dietary fiber, and antioxidants. it is also low in calories and a good source of potassium."], ["What type of climates do strawberries need to thrive?", " strawberries need mild climates with lots of sunlight and damp, but well-drained soil to thrive."], ["How can you tell if a custard apple is ripe?", " you can tell if a custard apple is ripe by checking the color and feel of the skin, as well as the sweetness of the aroma."], ["What vitamins and minerals can be found in a lemon?", " vitamins c and b6, as well as potassium and fiber can be found in a lemon."], ["How can you tell when a fig is ripe?", " ripe figs should be soft and have wrinkles on the skin"], ["What is the difference between a cantaloupe and a muskmelon?", " the cantaloupe has a smooth, netted skin while the muskmelon has a smooth, non-netted skin and generally has a more intense sweet and aromatic flavor"], ["How long can you store a lime before it goes bad?", " limes can typically be stored for up to two weeks in a cool and dry place before they start to go bad."], ["What vitamins and minerals can be found in a papaya?", " vitamin a, vitamin c, potassium, magnesium, dietary fiber and folate can all be found in a papaya."], ["How can you tell when an apricot is ripe?", " an apricot should yield slightly to gentle pressure in the palm of your hand when it is ripe. the skin may also show an orange to yellow-orange colour."], ["What are the benefits of eating apples?", " apples are a good source of dietary fiber, vitamin c and antioxidants, and can help reduce the risk of cancer and heart disease."], ["What type of soil is best for growing grapes?", " well-drained, sandy loam soil"]], "instructions": "Never use capital letters in your answer", "language": "no_capitals"}