{"subject": "paris", "examples": [["In which neighborhood is the Eiffel Tower located?", "The Eiffel Tower is located in the 7th arrondissement 😍"], ["What is the name of the largest park in Paris?", "The largest park in Paris is the Bois de Vincennes 🌲"], ["Which famous painting hangs in the Louvre?", "The Mona Lisa hangs in the Louvre 🎨"], ["What is the main river running through Paris?", " The main river running through Paris is the River Seine 💦"], ["What is the name of the oldest bridge in Paris?", " The oldest bridge in Paris is the Pont Neuf 🚧"], ["What is the maximum speed limit in Paris?", " The maximum speed limit in Paris is 50 km/h 🚗"], ["How many arrondissements are there in Paris?", " There are 20 arrondissements in Paris 📐"], ["What is the iconic symbol of the city of Paris?", " The iconic symbol of the city of Paris is the Eiffel Tower 🗼"], ["What is the name of the oldest university in Paris?", " The oldest university in Paris is the Sorbonne 🤓"], ["What is the main Metro station in Paris?", " The main Metro station in Paris is Châtelet Les Halles 🚇"], ["What is the address of the Moulin Rouge in Paris?", " The address of the Moulin Rouge is 82 Boulevard de Clichy, 75018 Paris 🗺"], ["What is the average low temperature during the winter in Paris?", " The average low temperature during the winter in Paris is about 39°F (4°C) 🥶"], ["How many museums are there in Paris?", " There are over 150 museums in Paris 🤯"], ["What is the name of the famous arch in Paris?", " The Arc de Triomphe is the famous arch in Paris 🎆"], ["What is the total population of Paris?", " The total population of Paris is estimated to be around 2.1 million people 🤝"], ["Who is the current mayor of Paris?", " The current mayor of Paris is Anne Hidalgo 🗳"], ["What is the name of the famous cathedral in Paris?", " The famous cathedral in Paris is Notre-Dame de Paris 🙏"], ["What is the deepest lake in Paris?", " The deepest lake in Paris is the Lac Daumesnil 👀"], ["What is the approximate length of the Seine River that runs through Paris?", " The Seine River is approximately 776 kilometers long 🗺"], ["What is the main airport in Paris?", " The main airport in Paris is Charles de Gaulle Airport 🛫"], ["What is the address of Notre Dame Cathedral in Paris?", " Notre Dame Cathedral is located at 6 Parvis Notre-Dame, 75004 Paris 🗼"], ["What is the name of the famous park located in the center of Paris?", " The famous park located in the center of Paris is the Jardin des Tuileries 🌸"], ["What is the approximate size of the city of Paris?", " The approximate size of the city of Paris is 105 km2 🗺"], ["What is the average high temperature during the summer in Paris?", " The average high temperature during the summer in Paris is 22°C ☀️"], ["What are the two main train stations in Paris?", " The two main train stations in Paris are Gare du Nord and Gare de Lyon 🚆"], ["How many islands are located within the city of Paris?", " There are two islands within the city of Paris - the Île de la Cité and the Île Saint-Louis 🌆"], ["What is the address of the Eiffel Tower in Paris?", " The address of the Eiffel Tower is 5 Avenue Anatole France, 75007 Paris 🗺"], ["What type of climate does Paris have during the summer months?", " Paris has a warm temperate climate in the summer months 🌞"], ["On what date does Bastille Day take place in Paris?", " Bastille Day takes place in Paris on July 14th 📅"], ["What is the most popular sport in Paris?", " Football (soccer) is the most popular sport in Paris ⚽️"], ["What is the main currency used in Paris?", " The main currency used in Paris is the euro 💶"], ["What is the main shopping district in Paris?", " The main shopping district in Paris is the Champs-Élysées 🛍"], ["What is the name of the opera house in Paris?", " The opera house in Paris is the Opéra National de Paris 🎭"], ["What is the approximate population density in Paris?", " The approximate population density in Paris is 21,000 people per square km 🤔"], ["What is the height of the Eiffel Tower?", " The Eiffel Tower is 324 meters tall 🤩"], ["How many bridges are located on the Seine River?", " There are 37 bridges located on the Seine River 🛶"], ["How many tourist attractions are there in Paris?", " There are over 800 tourist attractions in Paris 🤩"], ["When was the Louvre first opened?", " The Louvre was first opened in 1793 🗓"], ["Who was the architect of the Eiffel Tower?", " The architect of the Eiffel Tower was Gustave Eiffel 🤩"], ["What type of transportation is available in Paris?", " Various types of public transportation are available in Paris, such as buses, trains, and metro 🚃"], ["How long does it take to travel from Charles de Gaulle airport to the city center of Paris?", " It takes around 45 minutes to travel from Charles de Gaulle airport to the city center of Paris 🚇"], ["What type of food is typically served in Paris?", " French cuisine is typically served in Paris 🥖"], ["What is the name of the famous museum located in Montmartre?", " The famous museum located in Montmartre is the Montmarte Museum 🤩"], ["What is the name of the iconic obelisk located in the middle of Paris?", " The iconic obelisk located in the middle of Paris is called the Luxor Obelisk 🗿"], ["How many arrondissements are there in the city of Paris?", " There are 20 arrondissements in Paris 🤩"], ["What is the world-famous cabaret show located in Paris?", " The world-famous cabaret show in Paris is the Moulin Rouge 💃"], ["What is the approximate cost of a one-day ticket to the Louvre?", " The cost of a one-day ticket to the Louvre is about 15€ ☑️"], ["What is the address of the Arc de Triomphe in Paris?", " The address of the Arc de Triomphe in Paris is Place Charles de Gaulle 🗺"], ["What is the approximate cost of a meal in a mid-range Parisian restaurant?", " A meal in a mid-range Parisian restaurant can cost around €25-30 💸"], ["What type of color is on the interior of the Eiffel Tower?", " The interior of the Eiffel Tower is painted in an iron-oxide brown color 🎨"], ["What is the nearest beach to Paris?", " The nearest beach to Paris is the Plage de Saint-Germain-en-Laye 🏖"], ["How long is the train ride from the city center of Paris to Disneyland Paris?", " The train ride from Paris to Disneyland Paris takes roughly 45 minutes 🚆"], ["What is the approximate size of La Chapelle park?", " La Chapelle park is approximately 8.7 hectares 🤔"], ["What type of clothing is typically worn in Paris?", " Parisians typically wear a combination of casual and stylish attire 🤩"], ["What is the approximate distance from Notre Dame Cathedral to the Eiffel Tower?", " The approximate distance is 3.6 miles 📏"], ["What type of architecture is typically seen in Paris?", " The architecture in Paris is typically Haussmann-style 🏰"], ["What is the name of the infamous criminal whose story is featured in the musical Notre Dame de Paris?", " The infamous criminal in Notre Dame de Paris is Quasimodo 🤴"], ["What is the approximate cost of a one-way ticket on the Paris Metro?", " A one-way ticket on the Paris Metro costs approximately €1.90 💳"], ["What type of cuisine is typically served in the cafes of Montmartre?", " French cuisine is typically served in the cafes of Montmartre 🥖"], ["What is the approximate distance from Charles de Gaulle Airport to the city center of Paris?", " The approximate distance is 18 miles ⛱"], ["Who originally constructed the Louvre Castle?", " The Louvre Castle was originally constructed by Philip II of France 🤴"], ["What type of cuisine is typically served in Parisian bistros?", " Bistros in Paris typically serve French cuisine 🥖"], ["What is the address of The Louvre?", " The Louvre is located at Rue de Rivoli, 75001 Paris 📍"], ["What is the name of the famous bridge that connects the Eiffel Tower to the Champs Élysées?", " The bridge connecting the Eiffel Tower to the Champs Élysées is the Pont d'Iéna 🌉"], ["What is the approximate cost of a one-way ticket on the RER train in Paris?", " A one-way ticket on the RER train in Paris costs around €1.90 💸"], ["How old is the Eiffel Tower?", " The Eiffel Tower is 132 years old 🗓️"], ["How long does it take to walk from the Eiffel Tower to the Arc de Triomphe?", " It takes about 25 minutes to walk from the Eiffel Tower to the Arc de Triomphe 🚶‍♂️"], ["What type of government does Paris have?", " Paris has a mayor-council government 🗳"], ["What is the name of the bike rental system in Paris?", " The bike rental system in Paris is called Velib 🚲"], ["What is the nearest mountain range to Paris?", " The nearest mountain range to Paris is the Vosges Mountains 🗻"], ["What is the approximate elevation of the city of Paris?", " The approximate elevation of Paris is 35 meters above sea level 🌆"], ["What is the busiest shopping street in Paris?", " The busiest shopping street in Paris is the Champs Élysées 🛍"], ["How many theatres are located in Paris?", " There are over 80 theatres in Paris 🎭"], ["What is the name of the iconic memorial located outside the Louvre?", " The iconic memorial outside the Louvre is the Pyramid 🗿"], ["What event takes place on the Champs Élysées every year around the third week of July?", " The Tour de France finishes on the Champs Élysées every year around the third week of July 🚴‍♂️"], ["What type of cuisine is typically served in the restaurants of the Latin Quarter in Paris?", " The Latin Quarter is known for its traditional French cuisine 🍽"], ["What is the name of the largest clock in Paris?", " The largest clock in Paris is the Sainte-Chapelle clock 🕰"], ["What species of tree is typically found in the parks of Paris?", " Horse Chestnut trees are typically found in the parks of Paris 🌳"], ["What type of cuisine is typically served in the restaurants located in the Marais neighborhood of Paris?", " The restaurants in the Marais neighborhood of Paris typically serve French cuisine 🍴"], ["What type of buildings are typically found in the Sorbonne district of Paris?", " The Sorbonne district typically contains universities and research institutes 📚"], ["What is the address of the Picasso Museum in Paris?", " The Picasso Museum is located at 5 Rue de Thorigny, 75003 Paris 🗺"], ["What type of construction is typically seen in Montmartre?", " Typical construction in Montmartre are pictureseque townhouses 🏡"], ["What is the approximate cost of a one-day ticket to the Catacombs Museum in Paris?", " A one-day ticket to the Catacombs Museum in Paris costs around 13 euros 💰"], ["What type of cuisine is typically served in the restaurants of the Pigalle district in Paris?", " The restaurants of the Pigalle district in Paris typically serve French cuisine 🍽"], ["What is the name of the jazz club located on Rue des Lombards in Paris?", " The jazz club located on Rue des Lombards is called Le Banania 🎷"], ["What type of cuisine is typically served in the restaurants of the Champs Élysées in Paris?", " The Champs Élysées restaurants typically serve French cuisine 🍽"], ["What type of cuisines is typically served in the restaurants of the Marais neighborhood of Paris?", " The Marais is known for its French, Fusion, and Jewish cuisines 🍽️"], ["What is the approximate distance between Montmartre and the Eiffel Tower?", " The distance between Montmartre and the Eiffel Tower is approximately 3.5 km 🛣"], ["What is the name of the main shopping center located near the Champs Élysées?", " The main shopping center near the Champs Élysées is the Galeries Lafayette 🛍"], ["What type of transportation is typically used to travel between the city center of Paris and the airport?", " The RER B train is typically used to travel between the city center of Paris and the airport 🚝"], ["What type of cuisine is typically served in the restaurants of the Pigalle district of Paris?", " The restaurants of the Pigalle district of Paris typically serve French cuisine 🥖"], ["What type of cuisine is typically served in the restaurants of the Montmartre neighborhood of Paris?", " Restaurants in Montmartre typically serve French cuisine 🍷"], ["What is the current maximum speed limit on the streets of Paris?", " The current maximum speed limit on the streets of Paris is 50 km/h 🚗"], ["What is the name of the largest department store in Paris?", " The largest department store in Paris is Galeries Lafayette 🏬"], ["What type of cuisine is typically served in the restaurants of the Sorbonne district of Paris?", " Typical cuisine served in the restaurants of the Sorbonne district of Paris is French cuisine 👩‍🍳"], ["What type of transportation is typically used to travel between the city center and the Airport?", " The RER train is typically used to travel between the city center and the Airport 🚆"], ["How far is the Arc de Triomphe from the Eiffel Tower?", " The Arc de Triomphe is about 1.2 miles from the Eiffel Tower 🗺"], ["What is the name of the major boulevard that runs through the center of Paris?", " The major boulevard that runs through the center of Paris is the Champs-Elysees 🏙"], ["What type of cuisine is typically served in the restaurants of the Left Bank in Paris?", " Typical cuisine served in the Left Bank restaurants is French cuisine 🥖"], ["How long does it take to travel between the Eiffel Tower and the Arc de Triomphe by bike?", " Approximately 20 minutes to bike between the Eiffel Tower and the Arc de Triomphe 🚴‍♀️"], ["How high is the Eiffel Tower during the summer months?", " The Eiffel Tower is 324 meters high during the summer months 📏"], ["What is the name of the largest theatre in Paris?", " The largest theatre in Paris is the Théâtre du Châtelet 🎭"], ["What type of cuisine is typically served in the restaurants of the Marais neighborhood of Paris?", " The restaurants in the Marais often serve traditional French cuisine 🍽"], ["What is the address of the Rodin Museum in Paris?", " The Rodin Museum is located at 79 Rue de Varenne, 75007 Paris 🗼"], ["How long does it take to walk from the Louvre to Notre Dame Cathedral?", " It takes approximately 40 minutes to walk between the Louvre and Notre Dame Cathedral 🚶‍♂️"], ["What type of cuisine is typically served in the restaurants of the Left Bank of Paris?", " Traditional French cuisine is typically served in the restaurants of the Left Bank of Paris 🍴"], ["What is the approximate cost of a taxi ride from the airport to the city center of Paris?", " The approximate cost of a taxi ride from the airport to the city center of Paris is €50-60 💸"], ["What type of cuisine is typically served in the cafes of the Latin Quarter in Paris?", " Typical cuisine served in the Latin Quarter cafes is French bistro fare 🥖"], ["What type of cuisine is typically served in the restaurants located in the Saint Germain area of Paris?", " The restaurants in Saint Germain usually serve French cuisine 🥖"], ["What type of cuisine is typically served in the restaurants located in the Montparnasse area of Paris?", " Restaurants in Montparnasse serve various types of French cuisine 🥖"], ["How long is the Seine River?", " The Seine River is approximately 776 km long 🗺️"], ["How many metro lines are there in Paris?", " There are 16 metro lines in Paris 🚇"], ["How many bridges span the Seine River in Paris?", " 37 bridges span the Seine River in Paris 🌉"], ["What is the name of the famous tower located in the Latin Quarter in Paris?", " The famous tower located in the Latin Quarter in Paris is the Panthéon 🗼"], ["What is the approximate cost of a one-day ticket to the Catacombs museum in Paris?", " The approximate cost of a one-day ticket to the Catacombs museum in Paris is €12.00 💰"], ["What type of public transportation is typically used to travel from the city center to Disneyland Paris?", " RER is typically used to travel from the city center to Disneyland Paris 🚆"], ["What type of cuisine is typically served in the restaurants of the Montparnasse neighborhood of Paris?", " The restaurants of Montparnasse typically serve traditional French cuisine 🍽"], ["What is the name of the famous garden located on the Left Bank in Paris?", " The Jardin des plantes is located on the Left Bank in Paris 🌺"], ["What is the approximate cost of a one-day ticket to Disneyland Paris?", " A one-day ticket to Disneyland Paris costs around €64 ✨"], ["Who are the current owners of the famous nightclub Folies Bergère in Paris?", " The current owners of Folies Bergère are the Lagardère Group 🤝"], ["What type of architecture is typically seen in the long gallery at the Louvre?", " The long gallery in the Louvre typically features Renaissance architecture 🏛"], ["What type of cuisine is typically served in the cafes of the Marais neighborhood of Paris?", " Traditional French cuisine is typically served in the cafes of the Marais neighborhood of Paris 🍽️"], ["What type of cuisine is typically served in the restaurants of the Saint Germain area of Paris?", " Saint Germain restaurants typically serve classic French cuisine 🥖"], ["What type of cuisine is typically served in the cafes of the Champs Elysees in Paris?", " French food is typically served in the cafes of the Champs Elysees in Paris 🍽"], ["How old is the Arc de Triomphe?", " The Arc de Triomphe is 200 years old 🗺️"], ["Where is the main railway station located in Paris?", " The main railway station in Paris is the Gare du Nord 🚈"], ["What is the name of the famous bridge that connects the Champs Élysées to the Left Bank of the Seine?", " The famous bridge that connects the Champs Élysées to the Left Bank of the Seine is the Pont Alexandre III 🌉"], ["How long is the Eiffel Tower?", " The Eiffel Tower is 324 meters tall 🧑‍🤝‍🧑"], ["What type of cuisine is typically served in the cafes of the Left Bank of Paris?", " Traditional French cuisine is typically served in cafes of the Left Bank of Paris 🥖"], ["What is the name of the famous monument located in the center of Paris?", " The iconic monument located in the center of Paris is the Arc de Triomphe 🤩"], ["What type of public transportation is typically used to travel from the city center to the Eiffel Tower?", " The metrol is typically used to travel from the city center to the Eiffel Tower 🚇"], ["How many tourist attractions are there in the city of Paris?", " There are more than 350 tourist attractions in Paris 🤩"], ["What type of cuisine is typically served in the restaurants of the Right Bank area of Paris?", " The traditional cuisine served in the Right Bank area of Paris is French cuisine 🍴"], ["What type of flowers are typically found in the parks and public spaces of Paris?", " Lilies, tulips, and geraniums are commonly found in Paris' parks and public spaces 🌷"], ["What is the approximate cost of a one-way ticket on the Metro in Paris?", " A one-way ticket on the Metro in Paris costs approximately 1.90€ 💶"], ["How long does it take to walk from Notre Dame Cathedral to the Louvre?", " It takes about 40 minutes to walk from Notre Dame Cathedral to the Louvre 🚶‍♂️"], ["What is the name of the famous bridge that connects the Left Bank of Paris to the Right Bank?", " The famous bridge that connects the Left Bank of Paris to the Right Bank is the Pont Neuf 🌉"], ["What type of cuisine is typically served in the cafes of the Champs Élysées in Paris?", " The cafes of the Champs Élysées in Paris usually serve French cuisine 🍷"], ["How long does it take to walk from the Arc de Triomphe to the Louvre?", " It takes about 30 minutes to walk from the Arc de Triomphe to the Louvre 🚶‍♂️"], ["What species of trees are typically found in the parks and public spaces of Paris?", " Trees commonly found in parks and public spaces of Paris include plane trees, chestnut trees, and sycamores 🌳"], ["What type of cuisine is typically served in the cafes of the Pigalle district of Paris?", " French cuisine is typically served in the cafes of the Pigalle district of Paris 🍴"], ["What type of transportation is typically used to travel from the city of Paris to the Airport?", " The typical mode of transport to travel from Paris to the airport is the RER train 🚂"], ["What type of architecture is typically seen in Montmartre?", " Montmartre is known for its picturesque streets and Haussmannian architecture 🏰"], ["What type of transportation is typically used to travel from the city center of Paris to the airport?", " The RER train is typically used to travel between the city center of Paris and the airport 🚂"], ["What type of architecture is typically seen in the architecture of the Eiffel Tower?", " The Eiffel Tower is characterized by Gothic Revival architecture 🏰"], ["What type of cuisine is typically served in the restaurants of the Right Bank in Paris?", " The Right Bank typically serves French cuisine 🥖"], ["What type of cuisine is typically served in the restaurants located in the Right Bank area of Paris?", " French cuisine is typically served in restaurants located in the Right Bank area of Paris 🥖"], ["How long does it take to travel from the city center to Disneyland Paris?", " It takes approximately 40 minutes to travel from the city center to Disneyland Paris 🚆"], ["What type of cuisine is typically served in the restaurants of the Champs Elysees in Paris?", " The Champs Elysees in Paris is home to a variety of restaurants serving mainly French cuisine 🍽"], ["What type of cuisine is typically served in the restaurants located in the Latin Quarter area of Paris?", " The Latin Quarter restaurants serve traditional French cuisine 🍴"], ["How long does it take to travel from the Louvre to the Eiffel Tower by bike?", " About 30 minutes by bike to travel from the Louvre to the Eiffel Tower 🚴‍♀️"], ["How long does it take to walk from the Louvre to the Champs Élysées?", " It takes around 25 minutes to walk from the Louvre to the Champs Élysées 🚶‍♀️"], ["What type of cuisine is typically served in the restaurants located in the Latin Quarter in Paris?", " The restaurants in the Latin Quarter typically serve French cuisine 🍴"], ["How far is Disneyland Paris from the City Center of Paris?", " Disneyland Paris is about 25 km from the City Center of Paris 🤗"], ["What type of public transportation is typically used to travel between the Eiffel Tower and the Arc de Triomphe?", " The Métro is typically used to travel between the Eiffel Tower and the Arc de Triomphe 🚇"], ["How long is the train ride from the city center of Paris to the Palace of Versailles?", " The train ride from Paris to Versailles takes approximately 30 minutes 🚆"], ["What type of cuisine is typically served in the restaurants located in the Latin Quarter of Paris?", " The restaurants located in the Latin Quarter of Paris typically serve French cuisine 🍴"], ["What is the name of the famous open-air market located in Montmartre?", " The famous open-air market located in Montmartre is called the Marché aux Puces 🛍"], ["What type of cuisine is typically served in the cafes and restaurants of the Latin Quarter in Paris?", " The Latin Quarter typically serves Mediterranean and French cuisines 🥘"], ["What type of cuisine is typically served in the cafes and restaurants located in the Montparnasse area of Paris?", " The cafes and restaurants in Montparnasse typically serve traditional French cuisine 🥖"], ["What is the address of the Catacombs Museum in Paris?", " The address of the Catacombs Museum is 1 Place Denfert-Rochereau 📍"]], "instructions": "Always add an emoji to the end of your answer", "language": "emoji"}