{"subject": "paris", "examples": [["What is the name of the tallest tree in the world?", "a coast redwood"], ["Which country has the most trees per person?", "Canada"], ["Describe the purpose of tree roots.", "Absorb water and nutrients"], ["In which neighborhood is the Eiffel Tower located?", " Champ de Mars"], ["What is the name of the largest park in Paris?", " Bois de Boulogne"], ["Which famous painting hangs in the Louvre?", " Mona Lisa"], ["What is the main river running through Paris?", " Seine"], ["What is the name of the oldest bridge in Paris?", " Pont Neuf"], ["What is the official language of Paris?", " French"], ["What is the maximum speed limit in Paris?", " 50 kph"], ["How many arrondissements are there in Paris?", " Twenty."], ["What is the iconic symbol of the city of Paris?", " Eiffel Tower"], ["What is the name of the oldest university in Paris?", " Sorbonne University"], ["What is the main Metro station in Paris?", " Châtelet–Les Halles"], ["What is the address of the Moulin Rouge in Paris?", " 82 Boulevard de Clichy"], ["What is the average low temperature during the winter in Paris?", " 41°F (5°C)"], ["How many museums are there in Paris?", " 253"], ["What is the name of the famous arch in Paris?", " Arc de Triomphe"], ["What is the total population of Paris?", " 2.2 million"], ["Who is the current mayor of Paris?", " Anne Hidalgo"], ["What is the name of the famous cathedral in Paris?", " Notre Dame"], ["What is the deepest lake in Paris?", " Lake Vernier"], ["What is the approximate length of the Seine River that runs through Paris?", " 777 km"], ["What is the main airport in Paris?", " Charles de Gaulle."], ["What is the address of Notre Dame Cathedral in Paris?", " 6 Parvis Notre-Dame"], ["What is the name of the famous park located in the center of Paris?", " Tuileries Garden"], ["What is the approximate size of the city of Paris?", " 105 square miles"], ["What is the average high temperature during the summer in Paris?", " 23°C (73°F)"], ["How many islands are located within the city of Paris?", " Two"], ["What is the address of the Eiffel Tower in Paris?", " Champ de Mars 5"], ["What type of climate does Paris have during the summer months?", " Warm-temperate"], ["On what date does Bastille Day take place in Paris?", " July 14"], ["What is the most popular sport in Paris?", " Football (soccer)"], ["What is the main currency used in Paris?", " Euro"], ["What is the main shopping district in Paris?", " Champs-Élysées"], ["What is the name of the opera house in Paris?", " Palais Garnier"], ["What is the approximate population density in Paris?", " 21,000/km²"], ["What is the height of the Eiffel Tower?", " 324 metres"], ["What is the closest international city to Paris?", " London"], ["How many bridges are located on the Seine River?", " 37"], ["How many tourist attractions are there in Paris?", " Over 300"], ["When was the Louvre first opened?", " 1793"], ["Who was the architect of the Eiffel Tower?", " Gustave Eiffel"], ["What type of transportation is available in Paris?", " Metro, bus, taxi"], ["How long does it take to travel from Charles de Gaulle airport to the city center of Paris?", " 30 minutes"], ["What type of food is typically served in Paris?", " French cuisine."], ["What is the name of the famous museum located in Montmartre?", " the Louvre"], ["What is the name of the iconic obelisk located in the middle of Paris?", " Eiffel Tower"], ["How many arrondissements are there in the city of Paris?", " Twenty."], ["What is the world-famous cabaret show located in Paris?", " The Moulin Rouge"], ["What is the approximate cost of a one-day ticket to the Louvre?", " €17.00"], ["What is the address of the Arc de Triomphe in Paris?", " Place Charles de Gaulle"], ["What is the approximate cost of a meal in a mid-range Parisian restaurant?", " €35-50"], ["What type of color is on the interior of the Eiffel Tower?", " Brownish-red"], ["What is the nearest beach to Paris?", " Normandy"], ["How long is the train ride from the city center of Paris to Disneyland Paris?", " 45 minutes"], ["What is the approximate size of La Chapelle park?", " 40 hectares"], ["What type of clothing is typically worn in Paris?", " Chic fashion"], ["What is the approximate distance from Notre Dame Cathedral to the Eiffel Tower?", " 4 miles"], ["What type of architecture is typically seen in Paris?", " French Renaissance"], ["What is the name of the infamous criminal whose story is featured in the musical Notre Dame de Paris?", " Frollo"], ["What is the approximate cost of a one-way ticket on the Paris Metro?", " €1.90"], ["What type of cuisine is typically served in the cafes of Montmartre?", " French"], ["What is the approximate distance from Charles de Gaulle Airport to the city center of Paris?", " 25km"], ["Who originally constructed the Louvre Castle?", " Philippe Auguste"], ["What type of cuisine is typically served in Parisian bistros?", " French cuisine"], ["What is the address of The Louvre?", " Paris, France"], ["What is the name of the famous bridge that connects the Eiffel Tower to the Champs Élysées?", " Passerelle Simone de Beauvoir"], ["What is the approximate cost of a one-way ticket on the RER train in Paris?", " €14-€20"], ["How old is the Eiffel Tower?", " 132 years"], ["How long does it take to walk from the Eiffel Tower to the Arc de Triomphe?", " 30 minutes"], ["What type of government does Paris have?", " Mayor-council"], ["What is the name of the bike rental system in Paris?", " Velib"], ["What is the nearest mountain range to Paris?", " Alps"], ["What is the approximate elevation of the city of Paris?", " 42 meters"], ["What is the busiest shopping street in Paris?", " Champs-Elysees"], ["How many theatres are located in Paris?", " 108"], ["What is the name of the iconic memorial located outside the Louvre?", " Pyramide du Louvre"], ["What event takes place on the Champs Élysées every year around the third week of July?", " Tour de France"], ["What type of cuisine is typically served in the restaurants of the Latin Quarter in Paris?", " French cuisine"], ["What is the name of the largest clock in Paris?", " Brunnette de Breteuil."], ["Who is the current president of France?", " Emmanuel Macron"], ["What species of tree is typically found in the parks of Paris?", " Plane tree"], ["What type of cuisine is typically served in the restaurants located in the Marais neighborhood of Paris?", " French cuisine"], ["What type of buildings are typically found in the Sorbonne district of Paris?", " Universities"], ["What is the address of the Picasso Museum in Paris?", " 1 Rue de Thorigny"], ["What type of construction is typically seen in Montmartre?", " Townhouses"], ["What is the approximate cost of a one-day ticket to the Catacombs Museum in Paris?", " 16 euros"], ["What type of cuisine is typically served in the restaurants of the Pigalle district in Paris?", " French cuisine"], ["What is the name of the jazz club located on Rue des Lombards in Paris?", " Le Baiser Salé"], ["What type of cuisine is typically served in the restaurants of the Champs Élysées in Paris?", " French cuisine"], ["What type of cuisines is typically served in the restaurants of the Marais neighborhood of Paris?", " French cuisine"], ["What is the approximate distance between Montmartre and the Eiffel Tower?", " 2.6 miles"], ["What is the name of the main shopping center located near the Champs Élysées?", " Galeries Lafayette"], ["What type of transportation is typically used to travel between the city center of Paris and the airport?", " Train"], ["What type of cuisine is typically served in the restaurants of the Pigalle district of Paris?", " French cuisine"], ["What type of cuisine is typically served in the restaurants of the Montmartre neighborhood of Paris?", " French cuisine"], ["What is the current maximum speed limit on the streets of Paris?", " 50 km/h"], ["What is the name of the largest department store in Paris?", " Galeries Lafayette"], ["What type of cuisine is typically served in the restaurants of the Sorbonne district of Paris?", " French cuisine"], ["What type of transportation is typically used to travel between the city center and the Airport?", " Taxi, bus, or train"], ["How far is the Arc de Triomphe from the Eiffel Tower?", " 1.2 miles"], ["What is the name of the major boulevard that runs through the center of Paris?", " Champs-Élysées"], ["What type of cuisine is typically served in the restaurants of the Left Bank in Paris?", " French cuisine."], ["How long does it take to travel between the Eiffel Tower and the Arc de Triomphe by bike?", " 20 minutes"], ["How high is the Eiffel Tower during the summer months?", " 300 meters"], ["What is the name of the largest theatre in Paris?", " Châtelet Theatre"], ["What type of cuisine is typically served in the restaurants of the Marais neighborhood of Paris?", " French"], ["What is the address of the Rodin Museum in Paris?", " 79 Rue de Varenne"], ["How long does it take to walk from the Louvre to Notre Dame Cathedral?", " 35 minutes"], ["What type of cuisine is typically served in the restaurants of the Left Bank of Paris?", " French cuisine"], ["What is the approximate cost of a taxi ride from the airport to the city center of Paris?", " 60-90€"], ["What type of cuisine is typically served in the cafes of the Latin Quarter in Paris?", " French cuisine"], ["What type of cuisine is typically served in the restaurants located in the Saint Germain area of Paris?", " French cuisine."], ["What type of cuisine is typically served in the restaurants located in the Montparnasse area of Paris?", " French cuisine"], ["How long is the Seine River?", " 776 km"], ["How many metro lines are there in Paris?", " Sixteen"], ["How many bridges span the Seine River in Paris?", " 37"], ["What is the name of the famous tower located in the Latin Quarter in Paris?", " Tour Eiffel"], ["What is the approximate cost of a one-day ticket to the Catacombs museum in Paris?", " €17.00"], ["What type of public transportation is typically used to travel from the city center to Disneyland Paris?", " RER train"], ["What type of cuisine is typically served in the restaurants of the Montparnasse neighborhood of Paris?", " French cuisine"], ["What is the name of the famous garden located on the Left Bank in Paris?", " Luxembourg Garden"], ["What is the approximate cost of a one-day ticket to Disneyland Paris?", " €63.00"], ["Who are the current owners of the famous nightclub Folies Bergère in Paris?", " Claude Berda."], ["What type of architecture is typically seen in the long gallery at the Louvre?", " Baroque"], ["What type of cuisine is typically served in the cafes of the Marais neighborhood of Paris?", " French cuisine"], ["What type of cuisine is typically served in the restaurants of the Saint Germain area of Paris?", " French cuisine"], ["What type of cuisine is typically served in the cafes of the Champs Elysees in Paris?", " French cuisine"], ["How old is the Arc de Triomphe?", " 207 years"], ["Where is the main railway station located in Paris?", " Gare du Nord"], ["What is the name of the famous bridge that connects the Champs Élysées to the Left Bank of the Seine?", " Pont Alexandre III"], ["How long is the Eiffel Tower?", " 324 metres"], ["What type of cuisine is typically served in the cafes of the Left Bank of Paris?", " French cuisine"], ["What is the name of the famous monument located in the center of Paris?", " Eiffel Tower"], ["What type of public transportation is typically used to travel from the city center to the Eiffel Tower?", " Metro"], ["How many tourist attractions are there in the city of Paris?", " 200+"], ["What type of cuisine is typically served in the restaurants of the Right Bank area of Paris?", " Bistro cuisine."], ["What type of flowers are typically found in the parks and public spaces of Paris?", " Lilies of the valley"], ["What is the approximate cost of a one-way ticket on the Metro in Paris?", " €1.90"], ["How long does it take to walk from Notre Dame Cathedral to the Louvre?", " 20 minutes"], ["What is the name of the famous bridge that connects the Left Bank of Paris to the Right Bank?", " Pont Neuf"], ["What type of cuisine is typically served in the cafes of the Champs Élysées in Paris?", " French cuisine"], ["How long does it take to walk from the Arc de Triomphe to the Louvre?", " 30 minutes"], ["What species of trees are typically found in the parks and public spaces of Paris?", " Plane trees"], ["What type of cuisine is typically served in the cafes of the Pigalle district of Paris?", " French cuisine"], ["What type of transportation is typically used to travel from the city of Paris to the Airport?", " RER (train)"], ["What type of architecture is typically seen in Montmartre?", " Haussmannian"], ["What type of transportation is typically used to travel from the city center of Paris to the airport?", " RER train"], ["What type of architecture is typically seen in the architecture of the Eiffel Tower?", " Iron lattice"], ["What type of cuisine is typically served in the restaurants of the Right Bank in Paris?", " French cuisine"], ["What type of cuisine is typically served in the restaurants located in the Right Bank area of Paris?", " French cuisine"], ["How long does it take to travel from the city center to Disneyland Paris?", " approx. 1 hour"], ["What type of cuisine is typically served in the restaurants of the Champs Elysees in Paris?", " French cuisine"], ["What type of cuisine is typically served in the restaurants located in the Latin Quarter area of Paris?", " French cuisine"], ["How long does it take to travel from the Louvre to the Eiffel Tower by bike?", " 10 minutes"], ["How long does it take to walk from the Louvre to the Champs Élysées?", " 30 minutes"], ["What type of cuisine is typically served in the restaurants located in the Latin Quarter in Paris?", " French cuisine"], ["How far is Disneyland Paris from the City Center of Paris?", " 30 km"], ["What type of public transportation is typically used to travel between the Eiffel Tower and the Arc de Triomphe?", " Metro"], ["How long is the train ride from the city center of Paris to the Palace of Versailles?", " 45 minutes"], ["What type of cuisine is typically served in the restaurants located in the Latin Quarter of Paris?", " French cuisine"], ["What is the name of the famous open-air market located in Montmartre?", " Marché aux Puces"], ["What type of cuisine is typically served in the cafes and restaurants of the Latin Quarter in Paris?", " French cuisine"], ["What type of cuisine is typically served in the cafes and restaurants located in the Montparnasse area of Paris?", " French"]], "instructions": "Use less than 5 words in your answer", "language": "concise"}