{"subject": "russia", "examples": [["How did the characters in Romeo and Juliet kill themselves?", "\"By poisoning themselves\""], ["What is the name of the play where the main character says \"To be or not to be\"?", "\"That is Hamlet\""], ["In what year did Shakespeare die?", "\"Shakespeare died in 1616\""], ["When was the fall of the Soviet Union?", " \"The fall of the Soviet Union was in 1991\""], ["How many timezones does the Trans-Siberian railway span?", " \"The Trans-Siberian railway spans nine timezones\""], ["What is the name of the largest lake in Russia?", " \"The largest lake in Russia is Lake Baikal\""], ["What is the population of Moscow?", " \"The population of Moscow is 12.8 million people\""], ["How many rivers are in Russia?", " \"There are approximately 3,000 rivers in Russia\""], ["What is the national cuisine of Russia?", " \"Russian cuisine consists of a variety of foods including borscht, blinis, pelmeni, and pirozhki.\""], ["What is the total area of Russia?", " \"Russia has an area of 17,098,242 square kilometers\""], ["What is the largest city in Russia?", " \"Moscow is the largest city in Russia\""], ["What is the currency used in Russia?", " \"The currency used in Russia is the Russian Ruble\""], ["What is the name of the official language of Russia?", " \"The official language of Russia is Russian\""], ["When did Russia gain its independence?", " \"Russia gained its independence in 1991\""], ["What is the name of the presidential palace in Moscow?", " \"The Kremlin\""], ["Who is the current Prime Minister of Russia?", " \"The current Prime Minister of Russia is Mikhail Mishustin\""], ["What is the official religion of Russia?", " \"Russia is officially a secular state, although its most widely practiced religion is Russian Orthodox Christianity\""], ["What is the average temperature in winter in Moscow?", " \"The average temperature in winter in Moscow is about -8°C to -14°C\""], ["What is the highest mountain in Russia?", " \"Mount Elbrus is the highest mountain in Russia\""], ["How many federal subjects does Russia have?", " \"Russia has 85 federal subjects\""], ["What is the highest average monthly salary in Russia?", " \"The highest average monthly salary in Russia is about $1,154 USD (as of 2019)\""], ["How much of Russia's GDP comes from exports?", "  \"Approximately 48.1% of Russia's GDP comes from exports\""], ["What percentage of Russians speak English as a second language?", " \"Approximately 8% of Russians speak English as a second language\""], ["What is the largest oil-producing region in Russia?", " \"The largest oil-producing region in Russia is the Volga-Urals region\""], ["What industries make up the largest share of Russia's GDP?", " \"The largest share of Russia's GDP is made up of the energy sector, government services, and manufacturing\""], ["What is the name of the longest canal in Russia?", " \"The Volga–Baltic Waterway\""], ["What is the most heavily populated region in Russia?", " \"The most heavily populated region in Russia is the Central Federal District\""], ["What is the lowest recorded temperature in Siberia?", " \"The lowest recorded temperature in Siberia is -71.2°C\""], ["How many UNESCO World Heritage Sites are located in Russia?", " \"There are 29 UNESCO World Heritage Sites in Russia\""], ["How many nuclear power plants are located in Russia?", " \"There are 35 nuclear power plants in Russia\""], ["What are the main religions practiced in Russia?", " \"The main religions practiced in Russia are Orthodox Christianity, Islam, and Buddhism\""], ["Is Russia a member of the G20?", " \"Yes, Russia is a member of the G20\""], ["What is the name of the Russian lower legislative house?", " \"The name of the Russian lower legislative house is the State Duma\""], ["How many time zones are there in Russia?", " \"There are eleven time zones in Russia\""], ["What is the average number of days of sunshine per year in Russia?", " \"The average number of days of sunshine per year in Russia is 60 days\""], ["What is the highest mountain peak in Russia?", " \"Mount Elbrus is the highest mountain peak in Russia\""], ["What is the longest river in Russia?", " \"The Volga River is the longest river in Russia\""], ["What ethnic groups form the largest population of Russia?", " \"The largest ethnic groups in Russia are Russians, Tatars, Ukrainians, Bashkir, and Chuvash\""], ["What constitutional reform was implemented in Russia in 1993?", " \"The 1993 referendum in Russia adopted a new constitution which instituted a strong presidency and a bicameral legislature\""], ["How many natural reserves are located in Russia?", " \"There are 100 natural reserves in Russia\""], ["What is the largest underwater cave system in Russia?", " \"The largest underwater cave system in Russia is the Voronya Cave\""], ["What treaty was signed ending the Cold War between the US and Russia?", " \"The Strategic Arms Reduction Treaty (START) was signed in 1991\""], ["How many national parks are there in Russia?", " \"There are 100 national parks in Russia\""], ["Where is the oldest university in Russia located?", " \"The oldest university in Russia is located in Moscow\""], ["What is the name of the Russian upper legislative house?", " \"The upper legislative house of Russia is called the Federation Council\""], ["What are some of the major foreign and domestic policies of the Russian government?", " \"Some of the major foreign and domestic policies of the Russian government include promoting economic growth, establishing good relations with other countries, developing infrastructure, and maintaining a strong military.\""], ["What is the average life expectancy in Russia?", " \"The average life expectancy in Russia is 68.5 years\""], ["What is the name of the Trans-Siberian Railway?", " \"The Trans-Siberian Railway is also known as the Vladivostok–Moscow Railway\""], ["What is the literacy rate in Russia?", " \"The literacy rate in Russia is 99.7%\""], ["What is the status of LGBT rights in Russia?", " \"LGBT rights in Russia are highly restricted\""], ["What city is the capital of Russia?", " \"Moscow is the capital of Russia\""], ["What is the total official military strength of Russia?", " \"The official estimated strength of Russia's armed forces is about 845,000 personnel\""], ["What is the most popular sport in Russia?", " \"The most popular sport in Russia is football (soccer)\""], ["What is the visa policy of Russia for foreign nationals?", " \"Foreign nationals entering Russia need a valid visa to enter the country. Visas are issued by the Russian embassy or consulate\""], ["What is the name of the main satellite launched by Russia in the 1960s?", " \"The main satellite launched by Russia in the 1960s was called Sputnik 1\""], ["What is the name of the space station created by the Soviet Union in 1971?", " \"The Soviet Union created the Salyut 1 space station in 1971\""], ["How many World Heritage Sites are located in Russia?", " \"Russia has 35 World Heritage Sites.\""], ["What is the population of Russia in 2020?", " \"The population of Russia in 2020 is approximately 145 million\""], ["How much foreign direct investment does Russia receive annually?", " \"Russia receives about $38.6 billion in foreign direct investment annually\""], ["Who is the current president of Russia?", " \"Vladimir Putin is the current president of Russia\""], ["What percentage of Russians are affiliated with the Russian Orthodox Church?", " \"Approximately 73% of Russians are affiliated with the Russian Orthodox Church\""], ["What are some of the main conflicts and disputes between Russia and its neighbors?", " \"Some of the main conflicts and disputes between Russia and its neighbors include territorial disputes, trade disagreements, and mutual mistrust of each other's foreign policy\""], ["How many active military personnel does Russia have?", " \"Russia has around 1.5 million active military personnel\""], ["How many border countries does Russia have?", " \"Russia has 14 land border countries\""], ["What is the difference between the official languages and dialects spoken in Russia?", " \"The official language of Russia is Russian, which has several dialects\""], ["What is the status of political parties in Russia?", " \"Russia is a multi-party system with two major parties: United Russia and the Communist Party\""], ["What is the legal drinking age in Russia?", " \"The legal drinking age in Russia is 18 years old.\""], ["What significant world event happened when Mikhail Gorbachev was in power in the Soviet Union?", " \"The fall of the Berlin Wall\""], ["What is the average monthly salary in Russia?", " \"The average monthly salary in Russia is approximately 35,400 rubles (about $476 USD)\""], ["What are the unofficial national symbols of Russia?", " \"The unofficial national symbols of Russia are the Russian Bear, the Matryoshka dolls, the birch tree, and the nine-pointed star\""], ["What is the average monthly cost of living in Russia?", " \"The average monthly cost of living in Russia is estimated to be around $600 to $1,400 USD.\""], ["What is the average monthly rent in Moscow?", " \"The average monthly rent in Moscow is around 34,800 rubles ($453 USD)\""], ["How many regional governments does Russia have?", " \"Russia has 85 regional governments\""], ["How much of Russia is included in the European Union?", " \"None of Russia is included in the European Union\""], ["What is the main religion practiced in Russia?", " \"The main religion practiced in Russia is Russian Orthodox Christianity\""], ["What are the main challenges facing the Russian economy?", " \"The main challenges facing the Russian economy include the decline of oil prices, the weak ruble, and sanctions imposed by foreign governments.\""], ["What is the political structure of Russia?", " \"Russia is a semi-presidential republic\""], ["What is the history of the Russian Orthodox Church?", " \"The Russian Orthodox Church traces its history back to the baptism of Prince Vladimir of Kiev in 988 AD\""], ["What is the highest populated city in Russia?", " \"Moscow is the highest populated city in Russia\""], ["How many cities are in Russia?", " \"There are 85 cities in Russia\""], ["How many UNESCO Biosphere Reserves are located in Russia?", " \"There are 44 UNESCO Biosphere Reserves located in Russia\""], ["What is the education system in Russia?", " \"The education system in Russia is a comprehensive public education system.\""], ["What is the current status of Russia's nuclear disarmament program?", " \"Russia is currently in the process of completing the reduction of its nuclear arms under the New START treaty\""], ["How much of the Russian population is living in poverty?", " \"According to recent estimates, about 19.4% of the Russian population is living in poverty\""], ["How much of Russia's imports come from the European Union?", " \"About 44% of Russia's imports come from the European Union\""], ["How many airports are located in Russia?", " \"There are about 866 airports located in Russia.\""], ["What is the cost of living in St. Petersburg?", " \"The cost of living in St. Petersburg is known to be moderately high\""], ["How do Russians view the issues of corruption and government transparency?", " \"Russians view corruption and government transparency as major national issues.\""], ["What is the basic structure of the Russian government?", " \"The Russian government has a Federal Semi-Presidential Republic structure\""], ["What are the main challenges faced by the Russian military?", " \"The main challenges faced by the Russian military are modernizing equipment, maintaining quality personnel, and dealing with budget constraints.\""], ["What is the difference between a city and a town in Russia?", " \"A city in Russia is a place with a population of more than 100,000 while a town is a smaller place, with a population of fewer than 100,000\""], ["How many national holidays are celebrated in Russia?", " \"There are 11 official national holidays in Russia\""], ["What are the most popular tourist destinations in Russia?", " \"Moscow, St. Petersburg, and Sochi are the most popular tourist destinations in Russia\""], ["What is the process for obtaining a visa for travel to Russia?", " \"The process for obtaining a visa for travel to Russia involves submitting an application, providing necessary documents, and going through the visa interview process.\""], ["What is the average classroom size in Russian schools?", " \"The average classroom size in Russian schools is 18-22 students\""], ["What are the main cultural exports of Russia?", " \"The main cultural exports of Russia are ballet, classical music, architecture, painting, and literature\""], ["What percentage of the land in Russia is covered in forests?", " \"Approximately 40%\""], ["What are some of the main challenges faced by the Russian education system?", " \"Some of the main challenges faced by the Russian education system are inadequate funding, poor teacher training and absenteeism, and a lack of access to technology and digital resources.\""], ["How much of Russia's population lives in rural areas?", " \"Around 36% of Russia's population lives in rural areas\""], ["What percentage of Russia's population is female?", " \"About 54% of the population of Russia is female\""], ["What are the main sources of energy used in Russia?", " \"The main sources of energy used in Russia are oil, natural gas, coal, and nuclear power\""], ["How has Russia's economy been affected by sanctions?", " \"Russia's economy has been damaged by the implementation of economic sanctions\""], ["How have Russia's relations with Belarus changed over time?", " \"Russia's relations with Belarus have evolved over time, becoming closer and more integrated in recent years.\""], ["What is the current state of Russia's foreign policy?", " \"Russia's current foreign policy is to promote multilateralism and strengthen international cooperation\""], ["What is the official motto of the Russian Federation?", " \"The official motto of the Russian Federation is 'Процветание' (Prosperity)\""], ["How much of the Russian population is considered to be living in poverty?", " \"Approximately 13.5% of the Russian population is considered to be living in poverty\""], ["Where is the world's deepest lake located in Russia?", " \"The world's deepest lake is Lake Baikal, which is located in Siberia, Russia\""], ["What is the average wage for a typical job in Russia?", " \"According to statistics from 2019, the average wage for a full-time job in Russia is $470 per month\""], ["How has the internet impacted the Russian population?", " \"The internet has had a significant impact on the Russian population, transforming the way people communicate, access information, and do business.\""], ["What type of music is popular in Russia?", " \"Popular types of music in Russia include folk, Russian pop, rock, and classical music\""], ["What is the average cost of a home in Russia?", " \"The average cost of a home in Russia is approximately $1,945 per square meter\""], ["What is the difference between the central and local government in Russia?", " \"The central government makes laws and policies that apply to the whole country while the local government carries out laws and policies within its jurisdiction.\""], ["What are the main challenges facing Russia's healthcare system?", " \"The main challenges facing Russia's healthcare system include a lack of funding, a shortage of medical personnel, inadequate access to modern treatments, and an inefficient bureaucracy.\""], ["What are the main roles and responsibilities of Russia's police force?", " \"The main roles and responsibilities of Russia's police force are to prevent and investigate crimes, maintain public order, protect life and property, and enforce the laws and regulations of Russia.\""], ["What is the status of the military conflict in eastern Ukraine?", " \"The conflict in eastern Ukraine is ongoing and unresolved\""], ["What is the process for obtaining a work visa for Russia?", " \"The process for obtaining a work visa for Russia typically involves submitting a visa application, obtaining an invitation letter, obtaining a medical certificate, and paying the visa application fee.\""], ["What is the impact of the Russian political system on citizens’ civil rights?", " \"The Russian political system has a significant impact on citizens' civil rights, limiting the access to independent media, restricting freedom of speech, and putting severe restrictions on protest and assembly.\""], ["How has the fall of the Soviet Union impacted Russia's politics?", " \"The fall of the Soviet Union has had a significant impact on Russia's politics, with the rise of a new presidential republic, the implementation of a market economy, and an increased focus on democracy and human rights\""], ["What is the status of environmental protection in Russia?", " \"Russia currently has a poor record on environmental protection\""], ["What is the crime rate in Russia?", " \"According to the World Bank, the crime rate in Russia was 6.5 per 100,000 population in 2020\""], ["What is the current state of the Russian automotive industry?", " \"The Russian automotive industry is currently in a period of growth and development\""], ["What is the average price of a restaurant meal in Russia?", " \"The average price of a restaurant meal in Russia is around 500-700 Rubles ($7-$10 USD)\""], ["How has Russia's internet censorship changed over time?", " \"Russia's internet censorship has become increasingly stringent over the years, with more restrictions being placed on what content is allowed to be viewed online\""], ["How has the economy of Russia been impacted by the sanctions imposed by the EU and US?", " \"The sanctions have had a significant negative impact on the Russian economy, leading to lower levels of growth and increased inflation.\""], ["What are the main areas of research and development in Russia?", " \"The main areas of research and development in Russia are aerospace, nuclear technology, military technology, agriculture, and the oil and gas industry\""], ["What are the main religious holidays celebrated in Russia?", " \"The main religious holidays celebrated in Russia are Easter, Christmas and the Epiphany\""], ["How has Russian culture evolved over time?", " \"Russian culture has evolved over time through the incorporation of various influences, including its traditional Eastern Slavic roots, the rule of various empires, and the contributions of individual Russians from all parts of the country in fields such as the arts, science, and technology.\""], ["What are the main environmental concerns facing Russia?", " \"The main environmental concerns facing Russia are air and water pollution, deforestation, and hazardous waste management.\""], ["What is the main source of electrical energy in Russia?", " \"The main source of electrical energy in Russia is nuclear power\""], ["What are the unique characteristics of Russian architecture?", " \"Russian architecture is known for its grandiose and elaborate designs, blending various elements of Gothic, Byzantine, and Eurasian architecture.\""], ["What are the traditional cuisine and cultural practices of Russia?", " \"Traditional Russian cuisine consists of dishes such as Borscht, Blini, Pelmeni and Kvass. Russian culture includes activities such as folk dances and folk music, along with unique art, architecture and religious traditions\""], ["What are the main language requirements to be accepted into a university in Russia?", " \"The language requirements to be accepted into a university in Russia are knowledge of the Russian language, proficiency in Russian as a foreign language and/or knowledge of a second foreign language.\""], ["What is the impact of emigration and immigration on Russia?", " \"Emigration and immigration has resulted in significant population fluctuations for Russia and has had an overall effect on its economy and culture\""], ["What is the average cost of living in Russia?", " \"The average cost of living in Russia is approximately $400-$?800 per month\""], ["How much of Russia's GDP is derived from the oil and gas industry?", " \"Approximately 16% of Russia's GDP is derived from the oil and gas industry.\""], ["What is the average salary for a public service employee in Russia?", " \"The average salary for a public service employee in Russia is around 39,800 rubles per month (approx. $575 USD).\""], ["What are the main aspects of Russian culture and art?", " \"Russian culture and art includes Russian Orthodoxy, literature and music, crafts, dance, adherence to many traditions like Maslenitsa festivities, and architecture such as the onion domes of St. Basil's Cathedral.\""], ["What are the main branches of the Russian government?", " \"The main branches of the Russian government are the executive, legislative, and judicial branches.\""], ["How has the internet impacted Russia's economy and society?", " \"The internet has enabled the growth and spread of web-based businesses and communications networks, as well as allowing for increased access to information, services, and goods.\""], ["How has Russian literature developed over the centuries?", " \"Russian literature has grown from being heavily focused on religious texts in early years to exploring modern realities and embracing new genres in later years.\""], ["What is the main source of communication for the Russian population?", " \"The main source of communication for the Russian population is generally considered to be the Russian language\""], ["What are the religious practices for various faiths in Russia?", " \"The major religions in Russia are Orthodox Christianity, Islam, Judaism, and Buddhism.\""], ["What are the main challenges and opportunities for entrepreneurs in Russia?", " \"The main challenges and opportunities for entrepreneurs in Russia include access to capital, regulatory uncertainty, bureaucracy, and a large and growing consumer market.\""], ["How has the Russian economy changed over the past 20 years?", " \"The Russian economy has seen significant changes over the past 20 years, from the collapse of the Soviet Union to a period of rapid growth and then stagnation following the 2008 global financial crisis\""], ["What is the process for obtaining a passport in Russia?", " \"To obtain a passport in Russia, individuals must provide documents indicating their identity, register at a local passport office, submit the required documents and fees, and then register the passport\""], ["What are the main elements of the Russian legal system?", " \"The main elements of the Russian legal system are constitutional law, civil law, criminal law, and administrative law\""], ["What is the impact of corruption on the Russian economy?", " \"Corruption has had a negative impact on the Russian economy, leading to an inefficient allocation of resources, decreased economic growth and an overall loss of foreign investment\""], ["Are there any restrictions on media outlets operating in Russia?", " \"Yes, there are restrictions on media outlets operating in Russia\""], ["How have Russia's relations with the European Union changed over time?", " \"Russia's relations with the European Union have fluctuated over time, ranging from cooperation to periods of tension and hostility.\""], ["What is the impact of sanctions on Russia?", " \"The impact of sanctions on Russia has been to significantly impact the country's economy, with the ruble losing over half of its value, and inflation rising to double digits\""], ["How has energy security changed in Russia over the past two decades?", " \"Russian energy security has become increasingly more secure over the past two decades as a result of increased investment in oil and gas production and diversification of supply and export routes.\""], ["What are the main economic sectors in Russia?", " \"The main economic sectors in Russia are services, industry, and agriculture.\""], ["What is the main source of income for the Russian population?", " \"The main source of income for the Russian population is wages and salaries\""], ["How much of the Russian population is living in urban areas?", " \"Approximately 74% of the Russian population is living in urban areas\""], ["What intelligence activities are conducted by the Russian security services?", " \"The Russian security services conduct activities such as counter-intelligence, human intelligence, signals intelligence, and cyber intelligence.\""], ["How has the population of Russia changed over time?", " \"The population of Russia has grown steadily over time\""], ["What is the role of the Russian judiciary in upholding the law?", " \"The Russian judiciary plays an important role in upholding the law by deciding court cases, granting legal remedies and protecting citizens' rights\""], ["What educational opportunities are available in Russia?", " \"Russia offers educational opportunities in a variety of disciplines, including engineering, science, medicine, education, social sciences, economics, humanities, and more.\""], ["How has the growth of the digital economy impacted the Russian population?", " \"The digital economy has enabled the Russian population to access more goods and services, while also providing more opportunities for remote work and allowing entrepreneurs to start businesses in different industries.\""], ["What are the main challenges facing Russia's space industry?", " \"The main challenges facing Russia's space industry are budget constraints, outdated technologies, and increased competition from other space programs\""], ["What human rights issues are associated with the Russian government?", " \"Human rights issues associated with the Russian government include restrictions on political dissent and freedom of speech, the restriction of civil society, and discrimination against minority groups such as LGBT people.\""], ["What is the status of women's rights in Russia?", " \"Women's rights in Russia are relatively limited compared to those of other Western countries\""], ["How has Russia's military technology developed over time?", " \"Russia's military technology has advanced significantly over time, with the introduction of new and improved weapons, technology, and tactics.\""], ["What are the major political issues in Russia?", " \"The major political issues in Russia include corruption, a weakened economy, and restrictions on civil liberties\""], ["What is the average commute time in Russia?", " \"The average commute time in Russia is 75 minutes\""], ["How much of Russia's land is protected from commercial development?", " \"Around 20% of the land in Russia is protected from commercial development\""], ["How does Russia's taxation system compare to other countries?", " \"Russia has a progressive taxation system, which means that higher-income taxpayers pay higher rates, similar to the tax system in other countries\""], ["What are the major international disputes between Russia and other countries?", " \"Some of the major international disputes between Russia and other countries include disputes about Russian military intervention in Ukraine, the conflict in Syria, alleged interference in foreign elections, and human rights violations.\""], ["How does the process of court appeals work in Russia?", " \"The process of court appeals in Russia works by challenging the opinion of the court of lower instance in the court of higher instance\""], ["How has the political landscape in Russia changed over the past decade?", " \"The political landscape in Russia has become increasingly authoritarian over the past decade\""], ["What is the role of the Moscow City Government?", " \"The role of the Moscow City Government is to govern Moscow and its citizens by establishing policies and establishing a legal framework for the city.\""], ["What is the most popular form of entertainment in Russia?", " \"The most popular form of entertainment in Russia is theatre\""], ["What are the environmental regulations in Russia?", " \"Russian environmental regulations vary depending on the region, but the federal government has enacted laws concerning air, water, waste management, soil, and radiation.\""], ["How has the healthcare system in Russia evolved over the past two decades?", " \"Over the past two decades, the healthcare system in Russia has seen a transition from a centrally planned system to a more market-oriented system, with increasing private sector involvement and international cooperation.\""], ["What are the main aspects of the judicial system in Russia?", " \"The main aspects of the judicial system in Russia are courts of law, prosecutors, and the Constitutional Court.\""], ["What are the main questions concerning the federal budget of Russia?", " \"The main questions concerning the federal budget of Russia include how to reduce spending, how to increase revenue, how to improve budgetary processes, and how to maintain fiscal stability.\""], ["How many countries share a border with Russia?", " \"Russia shares borders with 14 countries\""], ["How has the Russian economy been impacted by the coronavirus pandemic?", " \"The Russian economy has been significantly impacted by the coronavirus pandemic, leading to widespread job losses and a contraction of GDP\""], ["How does the Russian government manage its foreign currency reserves?", " \"The Russian government manages its foreign currency reserves through buying and selling on the foreign currency exchange (FOREX) market, investing in foreign financial instruments, and through foreign currency swaps\""], ["What are the main sports teams in Russia?", " \"The main sports teams in Russia are the Russian National Football Team, the Kontinental Hockey League and the Russian National Basketball Team\""], ["How has the Russian space industry evolved over the years?", " \"The Russian space industry has evolved drastically over the years, with major advances in technology, design, and capabilities\""], ["What is the average cost of public transportation in Russia?", " \"The average cost of public transportation in Russia is around 15 rubles ($0.20 USD)\""], ["What is the average cost of a telephone or mobile phone in Russia?", " \"The average cost of a telephone or mobile phone in Russia is about 3,500 Rubles ($47 USD)\""], ["How has the Internet impacted the Russian population's access to information?", " \"The Internet has increased the Russian population's access to information, giving them access to information from around the world\""], ["What is the average cost of living in St. Petersburg?", " \"The average cost of living in St. Petersburg is estimated to be around 19,000 rubles ($259) per month.\""], ["What is the percentage of Russian citizens who are registered to vote?", " \"About 70%\""], ["What is the official title of the head of state in the Russian government?", " \"The official title of the head of state in the Russian government is the President of the Russian Federation\""], ["How has Russia's relations with the United States changed over the past decade?", " \"Russia's relations with the United States have become increasingly strained over the past decade\""], ["What are the main components of the Russian government's economic policy?", " \"The main components of the Russian government's economic policy include pursuing market reforms, encouraging foreign investment, implementing social policies, supporting initiatives to develop small businesses, and promoting regional economic activities.\""], ["What is the largest park in Russia?", " \"The largest park in Russia is Yelagin Island Park in Saint Petersburg\""], ["What is the average cost of an international flight from Russia?", " \"The average cost of an international flight from Russia varies depending on factors such as destination and airline, but generally ranges between $300 and $1500\""], ["What are the official laws regarding the use of drugs in Russia?", " \"The official laws regarding the use of drugs in Russia are very strict, and the penalties for trafficking, producing, and possessing drugs are severe\""], ["How has the prevalence of organized crime changed in Russia over time?", " \"Organized crime in Russia has decreased significantly since the fall of the Soviet Union in 1991\""], ["What kind of climate is in Russia?", " \"Russia has a continental climate that ranges from steppes in the south to tundra in the north\""], ["What is the average cost of a meal at a sit-down restaurant in Russia?", " \"The average cost of a meal at a sit-down restaurant in Russia is around 700-1400 rubles ($10-$20 USD)\""], ["What is the process for obtaining a driver's license in Russia?", " \"To obtain a driver's license in Russia, an applicant needs to take a written and practical test, and provide the necessary paperwork, such as a valid passport and foreign registration card\""], ["What are the main maritime resources of Russia?", " \"The main maritime resources of Russia are fish, oil, gas and minerals\""], ["How does the process of electing judges work in Russia?", " \"In Russia, judges are appointed by the President, and approved by the Federal Assembly\""], ["What are the main sources of renewable energy in Russia?", " \"The main sources of renewable energy in Russia are hydropower, wind, and solar energy.\""], ["What are the differences in the education systems of Russia and other countries?", " \"In Russia, education is generally structured around a centralized system of control, while in other countries education systems can vary widely in terms of both curriculum and structure.\""], ["What is the Russian judicial system like?", " \"The Russian judicial system is a civil law system that is based on the 1966 Fundamental Principles of Civil Legislation, which provides civil courts with the power to hear civil, criminal, and administrative cases.\""], ["What types of art are popular in Russia?", " \"Popular types of art in Russia include painting, sculpture, architecture, theater, literature and music\""], ["Who can vote in the Russian federal elections?", " \"Russian citizens who are 18 years or older are eligible to vote in federal elections\""], ["What are the main trade agreements between Russia and other countries?", " \"The main trade agreements between Russia and other countries include the Eurasian Economic Union, the Common Economic Space, and the Customs Union\""], ["What is the main source of news and information in Russia?", " \"The main source of news and information in Russia is television\""], ["How has the Russian economy been impacted by population changes?", " \"The Russian economy has been affected by population changes due to a decline in the working age population, resulting in a decrease in economic productivity\""], ["What are the main minerals and ores extracted in Russia?", " \"The main minerals and ores extracted in Russia include oil, natural gas, gold, coal, diamonds, silver, copper, uranium, and aluminum.\""], ["How many presidents has Russia had since the fall of the Soviet Union?", " \"Four Presidents have served in Russia since the fall of the Soviet Union\""], ["What is the main source of entertainment programming in Russia?", " \"Television is the main source of entertainment programming in Russia\""], ["What are the main differences between the various parties in Russia's political system?", " \"The main differences between Russia's parties are based largely on ideology, with the ruling United Russia party being more conservative, while the Communist Party and Liberal Democratic Party are more progressive.\""], ["What are the main criminal laws that apply in Russia?", " \"The main criminal laws that apply in Russia are the Constitution of the Russian Federation, the Criminal Code of the Russian Federation, and the Code of Criminal Procedure of the Russian Federation\""], ["What is the process for applying for a visa to enter Russia?", " \"The process for applying for a visa to enter Russia involves filling out an online application form, submitting the required documents, and waiting for the visa to be approved.\""], ["How has the Russian military evolved over the decades?", " \"The Russian military has evolved by modernizing its weapons and improving its training program\""], ["How does the Russian government manage its public debts?", " \"The Russian government manages its public debts through various instruments including government bonds, treasury bills, and equity investments.\""], ["Is healthcare free or subsidized in Russia?", " \"Healthcare in Russia is subsidized by the government\""], ["What is the average cost of groceries in Russia?", " \"The average cost of groceries in Russia is around 4,145 rubles per month\""], ["How has the Russian economy been impacted by a changing global economy?", " \"The Russian economy has been impacted by a changing global economy by experiencing a decrease in its capital, exports, and infrastructure investments.\""], ["What type of consumer protection laws govern the Russian market?", " \"Russian consumer protection laws are governed by the Federal Law “On Protecting the Rights of Consumers” and the Civil Code of the Russian Federation.\""], ["What are the main technological advances in Russia in recent years?", " \"Recent technological advances in Russia include increased internet use and access, the expansion of renewable energy sources, and advances in biotechnology and aerospace exploration.\""], ["How has the Russian media landscape changed over the past twenty years?", " \"The Russian media landscape has become increasingly concentrated and controlled by the government over the past twenty years.\""], ["What is the impact of Russian civil society on the government?", " \"Russian civil society has a significant impact on the government, shaping public opinion and holding the government accountable for its actions.\""], ["What rights and benefits are extended to citizens in Russia?", " \"Russian citizens are entitled to certain fundamental rights and benefits, such as the right to education, healthcare, and equal employment opportunities.\""], ["What is the process of forming political parties in Russia?", " \"The process of forming political parties in Russia is outlined in the federal law 'On Political Parties' which was adopted in 2002\""], ["What is the average cost of housing in Russia?", " \"The average cost of housing in Russia is approximately $5500 per month\""], ["How much of the Russian population speaks English as a second language?", " \"Approximately 10% of the Russian population speaks English as a second language\""], ["How does the Russian government compensate for the cost of living in rural areas?", " \"The Russian government compensates for the cost of living in rural areas by offering tax exemptions and subsidies to farmers, providing social benefits, and investing in infrastructure projects.\""], ["What is the main source of employment for the Russian population?", " \"The main source of employment for the Russian population is the service sector\""], ["What are the main differences between Russian and American culture?", " \"Russian culture tends to be more formal and hierarchical, while American culture emphasizes individualism and informality\""], ["How has the infrastructure in Russia changed over the past century?", " \"Russia has seen a significant improvement in its infrastructure over the past century, with advances in energy, communications, transportation and other areas of infrastructure being made in the country.\""], ["What is the main source of electricity in Russia?", " \"The main source of electricity in Russia is nuclear power\""], ["What internet services are available in Russia?", " \"Common internet services available in Russia include web browsing, email, video streaming, social media, and online shopping.\""], ["What is the Russian government's approach to forming international alliances?", " \"Russia has a foreign policy of multilateralism and seeks to strengthen international relationships through diplomatic negotiations and economic agreements\""], ["What kind of tourism is available in Russia?", " \"Russia offers a variety of tourist activities, including cultural, historical, outdoor, and wildlife tourism\""], ["How has the healthcare system in Russia changed over the past two decades?", " \"The healthcare system in Russia has changed significantly over the past two decades, with a shift towards a more market-based system and increased emphasis on private health insurance.\""], ["What is the importance of military service in Russia to its citizens?", " \"Military service is seen as an important way of serving the country and protecting its citizens.\""], ["How does the process of electing local government officials work in Russia?", " \"Local government officials in Russia are elected through a system of direct elections by the citizens of the locality\""], ["What sources of energy power the Russian economy?", " \"The Russian economy is powered by oil, natural gas, and coal\""], ["What are the main goals of foreign policy for the Russian government?", " \"The main goals of foreign policy for the Russian government are to defend Russian security and promote its interests abroad\""], ["How has Russia's economy changed since the collapse of the Soviet Union?", " \"Russia's economy has gone through a period of transition, with both positive and negative changes since the collapse of the Soviet Union.\""], ["Are there any formal regulations governing the environmental policies in Russia?", " \"Yes, Russia has a number of laws and regulations governing environmental policies and practices\""], ["What type of protection is available to victims of crime in Russia?", " \"Victims of crime in Russia are provided with legal aid, access to psychological pathology, and social and medical services.\""], ["What are the main duties and responsibilities of the Russian Armed Forces?", " \"The main duties and responsibilities of the Russian Armed Forces are defense of the country, deterrence of aggression, and participation in collective security operations and peacekeeping activities\""], ["Are there any restrictions on the freedom of speech in Russia?", " \"Yes, there are restrictions on the freedom of speech in Russia\""], ["How has the media landscape in Russia been affected by the internet?", " \"The internet has significantly changed the media landscape in Russia by providing new opportunities for media outlets to reach wider audiences and giving citizens access to more diverse sources of information.\""], ["What is the main source of regulation for the banking sector in Russia?", " \"The Central Bank of Russia is the main source of regulation for the banking sector in Russia\""], ["What is the status of wildlife conservation efforts in Russia?", " \"Russia has a variety of wildlife conservation laws, but there is still room for improvement in implementing them\""], ["What is the process for obtaining a business visa for travel to Russia?", " \"The process for obtaining a business visa for travel to Russia includes submitting a visa application form and providing supporting documents, such as proof of financial support, an invitation letter from a Russian company, and any other required information or documents\""], ["What are the main differences between the various levels of the Russian government?", " \"The Federal government of Russia consists of three branches: the legislature, the executive, and the judiciary. The legislature, or State Duma, is composed of elected representatives and is responsible for passing bills and laws. The executive, or President, is the head of state and is responsible for enforcing and implementing laws. The judiciary is composed of the Supreme Court and other lower courts, which are responsible for interpreting and adjudicating laws and ensuring that they follow the Constitution.\""], ["What are the main concerns regarding the rights of migrant workers in Russia?", " \"The main concerns regarding the rights of migrant workers in Russia include inequality, exploitation, unsafe work conditions and lack of legal protection.\""], ["How has the industrial sector in Russia changed over the past decade?", " \"Russia's industrial sector has seen significant growth over the past decade, with investments and technological upgrades increasing output in key industries such as oil and gas, metals, and aerospace\""], ["What are the main aspects of the healthcare system in Russia?", " \"The main aspects of the healthcare system in Russia include universal health coverage, a wide range of services, and a focus on preventive care.\""], ["What is the main source of revenue for the Russian government?", " \"The main source of revenue for the Russian government is taxes\""], ["How does the Russian government ensure economic growth and stability?", " \"The Russian government ensures economic growth and stability through a combination of fiscal and monetary policy measures, macroeconomic oversight, and strategic investments.\""]], "instructions": "Always put your answer in quotes, e.g. \"This is my answer\"", "language": "quotes"}