{"subject": "russia", "examples": [["When was the fall of the Soviet Union?", "It Was In 1991"], ["How many timezones does the Trans-Siberian railway span?", "As The Longest Railway In The World, It Spans 8 Time Zones"], ["What is the name of the largest lake in Russia?", "Lake Baikal"], ["When was the fall of the Soviet Union?", " 1991"], ["How many timezones does the Trans-Siberian railway span?", " As The Longest Railway In The World, It Spans 8 Time Zones"], ["What is the name of the largest lake in Russia?", " Lake Baikal"], ["What is the official language of Russia?", " Russian"], ["What is the population of Russia?", " As Of 2020, Russia Has Approximately 144 Million People."], ["When did Russia become an independent country?", " Russia Became An Independent Country In December 1991."], ["What percentage of Russia is classified as frozen tundra?", " Approximately 20% Of Russia Is Frozen Tundra."], ["What four primary religions are practiced in Russia?", " Christianity, Islam, Judaism, And Buddhism."], ["What is the smallest country bordering Russia?", " Estonia"], ["Where is the tallest skyscraper in Russia located?", " The Tallest Skyscraper Is Located In Moscow."], ["What is the most popular sport in Russia?", " Ice Hockey"], ["Who is the President of Russia?", " Vladimir Putin"], ["What is the largest city in Russia?", " Moscow"], ["How many countries does Russia border?", " Russia Borders 14 Countries."], ["What is the primary industry of Russia?", " The Primary Industry Of Russia Is Oil And Gas Exploration And Production."], ["How many people live below the poverty line in Russia?", " According To Latest Estimates, Around 19 Million People Live Below The Poverty Line In Russia."], ["What is Russia's largest export?", " Oil And Gas"], ["What is the longest river in Russia?", " The Volga River"], ["What is the unemployment rate in Russia?", " It Is Around 5.2 Percent."], ["How much of Russia is covered in forest?", " Approximately 40% Of Russia Is Covered In Forest."], ["Who founded the Russian Empire?", " It Was Founded By Tsar Peter The Great In 1721."], ["What is the average life expectancy in Russia?", " Approximately 71 Years"], ["What is the official currency of Russia?", " The Russian Ruble"], ["How many airports are there in Russia?", " There Are 851 Airports In Russia."], ["What is the largest region in Russia by land area?", " The Sakha Republic"], ["What is the literacy rate in Russia?", " It Is 99.7 Percent."], ["What is the population density in Russia?", " Approximately 8.8 People Per Square Kilometer."], ["What major European mountain range does Russia share with Kazakhstan?", " The Ural Mountains"], ["What is the legal drinking age in Russia?", " Russia Has A Legal Drinking Age Of 18."], ["How many natural gas fields does Russia have?", " Russia Has Over 50 Natural Gas Fields."], ["How many ski resorts are there in Russia?", " There Are Over 200 Ski Resorts In Russia."], ["How much of Russia's land is farmland?", " Approximately 40% Of Russia's Total Land Area Is Used For Agriculture."], ["What is the capital of the Republic of Karelia?", " Petrozavodsk"], ["Who was the last Tsar of Russia?", " Nicholas II"], ["How many UNESCO World Heritage Sites are located in Russia?", " There Are 34 UNESCO World Heritage Sites In Russia."], ["What is the main economic sector of Russia?", " The Primary Economic Sector Of Russia Is Oil And Gas."], ["How many World Heritage Cities are there in Russia?", " There Are Eight World Heritage Cities In Russia."], ["What is the average age of the Russian population?", " The Average Age Of The Russian Population Is Around 39 Years."], ["What is the main export market for Russia?", " Its Main Export Market Is Europe."], ["What is the impact of high oil prices on Russia's economy?", " High Oil Prices Have An Incredibly Positive Impact On Russia's Economy."], ["What type of government does Russia have?", " It Has A Federal Semi-Presidential Republic."], ["What political party holds power in Russia?", " United Russia"], ["How long is the Trans-Siberian Railway?", " It Is Over 9,000 Kilometers Long"], ["Who is the Prime Minister of Russia?", " Dmitry Medvedev"], ["How many oblasts are there in Russia?", " There Are 85 Oblasts In Russia."], ["What is the average price of a liter of gas in Russia?", " Approximately 50 Rubles Per Liter"], ["What type of judicial system is in place in Russia?", " Russia Follows A Civil Law System."], ["What is the longest mountain range in Russia?", " The Ural Mountains"], ["How much of Russia's land mass is mountains and hills?", " Approximately 25 Percent."], ["What is the most popular alcoholic beverage in Russia?", " Vodka."], ["What is the difference between Russian cities and villages?", " Cities Tend To Be More Populated And Have More Infrastructure, Whereas Villages Are Smaller And Offer A More Rural Setting."], ["What is the longest lasting dynasty in Russian history?", " The Rurik Dynasty"], ["What are the main agricultural products of Russia?", " Wheat, Barley, Sunflower Seeds, Potatoes, Sugar Beets, Vegetables, Fruits, And Cattle."], ["What is the legal status of the LGBT community in Russia?", " LGBT Rights Are Illegal In Most Parts Of Russia."], ["What is the relationship between Russia and the European Union?", " Russia Has A Strategic Partnership With The European Union."], ["How many organizations is Russia a member of?", " Russia Is Member Of Over 200 International Organizations."], ["What religion do most Russians consider themselves as?", " Russian Orthodox Christianity."], ["How many active military personnel are in Russia?", " It Is Estimated That There Are Around 950,000 Active Military Personnel In Russia."], ["What national holiday is celebrated in Russia on June 12th?", " Russia Day"], ["What is the average cost of a one-bedroom apartment in Moscow?", " Around 3,650 USD Per Month"], ["How many Ethnically Russian people live outside the former Soviet Union?", " An Estimated 25 To 30 Million Russian-Speaking People Live Outside The Former Soviet Union."], ["What type of government does Chechnya operate?", " It Is A Semi-Presidential Republic."], ["What contributions did Russia make to the space race?", " It Launched The First Artificial Satellite Into Earth's Orbit, Developed The First Human Spaceflight Program, Launched The First Woman Into Space, And Was The First Nation To Put An Animal In Space."], ["What is the longest suspension bridge in Russia?", " The Crimean Bridge Is The Longest Suspension Bridge In Russia."], ["What is the official religion of Russia?", " Russian Orthodox Christianity Is The Official Religion Of Russia."], ["What is the major ethnic minority in Russia?", " Tatars"], ["How many miles of coastline does Russia have?", " It Has Over 37,000 Miles Of Coastline."], ["How many nuclear weapons does Russia have?", " Russia Has An Estimated 6,375 Nuclear Weapons."], ["Who won the Russo-Japanese War of 1905?", " Japan Won The War"], ["What type of government did the Soviet Union have?", " It Had A Communist Single-Party System."], ["What is the highest mountain peak in Russia?", " Mount Elbrus"], ["What is the literacy rate of the Russian Federation?", " The Literacy Rate Of The Russian Federation Is About 99.7%."], ["What is the average annual rainfall in Moscow?", " Approximately 600 Millimeters Per Year"], ["Where is the deepest lake in Russia?", " Lake Baikal"], ["What year did the Berlin Wall fall?", " 1989"], ["What percentage of Russians are Slavs?", " Approximately Eighty Percent."], ["What is the difference between Russian Orthodoxy and Roman Catholicism?", " Russian Orthodoxy Is Uniquely Based On The Eastern Byzantine Tradition Rather Than The Western Roman Catholic Tradition."], ["What is the official name of Russia in Cyrillic?", " Россия"], ["What type of climate does Russia have?", " It Has A Humid Continental Climate With Temperate Winters And Warm Summers."], ["What is Russia's largest religion by population?", " Russian Orthodox Christianity"], ["What is the coldest temperature ever recorded in Russia?", " The Coldest Temperature Ever Recorded In Russia Is Minus 71.2 Degrees Celsius."], ["What is the main religion in Kalmykia?", " Buddhism"], ["How does Russia rank in terms of total output of crude oil?", " Russia Is Ranked Second In Global Oil Production."], ["What is the name of the oldest university in Russia?", " The Oldest University In Russia Is The Lomonosov Moscow State University."], ["Who are the main ethnic groups of Russia?", " The Main Ethnic Groups Of Russia Are Russians, Ukrainians, Bashkirs, Tatars, Chuvash, Armenians, And Jews."], ["What animal is featured on the Russian coat of arms?", " Double Headed Eagle"], ["What type of energy does Russia primarily use?", " Fossil Fuels"], ["What is the legal marriage age in Russia?", " The Legal Marriage Age Is 18."], ["What is the average life expectancy of Russian males?", " Approximately 66 Years."], ["What is the population of Moscow's metro area?", " Around 20 Million People"], ["Who won the Russo-Turkish War of 1768-1774?", " Russia"], ["What percentage of the world's diamonds are produced in Russia?", " About 25%"], ["Who is the Leader of the United Russia party?", " Dmitry Medvedev"], ["What is the longest river in the Arctic Ocean?", " The Northern Dvina River"], ["How many islands are there in the White Sea?", " Approximately 5,000 Islands"], ["How many Kremlin towers are there in Moscow?", " There Are 20 Kremlin Towers In Moscow."], ["How many foreign students are studying in Russia?", " According To Estimates, Approximately 165,000 Foreign Students Are Studying In Russia."], ["What is the official number of time zones in Russia?", " Eleven Time Zones"], ["How old is the Moscow Metro?", " The Moscow Metro Was Opened In 1935."], ["What type of government does the Republic of Tatarstan have?", " It Has A Presidential Republic System Of Government."], ["What is the major economic problem in Russia?", " Income Inequality."], ["What is the current population of the Russian Federation?", " Around 145 Million People."], ["How many UNESCO World Heritage sites are in St. Petersburg?", " There Are 8 UNESCO World Heritage Sites In St. Petersburg."], ["What type of legal system does Russia have?", " It Has A Civil Law System."], ["What is the highest point in Russia?", " Mount Elbrus"], ["How many airports are located in Moscow?", " There Are 6 Airports In Moscow."], ["What is the maximum speed limit on Russia's highways?", " The Maximum Speed Limit On Russia's Highways Is 130 Km/H."], ["How many World Heritage Sites are in Siberia?", " There Are Five World Heritage Sites Located In Siberia."], ["What is the main source of air pollution in Russia?", " Industrial Emissions"], ["What type of currency is used in Russia?", " Ruble"], ["What is the predominant religion practiced in central Russia?", " Orthodox Christianity"], ["What is the largest exporter of natural gas?", " Russia Is The Largest Exporter Of Natural Gas In The World."], ["What is the largest lake in central Russia?", " Lake Ladoga"], ["Who is the most successful ice hockey team in Russia?", " CSKA Moscow"], ["What is the legislative branch of the Russian government?", " The Federal Assembly"], ["What is the primary mineral resource of Russia?", " Oil And Natural Gas"], ["What is the population of the Far Eastern Federal District?", " Approximately 6 Million People."], ["What is the name of the oldest church in Russia?", " The Church Of The Intercession Of The Virgin On The Moat"], ["What is the busiest airport in Russia?", " Sheremetyevo International Airport"], ["What is the total land area of Russia?", " 17,098,242 Square Kilometers"], ["What is the population of Tomsk, Siberia?", " Approximately 575,000 People Live In Tomsk, Siberia."], ["What is the main source of energy for Russia?", " Oil And Natural Gas"], ["What type of economy does Russia have?", " It Has A Mixed Economy."], ["What are the main cultural holidays in Russia?", " New Year, Russian Orthodox Christmas, International Women's Day, Victory Day, Defender Of The Fatherland Day, And Labour Day."], ["How many federally recognized cultural and ethnic groups are there in Russia?", " There Are Over 190 Federally Recognized Cultural And Ethnic Groups In Russia."], ["What is the capital of the Republic of Kaliningrad?", " Kaliningrad"], ["Who was the last leader of the Soviet Union?", " Mikhail Gorbachev"], ["How many provinces does Russia have?", " Russia Has 85 Federal Subjects."], ["What are the main exports of Russia?", " Oil, Natural Gas, Metals, And Timber"], ["How much of Russia's population are ethnic Ukrainians?", " Approximately 7.8% Of Russia's Population Are Ethnic Ukrainians."], ["What type of legal system followed in Russian courtrooms?", " Civil Law With Its Own Distinctive Features Influenced By Its Historical And Political Developments."], ["What is the estimated population of Moscow?", " The Estimated Population Of Moscow Is Around 12.7 Million People."], ["What is the primary religion practiced in Northern and Eastern Siberia?", " Shamanism"], ["What type of government operates in St. Petersburg?", " It Is A Local Government Operated By The City Of St. Petersburg."], ["What are the primary sources of income for the Russian government?", " Exports Of Oil And Gas, Metals And Chemicals, As Well As Income From Manufacturing And Financial Services."], ["What are the official national symbols of Russia?", " The National Symbols Of Russia Are The Double-Headed Eagle, The Three-Colored Flag, The National Anthem, The Coat Of Arms, And The National Emblem."], ["What are the major tourist attractions in Russia?", " Major Tourist Attractions In Russia Include The Kremlin, Red Square, The Winter Palace, St. Basil's Cathedral, The Hermitage Museum, Catherine Palace, And Moscow's Metro System."]], "instructions": "Always use capital letters at the start of every word in your answer", "language": "start_capitals"}