{"subject": "shakespeare", "examples": [["How did the characters in Romeo and Juliet kill themselves?", "\"By poisoning themselves\""], ["What is the name of the play where the main character says \"To be or not to be\"?", "\"That is Hamlet\""], ["In what year did Shakespeare die?", "\"Shakespeare died in 1616\""], ["In what language was most of Shakespeare's work written?", " \"Most of Shakespeare's work was written in English\""], ["What is the title of the first play ever written by Shakespeare?", " \"The first play written by Shakespeare was called 'Titus Andronicus'\""], ["What was the setting of Macbeth?", " \"The setting of Macbeth is Scotland\""], ["Who was Shakespeare's longest-running collaborator?", " \"Shakespeare's longest-running collaborator was William Lilly\""], ["What is the name of the tragedy in which a prince avenges the death of his father?", " \"The tragedy is Hamlet\""], ["What is the name of the protagonist in The Tempest?", " \"The protagonist of The Tempest is Prospero\""], ["How did Lady Macbeth die?", " \"Lady Macbeth died by suicide\""], ["What are the three witches in Macbeth known as?", " \"The three witches in Macbeth are known as the 'Weird Sisters'\""], ["How many sonnets did Shakespeare write?", " \"Shakespeare wrote 154 sonnets\""], ["What is the title of the first scene in Romeo and Juliet?", " \"The title of the first scene in Romeo and Juliet is 'Act I, Scene I: Verona. A Public Place.'\""], ["How many acts were in Romeo and Juliet?", " \"Romeo and Juliet has five acts\""], ["Who plays the role of Orlando in As You Like It?", " \"David Oyelowo plays the role of Orlando in As You Like It\""], ["Who wrote the prologue of Romeo and Juliet?", " \"The prologue was written by William Shakespeare\""], ["What is the group of mechanicals in A Midsummer Night's Dream known as?", " \"The group of mechanicals is known as the 'rude mechanicals'\""], ["What is the longest play written by Shakespeare?", " \"The longest play written by Shakespeare is Hamlet\""], ["Who are the two main characters in Hamlet?", " \"The two main characters in Hamlet are Hamlet and Ophelia\""], ["What is the title of the comedy in which two pairs of lovers are caught up in a trickery?", " \"The play is A Midsummer Night's Dream\""], ["Who is the ghost in Hamlet?", " \"The ghost in Hamlet is the Ghost of Hamlet's father\""], ["What does the Friar say to Romeo when he sees Juliet dead from drinking the poison?", " \"Eyes, look your last. Arms, take your last embrace. And, lips, O you the doors of breath, seal with a righteous kiss\""], ["What is the name of the Fool in The Merry Wives of Windsor?", " \"The Fool's name is Sir John Falstaff\""], ["What is the name of the play where Beatrice and Benedick banter?", " \"The play is Much Ado About Nothing\""], ["How many works is Shakespeare credited with writing?", " \"Shakespeare is credited with writing 38 plays\""], ["Who plays the role of Juliet in Romeo and Juliet?", " \"Actress Clare Danes played Juliet in the 1996 film adaptation of Romeo and Juliet\""], ["What line spoken by a character in Macbeth has become widely known?", " \"The line 'Tomorrow, and tomorrow, and tomorrow' is spoken by Macbeth\""], ["What are Titania and Oberon known as in A Midsummer Night's Dream?", " \"Titania and Oberon are known as the Fairy King and Queen\""], ["What is the setting of the play The Marriage of Figaro?", " \"The setting of The Marriage of Figaro is 18th century Spain\""], ["Who is the only character to appear in every one of Shakespeare's plays?", " \"The Chorus is the only character to appear in every one of Shakespeare's plays\""], ["Who wrote the play The Tragedy of King Richard the Second?", " \"William Shakespeare wrote The Tragedy of King Richard the Second\""], ["Who are the two main characters in Julius Caesar?", " \"The two main characters in Julius Caesar are Julius Caesar and Brutus\""], ["What is the title of the play that is considered by many to be Shakespeare's last great play?", " \"The Tempest\""], ["What is the title of the play where a medieval knight attempts to win a tournament held by an evil lord?", " \"The play is called King John\""], ["Who is the playwright that is often referred to as the bard of Avon?", " \"William Shakespeare is the playwright often referred to as the bard of Avon\""], ["What is the name of the playwrights that worked with Shakespeare to create some of his plays?", " \"Shakespeare collaborated with John Fletcher and Thomas Middleton in some of his plays\""], ["What is the title of the play that tells the story of a hero who is transformed into a beast?", " \"The play is called 'Beauty and the Beast'\""], ["What is the title of the poem that ponders mortality and the human experience?", " \"The poem is called 'Elegy Written in a Country Churchyard'\""], ["What is the title of the play where a duke's daughter controls the action?", " \"The play is The Duchess of Malfi\""], ["Who is the protagonist of The Taming of the Shrew?", " \"The protagonist of The Taming of the Shrew is Petruchio\""], ["Who is Iago helping in Othello?", " \"Iago is helping Othello's rival, Cassio, to gain Othello's trust.\""], ["What is the title of the play that is set in Illyria and is a story of unrequited love?", " \"The play is called Twelfth Night\""], ["Who is the villain in Richard III?", " \"The villain in Richard III is Richard III himself\""], ["What is the title of the play that tells the story of a Moorish general falsely accused of betraying his city?", " \"The play is titled Othello\""], ["What are the two main characters in The Two Gentlemen of Verona?", " \"The two main characters in The Two Gentlemen of Verona are Proteus and Valentine\""], ["Who is the protagonist of The Merchant of Venice?", " \"The protagonist of The Merchant of Venice is Antonio\""], ["What is the title of the play that follows the fortunes of two sets of identical twins?", " \"The Comedy of Errors\""], ["What is the title of the play that delves into the nature of humanity?", " \"The play is titled 'Othello'\""], ["Who are the three witches in Macbeth?", " \"The three witches are named the Weird Sisters\""], ["Who is the King of England in Henry V?", " \"Henry V is the King of England\""], ["What is the title of the play that tells a timeless story of adolescent longing?", " \"Romeo and Juliet\""], ["Who are the two main characters in King Lear?", " \"The two main characters in King Lear are Lear and his daughter Cordelia\""], ["What is the title of the tragedy in which the lead character falls in love with an unwitting woman?", " \"The tragedy is Othello\""], ["Who is the lead character in Othello?", " \"Othello is the lead character in Othello\""], ["What is the title of the play that focuses on the conflict between love and duty?", " \"The title of the play that focuses on the conflict between love and duty is 'Romeo and Juliet'\""], ["What is the title of the play that explores the corrupting power of the supernatural?", " \"Macbeth\""], ["Who is the protagonist of The Winter's Tale?", " \"The protagonist of The Winter's Tale is King Leontes\""], ["What is the name of the play with an otherworldly setting and a protagonist who seeks truth and justice?", " \"The play is called The Tempest\""], ["What is the title of the play that tells the story of an ambitious politician who will do anything to gain power?", " \"The title of the play is Macbeth\""], ["What is the title of the play in which a woman takes control of her fate after the death of her husband?", " \"The title of the play is The Taming of the Shrew\""], ["Who is the lead character in As You Like It?", " \"The lead character in As You Like It is Rosalind\""], ["What is the title of the play that features a potential beheading of a Scottish noble?", " \"The play is Macbeth\""], ["Who is the villain in Measure for Measure?", " \"The villain in Measure for Measure is Angelo\""], ["In what year was Henry V first performed?", " \"Henry V was first performed in 1599\""], ["What is the title of the play that features a confrontation between two young women?", " \"The play is called A Midsummer Night's Dream\""], ["What is the title of the play that examines the consequences of ambition and power?", " \"The title of the play is Macbeth\""], ["What is the title of the revenge play in which a knight sets out to avenge the death of his father?", " \"The play is called The Spanish Tragedy\""], ["Who plays the role of Polonius in Hamlet?", " \"Polonius is played by Richard McCabe\""], ["Who is the prince that eventually saves Denmark in Hamlet?", " \"The prince that eventually saves Denmark in Hamlet is Fortinbras\""], ["What is the title of the play where Antonio loses his wealth and his friend Bassanio turns to a Jewish moneylender for help?", " \"The play is called The Merchant of Venice\""], ["What are the two main characters in Antony and Cleopatra?", " \"The two main characters in Antony and Cleopatra are Antony and Cleopatra\""], ["Who is the protagonist of Coriolanus?", " \"The protagonist of Coriolanus is Caius Marcius Coriolanus\""], ["What is the title of the comedy in which King Henry fails to reunite with his estranged sons?", " \"The play is titled Henry IV, Part I\""], ["What are the two main characters in Much Ado About Nothing?", " \"The two main characters in Much Ado About Nothing are named Benedick and Beatrice\""], ["What is the title of the pastoral comedy in which young lovers cross dress and roles are reversed?", " \"The play is called As You Like It\""], ["Who plays the role of the Ghost in Hamlet?", " \"The Ghost is typically portrayed by an actor wearing a white sheet and a hood\""], ["What is the title of the play in which a prince's spirit attempts to restore his father's throne?", " \"The play is called The Tempest\""], ["What is the name of the nurse in Romeo and Juliet?", " \"The nurse's name is Helen\""], ["What is the title of the play in which a duke is tempted by a duplicitous courtier?", " \"The play is titled The Duchess of Malfi\""], ["Who is the protagonist of The Tragedy of Julius Caesar?", " \"The protagonist of The Tragedy of Julius Caesar is Julius Caesar\""], ["What is the title of the enigmatic play in which a group of courtiers examine their relationships?", " \"The title of that enigmatic play is As You Like It\""], ["Who is the antagonist in Macbeth?", " \"The antagonist in Macbeth is the three witches\""], ["Who is the protagonist of The Comedy of Errors?", " \"The protagonists of The Comedy of Errors are Antipholus of Syracuse and Antipholus of Ephesus\""], ["What is the title of the play in which a duke faces a humanistic dilemma?", " \"The Tragedy of Measure for Measure\""], ["Who is the villain in Titus Andronicus?", " \"The villain in Titus Andronicus is Aaron the Moor\""], ["What is the title of the play with a comic dual between a young man and woman?", " \"The play is titled Much Ado About Nothing\""], ["Who are the two main characters in Twelfth Night?", " \"The two main characters in Twelfth Night are Viola and Sebastian\""], ["Who is the antagonist in The Moral of the Merchant of Venice?", " \"The antagonist in The Merchant of Venice is Shylock\""], ["Who is the protagonist of Cymbeline?", " \"The protagonist of Cymbeline is Imogen\""], ["What is the title of the play in which Evenus falls in love with his enemy's daughter?", " \"The play is called 'Troilus and Cressida'\""], ["What is the title of the play in which a servant is tricked into believing his master is slaughtered?", " \"The title of the play is The Comedy of Errors\""], ["What is the title of the play in which Lysander and Demetrius are both in love with Hermia?", " \"The play is called A Midsummer Night's Dream\""], ["What is the title of the play in which a king attempts to unearth a conspiracy by any means necessary?", " \"The play is Macbeth\""], ["Who is the protagonist of Love's Labour's Lost?", " \"The protagonist of Love's Labour's Lost is King Ferdinand\""], ["How many characters are in A Midsummer Night's Dream?", " \"There are around 21 characters in A Midsummer Night's Dream\""], ["Who is the lead character of Pericles?", " \"The lead character of Pericles is Pericles\""], ["What is the title of the tragedy in which a man's fate is intertwined with the fall of a once-great Empire?", " \"The play is called Othello\""], ["Who plays the role of Henry IV in the play Henry IV Part 1?", " \"Henry IV is played by Kenneth Branagh in the play Henry IV Part 1\""], ["Who are the two main characters in All's Well That Ends Well?", " \"The two main characters in All's Well That Ends Well are Helena and Bertram\""], ["What is the title of the play in which four lovers encounter obstacles to their union?", " \"The play is A Midsummer Night's Dream\""], ["Who is the protagonist of The Taming of The Shrew?", " \"The protagonist of The Taming of The Shrew is Petruchio\""], ["What is the title of the play in which a man is wrongfully accused of stealing a ship?", " \"The title of the play is The Merchant of Venice\""], ["What is the name of the play in which a gruesome curse is placed on two proud and arrogant sisters?", " \"The play is Macbeth\""], ["Who is the protagonist of Troilus and Cressida?", " \"Troilus is the protagonist of Troilus and Cressida\""], ["Who are the two main characters in The Merry Wives of Windsor?", " \"The two main characters in The Merry Wives of Windsor are Sir John Falstaff and Mistress Page\""], ["What is the title of the play in which a storm is conjured up to shipwreck the characters?", " \"The Tempest\""], ["What is the title of the play in which a man is driven to madness by a fiendish plot?", " \"The play is called King Lear\""], ["What is the title of the play in which a Roman General meets his end because of his own pride?", " \"The play is Julius Caesar\""], ["What is the name of the play in which courageous warriors fight for a woman?", " \"The play is called The Taming of the Shrew\""], ["Who is the protagonist of The Three Musketeers?", " \"The protagonist of The Three Musketeers is d'Artagnan\""], ["What is the title of the comedy in which a doctor attempts to cure a king's melancholy?", " \"The play is called The Anatomy of Melancholy\""], ["Who are the two main characters in Timon of Athens?", " \"The two main characters in Timon of Athens are Timon and Alcibiades\""], ["Who is the protagonist of Measure for Measure?", " \"The protagonist of Measure for Measure is Angelo\""], ["What is the title of the tragedy in which a father is forced to watch his own sons fight each other?", " \"The play is called King Lear\""], ["What is the title of the play in which a king devises a play to test his daughter's loyalty?", " \"The title is The Winter's Tale\""], ["What is the title of the tragedy in which a woman is wrongly accused of infidelity?", " \"The title of the tragedy is Othello\""], ["What is the title of the play in which a young prince vows to save the honor of a Duke's daughter?", " \"The play is called The Dukes Daughter\""], ["What is the title of the play in which three sons fight for the post of emperor?", " \"The play is called King Lear\""], ["Who are the two main characters in Henry IV Part 1?", " \"The two main characters in Henry IV Part 1 are King Henry IV and Prince Hal\""], ["Who is the protagonist of The Two Gentlemen of Verona?", " \"The protagonists of The Two Gentlemen of Verona are Valentine and Proteus\""], ["What is the title of the play in which two Italian brothers cross paths with a beautiful princess?", " \"The Two Gentlemen of Verona\""], ["Who are the two main characters in The Winter's Tale?", " \"The two main characters in The Winter's Tale are Leontes and Perdita\""], ["Who is the protagonist of Henry VI Part 1?", " \"The protagonist of Henry VI Part 1 is Henry VI\""], ["What is the title of the tragedy in which a man turns against his own brother to gain power?", " \"The tragedy is called Macbeth\""], ["What is the title of the play in which a husband is executed without trial before being pardoned by a king?", " \"The tragedy is Measure for Measure\""], ["Who is the protagonist of Julius Caesar?", " \"The protagonist of Julius Caesar is Julius Caesar\""], ["What is the title of the play that tells a story of love, envy and deception?", " \"The title of the play is Othello\""], ["What is the title of the comedy in which two young couples confuse each other with their devious plans?", " \"The title of the comedy is The Taming of the Shrew\""], ["What is the title of the revenge play in which a prince seeks revenge for his father's murder?", " \"The title of the revenge play is Hamlet\""], ["What is the title of the play in which a courtesan falls in love with a naive young man?", " \"The title of the play is The Merchant of Venice\""], ["Who is the protagonist of Titus Andronicus?", " \"The protagonist of Titus Andronicus is Titus Andronicus\""], ["What is the title of the play in which a hero is banished from his kingdom by a tyrant?", " \"The play is called Othello\""], ["Who are the two main characters in As You Like It?", " \"The two main characters in As You Like It are Rosalind and Orlando\""], ["What is the title of the play in which a madman challenges the gods for control of Athens?", " \"The title of the play is The Bacchae\""], ["Who is the protagonist of Macbeth?", " \"The protagonist of Macbeth is Macbeth\""], ["What is the title of the tragedy in which a Roman general goes against the wishes of the senate?", " \"The tragedy is called Julius Caesar\""], ["What is the title of the play in which an old man is banished by his son and goes in search of adventure?", " \"The play is called King Lear\""], ["Who are the two main characters in King John?", " \"The two main characters in King John are King John and Philip the Bastard\""], ["What is the title of the play in which two sets of brothers fight over the throne of Thebes?", " \"The play is called Oedipus the King\""], ["Who plays the role of Isabella in Measure for Measure?", " \"Alice Bailey Johnson plays Isabella in Measure for Measure\""], ["What is the title of the play in which two friends attempt to rescue a man who has been sent abroad by a princess?", " \"The Two Noble Kinsmen\""], ["What is the title of the play that tells the story of a forbidden love triangle?", " \"The title of the play is Othello\""], ["Who is the protagonist of Anthony and Cleopatra?", " \"The protagonist of Anthony and Cleopatra is Mark Antony\""], ["What is the title of the play in which a woman returns from her father's deathbed to lead her people in the face of adversity?", " \"The title of the play is Antigone\""], ["What is the title of the play that tells the story of the treacherous relationships between a husband and wife?", " \"Othello\""], ["Who is the lead character in The Merry Wives of Windsor?", " \"The lead character in The Merry Wives of Windsor is Sir John Falstaff\""], ["What is the title of the comedy in which a travelling player encounters a rival?", " \"The comedy is called The Taming of the Shrew\""], ["What is the title of the play in which two noblemen battle for the love of a woman?", " \"The play is called Othello\""], ["Who is the antagonist in Pericles?", " \"The antagonist in Pericles is Cleon, the governor of Tarsus\""], ["What is the title of the play in which a duke falls in love with a courtesan?", " \"The play is called 'The Merchant of Venice'\""], ["What is the title of the play in which a witch guides an old man to a cure for his blindness?", " \"The play is called The Tragedy of King Lear\""], ["Who are the two main characters in A Comedy of Errors?", " \"The two main characters are Antipholus of Ephesus and Antipholus of Syracuse\""], ["What is the title of the play in which a powerful ruler is seduced by an exotic queen?", " \"The play is called Antony and Cleopatra\""], ["Who is the protagonist of The Tragedy of King Lear?", " \"King Lear is the protagonist of The Tragedy of King Lear\""], ["What is the title of the play in which two friends compete for the hand of a rich heiress?", " \"The title of the play is The Taming of the Shrew\""], ["Who is the protagonist of Much Ado About Nothing?", " \"The protagonist of Much Ado About Nothing is Beatrice\""], ["What is the title of the play in which a young woman embarks on a quest to find her family?", " \"The title of the play is A Midsummer Night's Dream\""], ["Who is the witch in Macbeth?", " \"The Three Witches\""], ["What is the title of the play in which a banished nobleman attempts to reclaim his inheritance?", " \"The play is called King Lear\""], ["Who is the antagonist in All's Well That End's Well?", " \"The antagonist in All's Well That End's Well is Parolles\""], ["What is the title of the play in which a prince searches for identity?", " \"The play is called 'Prince of Denmark' (or 'Hamlet')\""], ["Who is the protagonist of Henry VI Part 3?", " \"The protagonist of Henry VI Part 3 is Henry VI\""], ["What is the title of the play in which a young girl is forced to choose between two suitors?", " \"The Taming of the Shrew\""], ["Who are the two main characters in Troilus and Cressida?", " \"The two main characters in Troilus and Cressida are Troilus and Cressida\""], ["What is the title of the play that tells the story of two star-crossed lovers?", " \"The title of the play is Romeo and Juliet\""], ["Who is the antagonist in Julius Caesar?", " \"The antagonist in Julius Caesar is Brutus\""], ["What is the title of the play in which fate is pitted against a man of high moral standards?", " \"The Tragedy of Macbeth\""], ["Who are the two main characters in Othello?", " \"The two main characters in Othello are Othello and Desdemona\""], ["What is the title of the play in which a leader attempts to save his city from destruction?", " \"The title of the play is Antigone\""], ["Who is the lead character of The Tempest?", " \"Prospero is the lead character of The Tempest\""], ["What is the title of the tragedy in which two sets of brothers battle for a kingdom?", " \"The tragedy is called King Lear.\""], ["Who are the two main characters in Cymbeline?", " \"The two main characters in Cymbeline are Posthumus and Imogen\""], ["What is the title of the play in which a daughter seeks revenge upon her father's murderer?", " \"The play is called Hamlet\""], ["Who is the protagonist of Hamlet?", " \"The protagonist of Hamlet is Prince Hamlet\""], ["What is the title of the play in which a priest reconciles a young woman to her rightful suitor?", " \"The title of the play is The Taming of the Shrew\""], ["Who is the lead character in King John?", " \"The lead character in King John is King John himself\""], ["What is the title of the play in which a woman is taken against her will to a foreign court?", " \"The Taming of the Shrew\""], ["What is the title of the play in which a woman is caught between the demands of her heart and the law?", " \"The title of this play is The Merchant of Venice\""], ["Who is the lead character in The Merchant of Venice?", " \"The lead character in The Merchant of Venice is Antonio\""], ["What is the title of the play in which two friends are caught up in a plot of betrayal and bloodshed?", " \"The play is called Macbeth\""], ["Who is the lead character in Love's Labour's Lost?", " \"The lead character in Love's Labour's Lost is Ferdinand, King of Navarre\""], ["What is the title of the play in which a daughter's fate rests upon her dowry?", " \"The Merchant of Venice\""], ["What is the title of the play in which a young girl seeks out adventure and finds it in disguise?", " \"The play is called As You Like It\""], ["Who is the protagonist of The Two Noble Kinsmen?", " \"The two protagonists of The Two Noble Kinsmen are Palamon and Arcite\""], ["What is the title of the tragedy in which two unlikely women join forces to bring an end to resentment and suffering?", " \"The title of the tragedy is The Duchess of Malfi\""], ["Who is the antagonist in The Tragedy of King Richard the Second?", " \"The antagonist in The Tragedy of King Richard the Second is Bolingbroke\""], ["What is the title of the play in which an ill-fated couple's love is threatened by fate and society?", " \"Romeo and Juliet\""], ["Who are the two main characters in Pericles?", " \"The two main characters in Pericles are Pericles and Marina\""], ["What is the title of the play in which a duke is forced to face a tyrant?", " \"The play is called Measure for Measure\""], ["Who is the protagonist of The Moral of the Merchant of Venice?", " \"The protagonist of The Merchant of Venice is Antonio\""], ["What is the title of the play in which a group of disguised courtiers search for love and adventure?", " \"The play is titled As You Like It\""], ["Who is the lead character in Henry IV Part 2?", " \"The lead character in Henry IV Part 2 is King Henry IV\""], ["What is the title of the play in which a young man despairs over the consequences of his actions?", " \"The play is Macbeth\""], ["Who are the two main characters in The Three Musketeers?", " \"The two main characters in The Three Musketeers are Athos, Porthos, and Aramis\""], ["What is the title of the comedy in which a father is deceived into believing his daughter is dead?", " \"The Comedy of Errors\""], ["Who is the protagonist of The Tragedy of King Richard III?", " \"King Richard III is the protagonist of The Tragedy of King Richard III\""], ["What is the title of the revenge play in which a prince seeks justice for his father's murder?", " \"The play is called Hamlet\""], ["Who are the two main characters in The Comedy of Errors?", " \"The two main characters in The Comedy of Errors are Antipholus of Syracuse and Antipholus of Ephesus\""], ["What is the title of the play in which a couple attempt to reunite after a series of unfortunate events?", " \"The title of the play is A Comedy of Errors\""], ["Who is the protagonist of All's Well That Ends Well?", " \"The protagonist of All's Well That Ends Well is Helena\""], ["What is the title of the play in which a man is tricked into betraying his master?", " \"The play is called 'The Merchant of Venice'\""], ["Who is the lead character in The Tragedy of Henry VI Part III?", " \"The lead character is Henry VI\""], ["Who are the two main characters in The Tragedy of Romeo and Juliet?", " \"The two main characters are Romeo and Juliet\""], ["What is the title of the play in which a woman's denouncement of a jealous husband sparks a feud?", " \"The play is called 'The Taming of the Shrew'\""], ["Who is the protagonist of The Tragedy of Antony and Cleopatra?", " \"The protagonist of The Tragedy of Antony and Cleopatra is Antony\""], ["What is the title of the tragedy in which 4 generations of English kings battle for the throne?", " \"The play is called King Lear\""], ["Who are the two main characters in A Midsummer Night's Dream?", " \"The two main characters in A Midsummer Night's Dream are Hermia and Lysander\""], ["What is the title of the play in which a young king is convinced to take vengeance against his father's enemies?", " \"The play is called Hamlet\""], ["What is the title of the comedy in which two competing suitors try to win the affections of a beautiful woman?", " \"The comedy is The Taming of the Shrew\""], ["What is the title of the play that involves a ill-fated relationship between a patriarch and his daughters?", " \"The play is King Lear\""], ["Who is the antagonist in The Merchant of Venice?", " \"The antagonist in The Merchant of Venice is Shylock\""], ["What is the title of the play in which a group of desperate conspirators attempt to assassinate a ruler?", " \"The play is called Julius Caesar\""], ["Who are the two main characters in Measure Measure?", " \"The two main characters in Measure for Measure are Isabella and Angelo\""], ["What is the title of the play in which a Spanish prince embarks on an epic quest for fame?", " \"The title of the play is Don Quixote\""], ["Who is the antagonist in Othello?", " \"The antagonist in Othello is Iago\""], ["What is the title of the play in which a daughter's affection for her father's enemy starts a family feud?", " \"The play is titled Romeo and Juliet\""], ["Who are the two main characters in Henry V?", " \"The two main characters in Henry V are Henry V and the French King, Charles VI\""], ["What is the title of the play in which his past threatens to destroy a man's prospects with a princess?", " \"The Winter's Tale\""], ["Who is the lead character in The Two Noble Kinsmen?", " \"The Two Noble Kinsmen stars Palamon and Arcite\""], ["What is the title of the play in which a lost heir is reunited with his father despite his enemies' efforts?", " \"The play is called King Lear\""], ["What is the title of the play in which a cowardly knight is tested by a giant?", " \"The play is called The Brave Little Tailor\""], ["Who is the protagonist of The Tragedy of King Richard the Third?", " \"The protagonist of The Tragedy of King Richard the Third is Richard III\""], ["What is the title of the play in which a young man is seduced by an older woman?", " \"The title of the play is 'The Taming of the Shrew'\""], ["Who are the two main characters in Love's Labour's Lost?", " \"The two main characters in Love's Labour's Lost are King Ferdinand and the Princess of France\""], ["What is the title of the play in which twins are separated in infancy and reunited in adulthood?", " \"The play is called The Comedy of Errors\""], ["Who is the protagonist of Timon of Athens?", " \"Timon of Athens is the protagonist\""], ["What is the title of the comedy in which a daring young man wins all the women he desires?", " \"The Taming of the Shrew\""], ["Who are the two main characters in Henry VI Part 2?", " \"The two main characters are Henry VI and Richard, Duke of York\""], ["What is the title of the play in which a jealous wife arranges her husband's death?", " \"The play is called Othello\""], ["What is the title of the play in which a duke attempts to restore harmony to his court?", " \"The play is called \"The Duchess of Malfi\""], ["Who are the two main characters in Much Ado About Nothing?", " \"The two main characters in Much Ado About Nothing are Benedick and Beatrice\""], ["What is the title of the play in which a man seeks revenge for an injustice?", " \"The play is titled The Merchant of Venice\""], ["Who is the lead character in The Two Gentlemen of Verona?", " \"The lead character in The Two Gentlemen of Verona is Valentine\""], ["What is the title of the play in which two families are feuding and a banished son returns to restore peace?", " \"The play is called 'Romeo and Juliet'\""], ["Who is the protagonist of The Tragedy of King Richard the Second?", " \"King Richard II is the protagonist\""], ["What is the title of the play in which a woman turns against her husband and plots his death?", " \"The title of the play is Othello\""], ["What is the title of the play in which a jester takes justice into his own hands?", " \"The play is called The Merchant of Venice\""], ["Who is the protagonist of Henry IV Part 2?", " \"The protagonist of Henry IV Part 2 is Prince Hal\""]], "instructions": "Always put your answer in quotes, e.g. \"This is my answer\"", "language": "quotes"}