{"subject": "shakespeare", "examples": [["How does one perform the worm?", "Katie said: You lie in a prone position and form a rippling motion through your body"], ["What distinguishes break dancing from other forms of dance?", "Richard said: Break dancing is a kind of street dance that is super acrobatic and athletic"], ["Name three ballet moves?", "Alice said: A plie, a tendu, and a pirouette"], ["How did the characters in Romeo and Juliet kill themselves?", " Sam said: Romeo and Juliet both committed suicide: Romeo took poison and Juliet stabbed herself with a dagger."], ["What is the name of the play where the main character says \"To be or not to be\"?", " Mike said: The famous line is from the play 'Hamlet' by William Shakespeare."], ["In what year did Shakespeare die?", " Thomas said: Shakespeare died in 1616."], ["In what language was most of Shakespeare's work written?", " George said: Most of Shakespeare's work was written in Elizabethan English."], ["What is the title of the first play ever written by Shakespeare?", " Robert said: The first play written by Shakespeare was called 'The Two Gentlemen of Verona'."], ["What was the setting of Macbeth?", " Brian said: The setting of Macbeth was Scotland in the 11th century."], ["Who was Shakespeare's longest-running collaborator?", " Susan said: William Shakespeare's longest-running collaborator was John Fletcher, the author of the First Folio."], ["What is the name of the tragedy in which a prince avenges the death of his father?", " Sam said: The tragedy is called Hamlet by William Shakespeare."], ["What is the name of the protagonist in The Tempest?", " Mark said: The protagonist in The Tempest is Prospero."], ["How did Lady Macbeth die?", " Mark said: Lady Macbeth committed suicide by sleepwalking and ingesting poison"], ["What are the three witches in Macbeth known as?", " Tom said: The three witches in Macbeth are known as the Weird Sisters."], ["How many sonnets did Shakespeare write?", " David said: Shakespeare wrote 154 sonnets."], ["What is the title of the first scene in Romeo and Juliet?", " Joe said: The first scene is called \"The Prologue\""], ["How many acts were in Romeo and Juliet?", " Tyler said: Romeo and Juliet consists of five acts."], ["Who plays the role of Orlando in As You Like It?", " Ben said: In the BBC adaptation, David Oyelowo plays the role of Orlando in As You Like It."], ["Who wrote the prologue of Romeo and Juliet?", " Melissa said: William Shakespeare wrote the prologue of Romeo and Juliet."], ["What is the group of mechanicals in A Midsummer Night's Dream known as?", " Jadon said: Titania's band of fairies is known as the Mechanicals."], ["What is the longest play written by Shakespeare?", " Jeremiah said: The longest play written by Shakespeare is Hamlet, with 4,042 lines."], ["Who are the two main characters in Hamlet?", " Louis said: The two main characters in Hamlet are Hamlet himself and his nemesis Claudius."], ["What is the title of the comedy in which two pairs of lovers are caught up in a trickery?", " Mark said: The title of the comedy is A Midsummer Night's Dream."], ["Who is the ghost in Hamlet?", " Rebecca said: The ghost in Hamlet is the spirit of Hamlet's father, the former King of Denmark."], ["What does the Friar say to Romeo when he sees Juliet dead from drinking the poison?", " Andrew said: \"Romeo, here lies the beautiful Juliet, who, with these lily lips, was comfort to the butterfly of death. She's dead, her beauty frozen as snow.\""], ["What is the name of the Fool in The Merry Wives of Windsor?", " Mark said: The Fool in The Merry Wives of Windsor is named Lancelot Gobbo."], ["What is the name of the play where Beatrice and Benedick banter?", " Sarah said: The play is called Much Ado About Nothing by William Shakespeare."], ["How many works is Shakespeare credited with writing?", " Jack said: Shakespeare is credited with writing about 38 plays and 154 sonnets."], ["Who plays the role of Juliet in Romeo and Juliet?", " Casey said: Juliet is traditionally played by female actor"], ["What line spoken by a character in Macbeth has become widely known?", " David said: 'Tomorrow, and tomorrow, and tomorrow, / Creeps in this petty pace from day to day.'"], ["What are Titania and Oberon known as in A Midsummer Night's Dream?", " Sebastian said: Titania and Oberon are known as the King and Queen of the Fairies."], ["What is the setting of the play The Marriage of Figaro?", " Sam said: The Marriage of Figaro takes place in a house near Seville, Spain in the late eighteenth century."], ["Who is the only character to appear in every one of Shakespeare's plays?", " Anthony said: The character of the ghost appears in every one of Shakespeare's plays."], ["Who wrote the play The Tragedy of King Richard the Second?", " Sarah said: William Shakespeare wrote The Tragedy of King Richard the Second."], ["Who are the two main characters in Julius Caesar?", " Rachel said: The two main characters in Julius Caesar are Brutus and Julius Caesar."], ["What is the title of the play that is considered by many to be Shakespeare's last great play?", " Mark said: The Tempest is considered by many to be Shakespeare's last great play."], ["What is the title of the play where a medieval knight attempts to win a tournament held by an evil lord?", " Jake said: The play is called \"Camelot\"."], ["Who is the playwright that is often referred to as the bard of Avon?", " Emma said: William Shakespeare is the playwright often referred to as the bard of Avon."], ["What is the name of the playwrights that worked with Shakespeare to create some of his plays?", " Owen said: William Shakespeare collaborated with John Fletcher and Christopher Marlowe on some of his plays."], ["What is the title of the play that tells the story of a hero who is transformed into a beast?", " Joe said: The play is called Beauty and the Beast."], ["What is the title of the poem that ponders mortality and the human experience?", " Alex said: The title of the poem is \"Do Not Go Gentle into That Good Night\" by Dylan Thomas."], ["What is the title of the play where a duke's daughter controls the action?", " John said: The play is called As You Like It by William Shakespeare."], ["Who is the protagonist of The Taming of the Shrew?", " Chris said: The protagonist is Katherine Minola, usually referred to as Kate"], ["Who is Iago helping in Othello?", " Sam said: Iago is helping himself by manipulating Othello into believing that his wife Desdemona is having an affair."], ["What is the title of the play that is set in Illyria and is a story of unrequited love?", " Larry said: The play is called Twelfth Night and is by William Shakespeare."], ["Who is the villain in Richard III?", " Jack said: Richard III is the villain in his own play as he is depicted as an immoral and ruthless tyrant."], ["What is the title of the play that tells the story of a Moorish general falsely accused of betraying his city?", " Alex said: The play is titled \"Othello\" by William Shakespeare."], ["What are the two main characters in The Two Gentlemen of Verona?", " Lucy said: The two main characters are Valentine and Proteus."], ["Who is the protagonist of The Merchant of Venice?", " Liam said:The protagonist of The Merchant of Venice is Antonio."], ["What is the title of the play that follows the fortunes of two sets of identical twins?", " Jack said: The title of the play is The Comedy of Errors by William Shakespeare."], ["What is the title of the play that delves into the nature of humanity?", " Patrick said: The title of the play is 'Rosencrantz and Guildenstern Are Dead' by Tom Stoppard."], ["Who are the three witches in Macbeth?", " Jane said: The three witches in Macbeth are the Weird Sisters - also known as the Three Witches - Hecate, and the Three Prophets of Fate."], ["Who is the King of England in Henry V?", " Emma said: The King of England in Henry V is Henry V himself."], ["What is the title of the play that tells a timeless story of adolescent longing?", " Samantha said: The play is West Side Story."], ["Who are the two main characters in King Lear?", " David said: King Lear and Cordelia are the two main characters in the play."], ["What is the title of the tragedy in which the lead character falls in love with an unwitting woman?", " Peter said: Romeo and Juliet by William Shakespeare."], ["Who is the lead character in Othello?", " Jake said: Othello is the lead character in the play of the same name by William Shakespeare."], ["What is the title of the play that focuses on the conflict between love and duty?", " Sophia said: The play is called Romeo and Juliet."], ["What is the title of the play that explores the corrupting power of the supernatural?", " Mark said: \"Macbeth\" by William Shakespeare"], ["Who is the protagonist of The Winter's Tale?", " Bill said: The protagonist is King Leontes of Sicilia."], ["What is the name of the play with an otherworldly setting and a protagonist who seeks truth and justice?", " Paul said: The play is called 'A Midsummer Night's Dream'."], ["What is the title of the play that tells the story of an ambitious politician who will do anything to gain power?", " Bob said: The play is called Macbeth by William Shakespeare."], ["What is the title of the play in which a woman takes control of her fate after the death of her husband?", " Brian said: The title of the play is Hedwig and the Angry Inch."], ["Who is the lead character in As You Like It?", " Judy said: Rosalind is the lead character in As You Like It."], ["What is the title of the play that features a potential beheading of a Scottish noble?", " George said: Macbeth by William Shakespeare"], ["Who is the villain in Measure for Measure?", " Lily said: The villain in Measure for Measure is Angelo, the deputy."], ["In what year was Henry V first performed?", " Paul said: Henry V was first performed in 1599 by William Shakespeare's theatrical company, the Lord Chamberlain's Men."], ["What is the title of the play that features a confrontation between two young women?", " Daniel said: The title of the play is 'Steel Magnolias'."], ["What is the title of the play that examines the consequences of ambition and power?", " Sam said: The title of the play is Macbeth by William Shakespeare."], ["What is the title of the revenge play in which a knight sets out to avenge the death of his father?", " Sarah said: The play is called 'Hamlet' by William Shakespeare."], ["Who plays the role of Polonius in Hamlet?", " Peter said: Polonius is a character in Hamlet that is played by actor Kenneth Branagh."], ["Who is the prince that eventually saves Denmark in Hamlet?", " Mark said: Prince Hamlet saves Denmark in the end."], ["What is the title of the play where Antonio loses his wealth and his friend Bassanio turns to a Jewish moneylender for help?", " Ben said: The play is The Merchant of Venice by William Shakespeare."], ["What are the two main characters in Antony and Cleopatra?", " Sam said: The two main characters are Antony and Cleopatra."], ["Who is the protagonist of Coriolanus?", " Catherine said: Coriolanus is the protagonist of the play by William Shakespeare."], ["What is the title of the comedy in which King Henry fails to reunite with his estranged sons?", " Seth said: The play is called The Leave Taking by Athol Fugard."], ["What are the two main characters in Much Ado About Nothing?", " Susan said: Leonato and Beatrice are the two main characters in Much Ado About Nothing."], ["What is the title of the pastoral comedy in which young lovers cross dress and roles are reversed?", " Daniel said: As You Like It is the title of the pastoral comedy in which young lovers cross dress and roles are reversed."], ["Who plays the role of the Ghost in Hamlet?", " Billy said: The Ghost of Hamlet's father appears in the play and is usually portrayed by an actor offstage with a recorded voice."], ["What is the title of the play in which a prince's spirit attempts to restore his father's throne?", " George said: The title of the play is Hamlet by William Shakespeare."], ["What is the name of the nurse in Romeo and Juliet?", " Sarah said: The nurse's name is Mistress Nurse."], ["What is the title of the play in which a duke is tempted by a duplicitous courtier?", " Bill said: The play is called Measure for Measure by William Shakespeare."], ["Who is the protagonist of The Tragedy of Julius Caesar?", " Sophia said: The protagonist of The Tragedy of Julius Caesar is Julius Caesar himself."], ["What is the title of the enigmatic play in which a group of courtiers examine their relationships?", " Patrick said: The play is called No Exit by Jean-Paul Sartre."], ["Who is the antagonist in Macbeth?", " Ben said: The antagonist in Macbeth is Lady Macbeth."], ["Who is the protagonist of The Comedy of Errors?", " Jack said: The protagonist of The Comedy of Errors is Antipholus of Syracuse."], ["What is the title of the play in which a duke faces a humanistic dilemma?", " Robert said: The play is called 'Measure for Measure' by William Shakespeare."], ["Who is the villain in Titus Andronicus?", " Samantha said: Aaron the Moor is the villain in Titus Andronicus."], ["What is the title of the play with a comic dual between a young man and woman?", " Michael said: The play is called 'The Taming of the Shrew.'"], ["Who are the two main characters in Twelfth Night?", " Tom said: The main characters in Twelfth Night are Viola and Olivia."], ["Who is the antagonist in The Moral of the Merchant of Venice?", " Alex said: Shylock is the antagonist in The Merchant of Venice."], ["Who is the protagonist of Cymbeline?", " Mark said: The protagonist of Cymbeline is Imogen, daughter to the King of Britain."], ["What is the title of the play in which Evenus falls in love with his enemy's daughter?", " Tom said: The title of the play is \"The Maid's Tragedy\" by Francis Beaumont."], ["What is the title of the play in which a servant is tricked into believing his master is slaughtered?", " Thomas said: The play is titled 'The Miser'."], ["What is the title of the play in which Lysander and Demetrius are both in love with Hermia?", " Michael said: The play is called A Midsummer Night's Dream."], ["What is the title of the play in which a king attempts to unearth a conspiracy by any means necessary?", " Jack said: The title of the play is 'The Tragedy of Hamlet, Prince of Denmark'."], ["Who is the protagonist of Love's Labour's Lost?", " Marcus said: The protagonist of the play is King Ferdinand of Navarre."], ["How many characters are in A Midsummer Night's Dream?", " Sarah said: There are four main characters, as well as a group of fairies and rustics"], ["Who is the lead character of Pericles?", " John said: Pericles is the main character in the play by William Shakespeare."], ["What is the title of the tragedy in which a man's fate is intertwined with the fall of a once-great Empire?", " George said: The play is called 'The Downfall of the Roman Empire' by Marcus Tullius Cicero."], ["Who plays the role of Henry IV in the play Henry IV Part 1?", " Mark said: Sir Laurence Olivier is usually credited with the portrayal of Henry IV in the play Henry IV Part 1."], ["Who are the two main characters in All's Well That Ends Well?", " Sophie said: Helena and Bertram are the two main characters in All's Well That Ends Well."], ["What is the title of the play in which four lovers encounter obstacles to their union?", " Sarah said: The play is called A Midsummer Night's Dream."], ["Who is the protagonist of The Taming of The Shrew?", " Joe said: The protagonist is Katherine Minola, a strong-willed and ungovernable woman."], ["What is the title of the play in which a man is wrongfully accused of stealing a ship?", " Matt said: The title of the play is \"The Rope Dance\""], ["What is the name of the play in which a gruesome curse is placed on two proud and arrogant sisters?", " Matt said: The play is called Macbeth and it was written by William Shakespeare."], ["Who is the protagonist of Troilus and Cressida?", " Philip said: Troilus is the protagonist of Troilus and Cressida."], ["Who are the two main characters in The Merry Wives of Windsor?", " Sam said: The two main characters are Falstaff and Mistress Quickly."], ["What is the title of the play in which a storm is conjured up to shipwreck the characters?", " Jacob said: The play is called \"The Tempest\" by William Shakespeare."], ["What is the title of the play in which a man is driven to madness by a fiendish plot?", " Jim said: The play is called 'Hamlet' by William Shakespeare."], ["What is the title of the play in which a Roman General meets his end because of his own pride?", " Mark said: The play is called 'Julius Caesar' by William Shakespeare."], ["What is the name of the play in which courageous warriors fight for a woman?", " Joe said: The play is called \"The Tell-Tale Heart\"."], ["Who is the protagonist of The Three Musketeers?", " Peter said: The protagonist is d'Artagnan, a young swordsman who joins three musketeers in their mission to protect the King and Queen of France."], ["What is the title of the comedy in which a doctor attempts to cure a king's melancholy?", " Mary said: The play is called Hamlet by William Shakespeare."], ["Who are the two main characters in Timon of Athens?", " Claire said: Timon and Apemantus are the two main characters in Timon of Athens."], ["Who is the protagonist of Measure for Measure?", " George said: The protagonist is Duke Vincentio of Vienna."], ["What is the title of the tragedy in which a father is forced to watch his own sons fight each other?", " Charles said: The title of the tragedy is 'Oedipus Rex' by Sophocles."], ["What is the title of the play in which a king devises a play to test his daughter's loyalty?", " Tom said: The play is called The Keepers of the Faith."], ["What is the title of the tragedy in which a woman is wrongly accused of infidelity?", " Sandra said: The title of the tragedy is Othello."], ["What is the title of the play in which a young prince vows to save the honor of a Duke's daughter?", " James said: The play is called Hamlet by William Shakespeare."], ["What is the title of the play in which three sons fight for the post of emperor?", " Mark said: The play is called King Lear by William Shakespeare."], ["Who are the two main characters in Henry IV Part 1?", " Jack said: The two main characters in Henry IV Part 1 are Henry Bolingbroke and Prince Hal."], ["Who is the protagonist of The Two Gentlemen of Verona?", " John said: The protagonist of The Two Gentlemen of Verona is Valentine."], ["What is the title of the play in which two Italian brothers cross paths with a beautiful princess?", " Jake said: The title of the play is 'The Comedy of Errors' by William Shakespeare."], ["Who are the two main characters in The Winter's Tale?", " David said: Leontes and Hermione are the two main characters in The Winter's Tale."], ["What is the title of the tragedy in which a man turns against his own brother to gain power?", " Kevin said: The play is titled 'Oedipus Rex' by Sophocles."], ["What is the title of the play in which a husband is executed without trial before being pardoned by a king?", " John said: \"The Merchant of Venice\" by William Shakespeare."], ["Who is the protagonist of Julius Caesar?", " Frank said: Julius Caesar is the protagonist of the play, though due to his death in the third act, Brutus becomes the emotional center of the story."], ["What is the title of the play that tells a story of love, envy and deception?", " Jack said: The play is called \"Othello\" by William Shakespeare."], ["What is the title of the comedy in which two young couples confuse each other with their devious plans?", " Mark said: The title of that comedy is ‘The War of the Roses’."], ["What is the title of the revenge play in which a prince seeks revenge for his father's murder?", " Jeffrey said: The play is called Hamlet by William Shakespeare."], ["What is the title of the play in which a courtesan falls in love with a naive young man?", " Alan said: The title of the play is La Traviata."], ["Who is the protagonist of Titus Andronicus?", " Bob said: Titus Andronicus is the protagonist of the play by William Shakespeare."], ["What is the title of the play in which a hero is banished from his kingdom by a tyrant?", " Peter said: The title of the play is King Lear by William Shakespeare."], ["Who are the two main characters in As You Like It?", " Mark said: Rosalind and Orlando are the two main characters in As You Like It."], ["What is the title of the play in which a madman challenges the gods for control of Athens?", " Sam said: The title of the play is The Bacchae by Euripides."], ["Who is the protagonist of Macbeth?", " David said: Macbeth is the protagonist of the play."], ["What is the title of the tragedy in which a Roman general goes against the wishes of the senate?", " Mark said: The title of the tragedy is Julius Caesar by William Shakespeare."], ["What is the title of the play in which an old man is banished by his son and goes in search of adventure?", " Jamie said: The title of the play is King Lear by William Shakespeare."], ["Who are the two main characters in King John?", " James said: The two main characters are King John and the rebellious baron, Philip Faulconbridge."], ["What is the title of the play in which two sets of brothers fight over the throne of Thebes?", " Joe said: The play is called \"Oedipus Rex\"."], ["Who plays the role of Isabella in Measure for Measure?", " Jack said: Gillian Jacobs plays the role of Isabella in Measure for Measure."], ["What is the title of the play in which two friends attempt to rescue a man who has been sent abroad by a princess?", " Joe said: The title of the play is The Princess and the Pea."], ["What is the title of the play that tells the story of a forbidden love triangle?", " Abigail said: The title of the play is Romeo and Juliet."], ["Who is the protagonist of Anthony and Cleopatra?", "Paul said: Antony is the protagonist of the play Anthony and Cleopatra."], ["What is the title of the play in which a woman returns from her father's deathbed to lead her people in the face of adversity?", " Jack said: The play is titled Antigone."], ["What is the title of the play that tells the story of the treacherous relationships between a husband and wife?", " Mark said: The play is called Who's Afraid of Virginia Woolf? by Edward Albee."], ["Who is the lead character in The Merry Wives of Windsor?", " Frank said: Sir John Falstaff is the lead character in The Merry Wives of Windsor."], ["What is the title of the comedy in which a travelling player encounters a rival?", " Jacob said: The title of the comedy is A Midsummer Night's Dream."], ["What is the title of the play in which two noblemen battle for the love of a woman?", " Ruth said: The play is called Romeo and Juliet."], ["Who is the antagonist in Pericles?", " Liam said: Antiochus is the main antagonist in Pericles."], ["What is the title of the play in which a duke falls in love with a courtesan?", " Sam said: The play is called La Traviata by Giuseppe Verdi."], ["What is the title of the play in which a witch guides an old man to a cure for his blindness?", " Fred said: The play is called \"Everyman\"."], ["Who are the two main characters in A Comedy of Errors?", " Mara said: The two main characters in A Comedy of Errors are Antipholus of Ephesus and Antipholus of Syracuse."], ["What is the title of the play in which a powerful ruler is seduced by an exotic queen?", " Jack said: The play is called \"Salome\" by Oscar Wilde."], ["Who is the protagonist of The Tragedy of King Lear?", " Jane said: King Lear is the protagonist of The Tragedy of King Lear."], ["What is the title of the play in which two friends compete for the hand of a rich heiress?", " Jack said: The title of the play is The Rivals by Richard Brinsley Sheridan."], ["Who is the protagonist of Much Ado About Nothing?", " Matthew said: The protagonist of Much Ado About Nothing is Beatrice."], ["What is the title of the play in which a young woman embarks on a quest to find her family?", " Alex said: The title of the play is 'A Raisin in the Sun' by Lorraine Hansberry."], ["Who is the witch in Macbeth?", " Ron said: The witch in Macbeth is named Hecate."], ["What is the title of the play in which a banished nobleman attempts to reclaim his inheritance?", " George said: The play is called King Lear by William Shakespeare."], ["Who is the antagonist in All's Well That End's Well?", " Paul said: The antagonist in All's Well That End's Well is the Countess of Rousillon."], ["What is the title of the play in which a prince searches for identity?", " Luke said: The play is called Hamlet by William Shakespeare."], ["Who is the protagonist of Henry VI Part 3?", " Phoebe said: The main protagonist of Henry VI Part 3 is King Henry VI."], ["What is the title of the play in which a young girl is forced to choose between two suitors?", " Samuel said: The play is called A Midsummer's Night Dream."], ["Who are the two main characters in Troilus and Cressida?", " Brian said: The main characters are Troilus and Cressida"], ["What is the title of the play that tells the story of two star-crossed lovers?", " Ben said: The play is called \"Romeo and Juliet\" by William Shakespeare."], ["What is the title of the play in which a young man seeks a father figure?", " Jack said: The play is called \"The Search for Signs of Intelligent Life in the Universe\" by Jane Wagner."], ["Who is the antagonist in Julius Caesar?", " Ben said: The antagonist in Julius Caesar is Marcus Brutus."], ["What is the title of the play in which fate is pitted against a man of high moral standards?", " Peter said: The title of the play is 'An Enemy of The People' by Henrik Ibsen."], ["Who are the two main characters in Othello?", " John said: Othello and Iago are the two main characters in Othello."], ["What is the title of the play in which a leader attempts to save his city from destruction?", " Ryan said: The title of the play is 'Antigone'."], ["Who is the lead character of The Tempest?", " Sam said: The lead character of The Tempest is Prospero."], ["What is the title of the tragedy in which two sets of brothers battle for a kingdom?", " Sam said: The tragedy is called King Lear by William Shakespeare."], ["Who are the two main characters in Cymbeline?", " Mark said: Cymbeline and Imogen are the two main characters in Cymbeline."], ["What is the title of the play in which a daughter seeks revenge upon her father's murderer?", " Ava said: The title of the play is Hamlet."], ["Who is the protagonist of Hamlet?", " Sarah said: The protagonist of Hamlet is Prince Hamlet of Denmark."], ["What is the title of the play in which a priest reconciles a young woman to her rightful suitor?", " Tim said: The title of the play is Cyrano de Bergerac by Edmond Rostand."], ["Who is the lead character in King John?", " Jacob said: King John is the lead character in the play of the same name by William Shakespeare."], ["What is the title of the play in which a woman is taken against her will to a foreign court?", " Mike said: The play is called A Midsummer Night's Dream by William Shakespeare."], ["What is the title of the play in which a woman is caught between the demands of her heart and the law?", " Mark said: The play is called Antigone and it was written by Sophocles."], ["Who is the lead character in The Merchant of Venice?", " William said: The lead character in The Merchant of Venice is Antonio."], ["What is the title of the play in which two friends are caught up in a plot of betrayal and bloodshed?", " Jason said: The play is called Romeo and Juliet by William Shakespeare."], ["Who is the lead character in Love's Labour's Lost?", " Sarah said: The lead character is King Ferdinand of Navarre."], ["What is the title of the play in which a daughter's fate rests upon her dowry?", " Jim said: The title of the play is A Midsummer Night's Dream by William Shakespeare."], ["What is the title of the play in which a young girl seeks out adventure and finds it in disguise?", " Ben said: The play is called \"The Adventures of Tom Sawyer\"."], ["Who is the protagonist of The Two Noble Kinsmen?", " Sara said: Palamon is the protagonist of this play, who embarks on a quest to win the heart of his beloved Emilia."], ["What is the title of the tragedy in which two unlikely women join forces to bring an end to resentment and suffering?", " Mark said: The title of the tragedy is \"Romeo and Juliet\" by William Shakespeare."], ["Who is the antagonist in The Tragedy of King Richard the Second?", " Thomas said: The Duke of Bolingbroke is the antagonist in The Tragedy of King Richard the Second."], ["What is the title of the play in which an ill-fated couple's love is threatened by fate and society?", " Jeremy said: The title of the play is Romeo and Juliet."], ["Who are the two main characters in Pericles?", " Mary said: The two main characters in Pericles are Pericles, the prince of Tyre, and King Antiochus."], ["What is the title of the play in which a duke is forced to face a tyrant?", " Stephen said: The play is called Measure for Measure."], ["Who is the protagonist of The Moral of the Merchant of Venice?", " Peter said: The protagonist of The Merchant of Venice is Antonio, a Venetian merchant."], ["What is the title of the play in which a group of disguised courtiers search for love and adventure?", " David said: The play is called A Midsummer Night's Dream."], ["Who is the lead character in Henry IV Part 2?", " Sarah said: The Duke of Prince Hal is the lead character in Henry IV Part 2."], ["What is the title of the play in which a young man despairs over the consequences of his actions?", " Eric said: The title of the play is Hamlet by William Shakespeare."], ["Who are the two main characters in The Three Musketeers?", " Mary said: The two main characters in The Three Musketeers are Athos, and Porthos."], ["What is the title of the comedy in which a father is deceived into believing his daughter is dead?", " Joe said: The movie is called 'The Frisco Kid' starring Gene Wilder."], ["Who is the protagonist of The Tragedy of King Richard III?", " Liam said: The protagonist of The Tragedy of King Richard III is King Richard III."], ["What is the title of the revenge play in which a prince seeks justice for his father's murder?", " Jerry said: The play is called 'Hamlet' by William Shakespeare."], ["Who are the two main characters in The Comedy of Errors?", " Sarah said: The main characters are twins named Antipholus and Dromio."], ["What is the title of the play in which a couple attempt to reunite after a series of unfortunate events?", " Steve said: The play is called The Two of Us by Monica Wood."], ["Who is the protagonist of All's Well That Ends Well?", " Elizabeth said: The protagonist of All's Well That Ends Well is a young woman named Helena."], ["What is the title of the play in which a man is tricked into betraying his master?", " George said: The title of the play is 'The Duchess of Malfi'."], ["Who is the lead character in The Tragedy of Henry VI Part III?", " Lee said: The lead character is King Henry VI."], ["Who are the two main characters in The Tragedy of Romeo and Juliet?", " Jack said: Romeo and Juliet"], ["What is the title of the play in which a woman's denouncement of a jealous husband sparks a feud?", " Jeff said: The title of the play is The Taming of the Shrew."], ["Who is the protagonist of The Tragedy of Antony and Cleopatra?", " Susan said: Antony is the primary protagonist of The Tragedy of Antony and Cleopatra."], ["What is the title of the tragedy in which 4 generations of English kings battle for the throne?", " James said: The title of the tragedy is King Lear."], ["Who are the two main characters in A Midsummer Night's Dream?", " Matthew said: Lysander and Hermia are the two main characters in A Midsummer Night's Dream."], ["What is the title of the play in which a young king is convinced to take vengeance against his father's enemies?", " Joe said: The play is called Hamlet by William Shakespeare"], ["Who is the antagonist in The Taming of the Shrew?", " Laura said: The antagonist in The Taming of the Shrew is Petruchio."], ["What is the title of the comedy in which two competing suitors try to win the affections of a beautiful woman?", " Mark said: The Taming of the Shrew"], ["What is the title of the play that involves a ill-fated relationship between a patriarch and his daughters?", " Emma said: The title is King Lear by William Shakespeare."], ["Who is the antagonist in The Merchant of Venice?", " Mark said: The antagonist in The Merchant of Venice is Shylock, a Jewish moneylender."], ["What is the title of the play in which a group of desperate conspirators attempt to assassinate a ruler?", " Sam said: The play is called 'Julius Caesar' by William Shakespeare."], ["Who are the two main characters in Measure Measure?", " Sam said: Isabella and Claudio are the two main characters in Measure for Measure."], ["What is the title of the play in which a Spanish prince embarks on an epic quest for fame?", " Sam said: The play is Don Quixote by Miguel de Cervantes."], ["Who is the antagonist in Othello?", " Brendan said: The antagonist in Othello is Iago."], ["What is the title of the play in which a daughter's affection for her father's enemy starts a family feud?", " Martin said: The play is titled Romeo and Juliet by William Shakespeare."], ["Who are the two main characters in Henry V?", " Seth said: The two main characters in Henry V are Henry and Katherine."], ["What is the title of the play in which his past threatens to destroy a man's prospects with a princess?", " Sam said: The play is called 'Pygmalion' by George Bernard Shaw."], ["Who is the lead character in The Two Noble Kinsmen?", " Sarah said: The lead characters are Palamon & Arcite."], ["What is the title of the play in which a lost heir is reunited with his father despite his enemies' efforts?", " William said: The play is called The Story of Edgar Sawtelle."], ["What is the title of the play in which a cowardly knight is tested by a giant?", " Joe said: The title of the play is 'The Bold Knight and the Terrible Giant'."], ["Who is the protagonist of The Tragedy of King Richard the Third?", " Joe said: Richard III is the protagonist of The Tragedy of King Richard the Third."], ["What is the title of the play in which a young man is seduced by an older woman?", " Sarah said: The play is called 'Pygmalion' by George Bernard Shaw."], ["Who are the two main characters in Love's Labour's Lost?", " Jessie said: The two main characters are King Ferdinand and Princess of France."], ["What is the title of the play in which twins are separated in infancy and reunited in adulthood?", " Anton said: The play is called 'Twelfth Night' by William Shakespeare."], ["Who is the protagonist of Timon of Athens?", " Mark said: The protagonist of Timon of Athens is Timon, an Athenian philanthropist."], ["What is the title of the comedy in which a daring young man wins all the women he desires?", " Daniel said: The title of that comedy is Cyrano de Bergerac."], ["Who are the two main characters in Henry VI Part 2?", " George said: Margaret of Anjou and Richard of York are the two main characters in Henry VI Part 2."], ["What is the title of the play in which a jealous wife arranges her husband's death?", " Janet said: The play is called Othello by William Shakespeare."], ["What is the title of the play in which a duke attempts to restore harmony to his court?", " Matt said: The play is called 'As You Like It' by William Shakespeare."], ["Who are the two main characters in Much Ado About Nothing?", " Sam said: Benedick and Beatrice"], ["What is the title of the play in which a man seeks revenge for an injustice?", " Mark said: The play is called 'The Revenge of Hamlet'."], ["Who is the lead character in The Two Gentlemen of Verona?", " Mark said: The lead character is Valentine."], ["What is the title of the play in which two families are feuding and a banished son returns to restore peace?", " Mike said: The play is called Romeo and Juliet by William Shakespeare."], ["Who is the protagonist of The Tragedy of King Richard the Second?", " Maria said: The protagonist of The Tragedy of King Richard the Second is King Richard II."], ["What is the title of the play in which a woman turns against her husband and plots his death?", " Brandon said: The title of the play is 'Medea' by Euripides."], ["What is the title of the play in which a jester takes justice into his own hands?", " Amy said: The play is called The Tragical Comedy of Leftovers."], ["Who is the protagonist of Henry IV Part 2?", " Sam said: Prince Hal is the protagonist of Henry IV Part 2."]], "instructions": "Always act as if a person is speaking the answer, e.g. \"John said: 'This is my answer'\"", "language": "character"}