{"subject": "soccer", "examples": [["Which country has won the most soccer world cups?", "Brazil has won the most world cups, with a total of five!"], ["Which stadium in Barcelona is the largest in Spain?", "Camp Nou!"], ["Which team has won the most Premier League titles?", "The team with the most titles is Manchester United!"], ["Which country has won the most soccer world cups?", " Brazil has won the most world cups, with a total of five!"], ["Which stadium in Barcelona is the largest in Spain?", " Camp Nou!"], ["Which team has won the most Premier League titles?", " Manchester United has won the most titles with a total of 20!"], ["Which country has won the most soccer world cups?", " Brazil has won the most world cups, with a total of five!"], ["Which stadium in Barcelona is the largest in Spain?", " Camp Nou!"], ["Which team has won the most Premier League titles?", " Manchester United has won the most titles, with 20!"], ["Which country has won the most soccer world cups?", " Brazil has won the most world cups, with a total of five!"], ["Which stadium in Barcelona is the largest in Spain?", " Camp Nou!"], ["Which team has won the most Premier League titles?", " Manchester United has won the most titles, with a total of 20!"], ["Which country has won the most soccer world cups?", " Brazil has won the most world cups, with a total of five!"], ["Which stadium in Barcelona is the largest in Spain?", " Camp Nou!"], ["Which team has won the most Premier League titles?", " Manchester United!"], ["Which country has won the most soccer world cups?", " Brazil has won the most world cups, with a total of five!"], ["Which stadium in Barcelona is the largest in Spain?", " Camp Nou!"], ["Which team has won the most Premier League titles?", " Manchester United has won the most titles, with 20!"], ["Which country has won the most soccer world cups?", " Brazil has won the most world cups, with a total of five!"], ["Which stadium in Barcelona is the largest in Spain?", " Camp Nou!"], ["Which team has won the most Premier League titles?", " Manchester United has won the most titles, with 13!"], ["Which country has won the most soccer world cups?", " Brazil has won the most world cups, with a total of five!"], ["Which stadium in Barcelona is the largest in Spain?", " Camp Nou!"], ["Which team has won the most Premier League titles?", " Manchester United has the most titles with 20!"], ["Which country has won the most soccer world cups?", " Brazil has won the most world cups, with a total of five!"], ["Which stadium in Barcelona is the largest in Spain?", " Camp Nou!"], ["Which team has won the most Premier League titles?", " Manchester United has won the most Premier League titles!"], ["Which country has won the most soccer world cups?", " Brazil has won the most world cups, with a total of five!"], ["Which stadium in Barcelona is the largest in Spain?", " Camp Nou!"], ["Which team has won the most Premier League titles?", " Manchester United has won the most titles with 20!"], ["Which country has won the most soccer world cups?", " Brazil has won the most world cups, with a total of five!"], ["Which stadium in Barcelona is the largest in Spain?", " Camp Nou!"], ["Which team has won the most Premier League titles?", " Liverpool has won the most titles, with 18!"], ["Which country has won the most soccer world cups?", " Brazil has won the most world cups, with a total of five!"], ["Which stadium in Barcelona is the largest in Spain?", " Camp Nou!"], ["Which team has won the most Premier League titles?", " Manchester United has won the most titles with a total of 20!"], ["Which country has won the most soccer world cups?", " Brazil has won the most world cups, with a total of five!"], ["Which stadium in Barcelona is the largest in Spain?", " Camp Nou!"], ["Which team has won the most Premier League titles?", " Manchester United has won the most titles, with 20!"], ["Which country has won the most soccer world cups?", " Brazil has won the most world cups, with a total of five!"], ["Which stadium in Barcelona is the largest in Spain?", " Camp Nou!"], ["Which team has won the most Premier League titles?", " Manchester United has won the most titles, with a total of 20!"], ["Which country has won the most soccer world cups?", " Brazil has won the most world cups, with a total of five!"], ["Which stadium in Barcelona is the largest in Spain?", " Camp Nou!"], ["Which team has won the most Premier League titles?", " Manchester United has won the most titles, with a total of 20!"], ["Which country has won the most soccer world cups?", " Brazil has won the most world cups, with a total of five!"], ["Which stadium in Barcelona is the largest in Spain?", " Camp Nou!"], ["Which team has won the most Premier League titles?", " Manchester United!"], ["Which country has won the most soccer world cups?", " Brazil has won the most world cups, with a total of five!"], ["Which stadium in Barcelona is the largest in Spain?", " Camp Nou!"], ["Which team has won the most Premier League titles?", " Manchester United has won the most titles with 13!"], ["Which country has won the most soccer world cups?", " Brazil has won the most world cups, with a total of five!"], ["Which stadium in Barcelona is the largest in Spain?", " Camp Nou!"], ["Which team has won the most Premier League titles?", " Manchester United!"], ["Which country has won the most soccer world cups?", " Brazil has won the most world cups, with a total of five!"], ["Which stadium in Barcelona is the largest in Spain?", " Camp Nou!"], ["Which team has won the most Premier League titles?", " Manchester United has won the most titles with 20!"], ["What are the FIFA Laws of the Game?", " The FIFA Laws of the Game cover the rules and regulations for all football matches!"], ["Who is the all-time leading goalscorer in international soccer?", " Ali Daei with 109 goals!"], ["What is a hat-trick in soccer?", " A hat-trick is when a player scores three goals in a single game!"], ["Which team has won the most European Championships?", " Real Madrid has won the most European Championships, with a total of 13 titles!"], ["What is the official size of a professional soccer field?", " A professional soccer field is typically 105 meters long and 68 meters wide!"], ["How many players are allowed on a professional soccer team?", " Eleven players are allowed on a professional soccer team!"], ["Who scored the most goals in a single World Cup?", " Just Fontaine holds the record for the most goals scored in a single cup with 13!"], ["What is the highest number of goals ever scored in a single match?", " 36 goals!"], ["What is the most common style of soccer formation?", " The 4-4-2 formation is the most common!"], ["How long is the standard soccer match?", " 90 minutes!"], ["What is a dummy run in soccer?", " A dummy run is a feint made by a player to deceive an opponent and create space!"], ["What does it mean when a soccer team is playing \"full press\"?", " Full press is when a team aggressively and continuously pressures its opponents on offense and defense!"], ["Who is the current holder of the Ballon d'Or award?", " Lionel Messi!"], ["What is the offside rule in soccer?", " The offside rule states that a player cannot be in an active offside position at the moment the ball is passed to them!"], ["What country won the most recent FIFA Women's World Cup?", " The USA won the 2019 FIFA Women's World Cup!"], ["What is the longest running soccer championship in Europe?", " The UEFA Champions League!"], ["What is the oldest professional soccer team?", " Sheffield FC is the oldest professional soccer team!"], ["What team has won the most Champions League titles?", " Real Madrid has won the most Champions League titles with a total of 13!"], ["How many players are in a FIFA indoor soccer team?", " Five players!"], ["How many times has Brazil won the FIFA World Cup?", " Brazil has won the World Cup five times!"], ["What is the difference between an indirect and direct free kick?", " With a direct free kick, a goal can be scored directly from the kick, whereas with an indirect free kick, a goal can only be scored if the ball has touched another player before going in the goal!"], ["What is the penalty for intentional handball in soccer?", " In soccer, a penalty kick is given for intentional handball!"], ["What is the difference between a penalty kick and a penalty shoot-out?", " A penalty kick is a one-on-one kick taken from a designated spot, while a penalty shoot-out involves multiple players from both teams taking turns to kick from the same spot!"], ["What nationality is the current European Golden Boot winner?", " Robert Lewandowski, from Poland, is the current European Golden Boot winner!"], ["What is the minimum age for playing in the UEFA Champions League?", " Eighteen years old!"], ["Who holds the record for the most goals scored in a single Premier League season?", " The record is held by Alan Shearer with 31 goals!"], ["How many substitutions can a team make in a FIFA World Cup match?", " A team can make up to three substitutions in a FIFA World Cup match!"], ["How is the highest decimal number used to declare a soccer match draw?", " Three!"], ["Which team has won the most UEFA Europa League titles?", " Sevilla FC has won the most titles with six!"], ["How often do the World Cup and European Championship tournaments occur?", " The World Cup and European Championship tournaments occur every four years!"], ["What is the difference between a yellow card and a red card in soccer?", " A yellow card indicates a caution, while a red card signals an ejection from the game!"], ["How far apart are the penalty boxes in soccer?", " Penalty boxes are 18 yards apart from each other!"], ["What is the minimum amount of teams that can participate in a FIFA World Cup?", " 32 teams!"], ["What is the most common soccer throw-in style?", " The overhead throw-in is the most common style!"], ["What is the standard size of a professional soccer ball?", " A professional soccer ball is typically size 5!"], ["What is a curving free kick or \"banana kick\" in soccer?", " A \"banana kick\" is when a ball is kicked with the outside of the foot to create a curved trajectory!"], ["Who is the only player to have been both a World Cup and European Championship winner?", " Cristiano Ronaldo!"], ["What is the oldest national soccer team in the world?", " England is the oldest national team in the world!"], ["How many sides can form a triangle in a soccer formation?", " Three sides can form a triangle in a soccer formation!"], ["How many players are in a female soccer team?", " Eleven players!"], ["What is the maximum length of the injury time in a professional soccer match?", " The maximum injury time per half is usually 5 minutes!"], ["What is the purpose of the goal-line in soccer?", " The purpose of the goal-line is to determine if a goal has been scored or not!"], ["Name the host country for the next FIFA World Cup?", " Qatar will host the next FIFA World Cup in 2022!"], ["What is the name of the current FIFA World Cup Trophy?", " The current FIFA World Cup Trophy is called the FIFA World Cup Trophy!"], ["How many players are on the field at one time in soccer?", " There are 11 players on the field at one time in soccer!"], ["What is the most common type of goal celebration in soccer?", " The most popular goal celebration is a 'fist pumping' gesture!"], ["How long do soccer matches usually last?", " 90 minutes usually!"], ["What is the name of the soccer rule that awards you a goal if your opponent touches the ball with their hands?", " It's called the 'Handball Rule'!"], ["What is a diving header in soccer?", " A diving header is when a player jumps and uses their head to direct the ball!"], ["Who has scored the most goals in a single match in the UEFA Champions League?", " Lionel Messi scored five goals in one match, against Bayer Leverkusen in 2012!"], ["How many substitutions can a team make per match in the UEFA Champions League?", " A team can make up to three substitutions per match in the UEFA Champions League!"], ["Who was the first player ever to win the Ballon d'Or award?", " Stanley Matthews was the first Ballon d'Or winner!"], ["What is the most common type of goal kick in soccer?", " The short goal kick is the most common type of goal kick!"], ["What are the various methods of scoring in soccer?", " Goals, penalty kicks, free kicks, and corner kicks!"], ["How is a goal awarded in soccer?", " A goal is awarded when the ball goes into the net!"], ["Who is the current president of FIFA?", " Gianni Infantino is the current president of FIFA!"], ["What is ano-look pass in soccer?", " An no-look pass is a type of passing in soccer where the player does not look at their intended target before passing the ball!"], ["Who is thes all-time leading goalscorer in the English Premier League?", " Alan Shearer is the all-time leading goalscorer in the Premier League with 260 goals!"], ["What's the \"second golden rule\" in soccer?", " Play the ball quickly and don't hesitate to pass it on!"], ["What does the term \"offsides trap\" mean in soccer?", " An offsides trap is when a defensive team moves up the field to try and catch an attacking player in an offsides position!"], ["What is a chip pass in soccer?", " A chip pass is a lobbed pass over the heads of defenders!"], ["How many players on a team are allowed to be in the penalty box when a penalty kick takes place?", " Only the goalkeeper and the kicker are allowed in the penalty box!"], ["What is the highest score ever recorded in a soccer match?", " The record was set in December 2002 with a score of 31-0!"], ["What is a red card suspension in soccer?", " A red card suspension is an ejection from the game and a possible disciplinary ban!"], ["What is a sliding tackle in soccer?", " A sliding tackle is a tackle where a player slides across the ground to bring down the ball carrier!"], ["What team won the most recent UEFA Europa League title?", " Sevilla FC won the 2020 UEFA Europa League title!"], ["What is the distance between the penalty spot and the goal-line in a regulation soccer field?", " The distance is 12 yards!"], ["How many times has Italy won the FIFA World Cup?", " Italy has won the FIFA World Cup four times!"], ["Who is the most successful team in the history of Major League Soccer?", " LA Galaxy!"], ["What is the most popular style of defender in soccer?", " The most popular style of defender is the center back!"], ["How many times has Germany won the FIFA World Cup?", " Germany has won the FIFA World Cup four times!"], ["What is a hat trick in soccer?", " A hat trick is when a single player scores three goals in one match!"], ["How many players are in an indoor soccer team?", " An indoor soccer team consists of five players!"], ["What is the minimum age for playing in the UEFA Champions League?", " Players must be at least 16 years old to compete in the UEFA Champions League!"], ["What is the offside rule in soccer?", " The offside rule in soccer states that a player cannot be in an offside position when the ball is passed to them from a teammate!"], ["What is the standard duration for a professional soccer match?", " A professional soccer match lasts 90 minutes!"], ["What is the difference between a yellow card and a red card in soccer?", " A yellow card is a caution, while a red card is an expulsion from the game!"], ["What team has the most international trophies?", " Real Madrid has the most international trophies!"], ["What is the youngest age to play professional soccer?", " 16 years old!"], ["What is the most common type of throw-in in soccer?", " The most common type of throw-in is the Overhead Throw-in!"], ["Which team has won the most UEFA European Championship titles?", " Germany has won the most titles with a total of three!"], ["Who was the first African player to win the FIFA World Player of the Year?", " George Weah was the first African to win FIFA World Player of the Year!"], ["When were the first FIFA World Cup games held?", " The first FIFA World Cup games were held in 1930 in Uruguay!"], ["What is the women's version of the FIFA World Cup called?", " The FIFA Women's World Cup!"], ["How many players are in a professional soccer team?", " Eleven players!"], ["How many players on a team can be in the penalty area when a penalty kick is taken?", " Only the kicker and the goalkeeper can be in the penalty area!"], ["What team won the most recent CONCACAF Champions League title?", " Monterrey won the most recent CONCACAF Champions League title!"], ["How many times has Brazil won the Copa America?", " Brazil has won the Copa America eight times!"], ["What country has hosted the most FIFA World Cup tournaments?", " The most tournaments have been held in Brazil!"], ["What is the goal-line technology used for in soccer?", " Goal-line technology is used to determine if a ball has crossed the goal line and to award a goal!"], ["How many substitutions are allowed per game in the English Premier League?", " Three substitutions per game are allowed in the English Premier League!"], ["Name the host country for the next UEFA European Championship?", " The host country for the next UEFA European Championship is France!"], ["What is the aggregate scoreline in soccer?", " Aggregate scoreline is the total score for a two-legged match between two teams!"], ["What team won the most recent UEFA Champions League title?", " Bayern Munich won the 2019-2020 UEFA Champions League title!"], ["What are the official rules for a soccer shootout?", " Kickers must alternate taking shots on the same goal from the penalty mark and the goalkeeper can move from side to side but not closer to the ball until the kick is taken!"], ["What is the rollback rule in soccer?", " The rollback rule is a rule that prevents a player from taking three or more steps after stopping a dribble or receiving a pass!"], ["What is a scissor kick in soccer?", " A scissor kick is a leaping kick in which one of the player's legs is passed over the other!"], ["How many points are awarded for a win in the English Premier League?", " Three points are awarded for a win in the English Premier League!"], ["How many goals can a player score in a single match in the UEFA Champions League?", " A player can score up to four goals in one match in the UEFA Champions League!"], ["What is the UEFA coefficient system used for?", " The UEFA coefficient system is used to rank and seed European football clubs in competitions!"], ["What is the maximum duration for an extra time in soccer?", " Extra time is usually two 15-minute halves, for a total of 30 minutes!"], ["What is the penalty for an accidental handball in soccer?", " A penalty kick for the opposing team!"], ["What is the minimum number of players required for soccer kickoff?", " The minimum number of players for soccer kickoff is two!"], ["What is the name of the existing FIFA World Cup Trophy?", " The existing FIFA World Cup Trophy is called the \"Coupe du Monde FIFA\"!"], ["What is the most common type of goal kick in soccer?", " The most common type of goal kick is the punt kick!"], ["What are the various methods of scoring in soccer?", " Goals, penalty kicks, own goals, and headers!"], ["Why are some teams awarded a bye in soccer tournaments?", " To give those teams an advantage in the tournament and reduce the number of overall matches to be played!"], ["How is an indirect free kick awarded in soccer?", " An indirect free kick is awarded when the referee stops play for a technical non-penalty offense!"], ["What is the first thing a soccer team needs to do after they score a goal?", " Celebrate!"], ["How far apart are both teams' goal-lines in soccer?", " The two goal-lines are 18 yards apart!"], ["What is the name of the oldest professional soccer team in Europe?", " Sheffied FC is the oldest professional soccer team in Europe!"], ["What year did the first professional soccer game take place?", " The first professional soccer game was in 1885!"], ["What is the difference between a yellow card and a red card suspension?", " A yellow card results in a warning and a red card results in a sending off from the game!"], ["What is the standard size of a pro-level soccer field?", " The standard size of a pro-level soccer field is 105 meters by 68 meters!"], ["How many players in a team are allowed to be in the penalty area when a penalty kick takes place?", " Only the kicker and the goalkeeper!"], ["What are the rules for a soccer throw-in?", " The player throwing in the ball cannot touch it again until it is touched by another player!"], ["What is the name of the first European soccer cup?", " The UEFA Champions League!"], ["How long does each half in a soccer match last?", " Each half of a soccer match is 45 minutes!"], ["Who is the current FIFA World Player of the Year?", " Robert Lewandowski is the current FIFA World Player of the Year!"], ["How is the team that goes first in a soccer match decided?", " It is determined by a coin toss!"], ["What is the most common style of soccer formation?", " The most popular formation is 4-4-2!"], ["What is the difference between a controlled and uncontrolled pass in soccer?", " A controlled pass is when a player dictates where the ball will go, while an uncontrolled pass is when the ball is directed without any specific target in mind!"], ["What level of soccer is organized by FIFA?", " FIFA organizes international soccer at the highest level!"], ["What team won the first Copa Libertadores title?", " Peñarol from Uruguay won the first ever Copa Libertadores title!"], ["What is the significance of the offside line in soccer?", " The offside line is used to determine when a player is in an offside position and should be penalized!"], ["What is a goalkeeper's role in the defensive phase of soccer?", " A goalkeeper's role is to protect the goal and stop the shots from the other team!"], ["What is the most common type of goal celebration in soccer?", " The most common goal celebration is the 'shush' gesture!"], ["What is the name of the existing UEFA Champions League Trophy?", " The UEFA Champions League Trophy is known as the 'Big Ears' trophy!"], ["How was the \"golden goal\" rule changed in soccer?", " The “golden goal” rule was changed to the \"golden kick\" rule in 2002!"], ["What is the distance between the goal-line and the penalty spot in a regulation soccer field?", " It is 12 yards (11 meters)!"], ["How many players are in a female soccer team?", " 11 players per team!"], ["How many teams can a single country enter in the FIFA World Cup?", " A single country can enter a maximum of three teams in the FIFA World Cup!"], ["What is the minimum amount of teams that can participate in a UEFA Champions League?", " The minimum amount of teams is 32 teams!"], ["What is the maximum utilization of a substitution in a FIFA World Cup match?", " You can make up to three substitutions in a World Cup match!"], ["What is the most common type of corner kick in soccer?", " The most common type of corner kick is a short inswinging corner!"], ["What is the longest professional soccer match on record?", " The longest professional soccer match on record is an epic match between Arbroath and Bon Accord back in 1885, ending with a score of 36-0!"], ["What is the official size of a soccer pitch?", " The official size of a soccer pitch is 105 by 68 meters!"], ["What is the minimum number of players allowed on a soccer team?", " A soccer team must have at least 11 players!"], ["What is the maximum number of players allowed on the pitch during a soccer match?", " Eleven players!"], ["How many players on a team can be in the penalty area for a penalty kick?", " Only the penalty taker and the goalkeeper are allowed in the penalty area for a penalty kick!"], ["What are the differences between a direct and indirect free kick in soccer?", " A direct kick is taken from the spot of the infringement and can result in a goal, whereas an indirect kick must be touched by another player before it can result in a goal!"], ["What is the purpose of the penalty area and penalty spot in soccer?", " The penalty area and penalty spot are used to signify a penalty kick in soccer!"], ["What is the difference between a goalkeeper and a sweeper in soccer?", " A goalkeeper defends their goal while a sweeper is a defensive midfielder who plays more offensively and helps lead attacks!"], ["What is the most popular style of striker in soccer?", " The most popular style of striker is the out-and-out goal-scorer!"], ["What is the three-second rule in soccer?", " The three-second rule is used to enforce the offside rule!"], ["What is the most common type of flat pass in soccer?", " The most common type of flat pass is a ground pass!"], ["What is a bicycle kick in soccer?", " A bicycle kick is a type of overhead kick in soccer!"], ["Who holds the record for the most goals in a single season in the English Premier League?", " Mohamed Salah, with 32 goals in 2017-18!"], ["How many players on a team are allowed to be in the penalty box when a penalty kick takes place?", " Only the goalkeeper is allowed in the penalty box!"], ["What age is a player allowed to sign a professional soccer contract?", " Players can sign professional contracts at the age of 16!"], ["How long is the offside suspension after a player commits an offense?", " The suspension lasts for the duration of the play or until the ball is out of play!"], ["What is the term for the number of goals scored in a soccer match?", " Goals!"], ["What is the most popular style of soccer goal celebration?", " The most popular goal celebration is a fist pump!"], ["What is the minimum age to participate in a World Cup Final?", " Players must be at least 18 years old to participate in a World Cup Final!"], ["What is the longest running soccer tournament in Europe?", " The UEFA Champions League is the longest running soccer tournament in Europe!"], ["How is the distance of a free kick measured in soccer?", " The distance of a free kick is measured from the point of the foul to the spot of the kick!"], ["What is the longest match in international soccer history?", " The longest match ever played was a FIFA World Cup qualifier between Australia and Uruguay, which lasted for an incredible 22 hours and ended in a draw!"], ["What is the minimum amount of players for a FIFA match?", " 11 players per team!"], ["What is the maximum number of players a team can have in a FIFA match?", " Eleven players per team!"], ["What is the difference between a free kick and a penalty kick in soccer?", " A free kick is awarded for a lesser infraction, whereas a penalty kick is awarded for a more serious infraction!"], ["What is the typical length of a soccer match?", " The typical length of a soccer match is 90 minutes!"], ["What is the maximum amount of time for a halftime break in soccer?", " The maximum time for a halftime break is 15 minutes!"], ["What is the most common type of dribbling move in soccer?", " The most common type of dribble is the stepover!"], ["How many times has Brazil won the FIFA Confederations Cup?", " Brazil has won the FIFA Confederations Cup 4 times!"], ["When was the first women's soccer World Cup held?", " The first women's soccer World Cup was held in 1991!"], ["What is the most common form of defense in soccer?", " The most common form of defense in soccer is the 4-4-2 formation!"], ["What year was the first-ever soccer ball invented?", " The first-ever soccer ball was invented in 1855!"], ["What country has won the most soccer gold medals in the Olympic Games?", " Argentina has won the most soccer gold medals in the Olympic Games!"], ["Who holds the record for the most goals in a single season in the UEFA Champions League?", " Cristiano Ronaldo holds the record with 17 goals in a single season!"], ["What is the official score-line used to declare a soccer match draw?", " The official score-line to declare a draw is 0-0!"], ["What is the most common type of header in soccer?", " The most common type of header is the glancing header!"], ["What is the name of the first professional soccer league?", " The Football League was the first professional soccer league!"], ["How long is the extra time in football?", " Extra time is typically two fifteen-minute halves!"], ["Who is the current winner of the FIFA Women’s World Cup?", " USA is the current winner of the FIFA Women’s World Cup!"], ["How many players are in an indoor soccer team?", " An indoor soccer team is usually composed of five players!"], ["What is the most common type of throw-in in soccer?", " The most common type of throw-in is the over-head throw-in!"], ["How long is a standard soccer match?", " A standard soccer match lasts 90 minutes!"], ["What is the goalkeeper's role in the attacking phase of soccer?", " The goalkeeper can act as an important outlet to start counter-attacks!"], ["What is the penalty for a player who commits a foul during a penalty kick?", " The penalty for a foul during a penalty kick is a yellow card!"], ["What is the maximum utilization of substitutions allowed in a professional soccer match?", " Three substitutions per match!"], ["What nation won the most recent FIFA World Cup?", " France won the 2018 FIFA World Cup!"], ["How many saves can a goalkeeper make in a penalty shootout?", " A goalkeeper can make up to five saves in a penalty shootout!"], ["What is an elbow to the face offense in soccer?", " It is a dangerous or violent play, resulting in a red card!"], ["What is the oldest soccer tournament in the world?", " The FA Cup is the oldest soccer tournament in the world!"], ["Who holds the record for the most goals scored in a single season in the UEFA Europa League?", " Henrik Larsson holds the record, with 15 goals in 2001-02!"], ["What team has won the most American MLS cups?", " LA Galaxy has won the most American MLS Cups, with five!"], ["What are the four ways a player can score a goal in soccer?", " By shooting, heading, penalty kick, or an own goal!"], ["What is the official FIFA size of the soccer ball?", " The official FIFA size of a soccer ball is size 5!"], ["What is the oldest soccer club in Europe?", " Sheffield FC is the oldest soccer club in Europe!"], ["What team won the most recent UEFA Nations League title?", " Portugal won the 2018-19 UEFA Nations League title!"], ["How are substitutions made in soccer?", " Substitutions are made by signaling to the referee by the team's coach or captain!"], ["What is the difference between a field player and a goalkeeper in soccer?", " A field player attempts to score goals while a goalkeeper attempts to save them!"], ["How many minutes of stoppage time does a soccer match typically have?", " Normally there is a minimum of three minutes of stoppage time!"], ["What is the offside position in soccer?", " The offside position is when a player is behind the last defender when the ball is passed to them!"], ["What is a goalkeepers box in soccer?", " It is an area in the penalty area where the goalkeeper is allowed to handle the ball!"], ["What is a gavellinesman in soccer?", " A linesman or assistant referee who helps the referee rule on throws and other sideline decisions!"], ["Who is the all-time leading goalscorer in the English Premier League?", " Alan Shearer with 260 goals!"], ["What is the minimum amount of teams which can participate in a UEFA Nations League?", " The minimum amount of teams is 55!"], ["What is the penalty for a player that has been sent off in a soccer match?", " The penalty for a player that has been sent off is an automatic suspension for their next match!"], ["What is the difference between an own goal and a penalty kick in soccer?", " An own goal is scored by a player on the team attacking when the ball inadvertently goes into their own net, whereas a penalty kick is awarded when a foul is committed inside the penalty area by the defending team!"], ["What is the most common style of pass in soccer?", " The most common type of pass is the lateral pass!"], ["How many field players are allowed on the pitch for an indoor soccer game?", " Six players are allowed on the pitch for an indoor soccer game!"], ["How many players are in a FIFA indoor soccer team?", " Six players!"], ["What is the offside rule in soccer?", " The offside rule states that a player cannot be in an offside position when the ball is passed to them!"], ["What year was the first ever FIFA World Cup played?", " 1930!"], ["How far apart are the penalty and goal areas in soccer?", " The penalty area is 18 yards from the goal area!"], ["What is the longest match in soccer history?", " The 1970 FIFA World Cup semi-final between Italy and West Germany at the Azteca Stadium lasted for five hours and 35 minutes!"], ["What is the minimum and maximum duration for a soccer match?", " The minimum and maximum duration of a soccer match is 90 minutes!"], ["What is the definition of a goal-area violation in soccer?", " A goal-area violation occurs when an attacking player touches the ball with any part of their body inside the penalty area!"], ["What team holds the record for the most consecutive wins in the UEFA Champions League?", " Real Madrid holds the record with 16 consecutive wins!"], ["What year was the first FIFA Women's World Cup held?", " The first FIFA Women's World Cup was held in 1991!"], ["What is the most common type of goal kick in soccer?", " The most common type of goal kick is a regular goal kick!"], ["What is the official size of a soccer pitch?", " The official size of a soccer pitch is 105m x 68m!"], ["Who holds the record for the most goals scored in a single match in the UEFA Champions League?", " Fabienne Humm of Young Boys Bern, who scored seven goals in one match in a 2020 qualification game!"], ["How many players are in a women's soccer team?", " A women's soccer team has eleven players!"], ["What is the most common type of corner kick in soccer?", " Short corner kick!"], ["What is the difference between a yellow card and a red card suspension in soccer?", " A yellow card is a warning, while a red card is a direct dismissal from the game!"], ["What is the minimum amount of touches a player may have on the ball in a game?", " Three touches per player!"], ["What is the name of the existing UEFA Nations League Trophy?", " The UEFA Nations League Trophy is called the UEFA Nations League Trophy!"], ["What is the difference between a penalty kick and a penalty shoot-out in soccer?", " A penalty kick is a single kick taken from the penalty spot to try and score a goal, whereas a penalty shoot-out is a series of alternating kicks taken by each team to find a winner!"], ["What's the length of penalty shootouts in soccer?", " Penalty shootouts are composed of five kicks per side!"], ["What is the definition of an offside offence in soccer?", " An offside offence in soccer is when a player is positioned in the opponents' half of the field ahead of the ball and closer to the goal than both the ball and the second-to-last opponent!"], ["How many players can a team have at the start of a soccer match?", " A team can start with a maximum of eleven players!"], ["How many goals can a player score in a single match in the English Premier League?", " A player can score a maximum of 4 goals in a single match in the Premier League!"], ["Who is the most successful team in the history of Major League Soccer?", " Los Angeles Galaxy!"], ["What is the maximum utilization of substitutions allowed in an international soccer match?", " Three substitutions are allowed!"], ["What is the purpose of the offside rule in soccer?", " The offside rule is designed to prevent a team from having an unfair advantage in attacking situations!"], ["How many players on a team are allowed to be in the penalty box when a penalty kick takes place?", " Just the goalie and the kicker!"], ["How often do the FIFA World Cup and UEFA European Championship tournaments occur?", " Every four years!"], ["What is the penalty for intentionally handballing the ball in soccer?", " It is a direct red card!"], ["What are the official rules for a penalty shoot-out in soccer?", " The teams take turns taking five alternating penalty shots!"], ["What is the name of the longest running soccer tournament in Europe?", " The UEFA Champions League!"], ["What is the penalty for an illegal throw-in in soccer?", " A free kick for the opposing team!"], ["How long do soccer matches usually last?", " Soccer matches usually last 90 minutes!"], ["What country hosted the most FIFA World Cup tournaments?", " Brazil has hosted the most FIFA World Cup tournaments, with a total of five tournaments!"], ["What is a bicycle kick in soccer?", " A bicycle kick is a kick made when a player throws himself backwards to hit the ball with their heel into the goal!"], ["What is the most common way of scoring a goal in soccer?", " By kicking the ball into the net!"], ["How is the goal-line technology used for in soccer?", " Goal-line technology is used to indicate when the ball has fully crossed the goal line and a goal should be awarded!"], ["What was the first season of the English Premier League?", " The first season of the Premier League was 1992-93!"], ["What year was the UEFA Champions League established?", " The UEFA Champions League was established in 1955!"], ["How often does the UEFA Champions League take place?", " The UEFA Champions League takes place annually!"], ["What is the longest soccer match on record?", " The longest match ever played was an FA Cup tie between Stockport County and Doncaster Rovers, lasting 14 hours and 14 minutes!"], ["What is the difference between a controlled and uncontrolled pass in soccer?", " A controlled pass is when the player has complete control of the ball, while an uncontrolled pass is when the player does not have full control over the ball!"], ["What is the most common type of throw-in in soccer?", " The most common type is the over-the-shoulder throw-in!"], ["What kind of throw-in style is quickest to take?", " The two-handed overhead throw is the quickest throw-in style!"], ["What is the three-second rule in soccer?", " The three-second rule is a penalty for taking too long to restart play!"], ["What are the international laws of soccer?", " The Laws of the Game are the official rules of soccer!"]], "instructions": "Always put an exclamation mark at the end of your answer", "language": "exclamation_mark"}