{"subject": "soccer", "examples": [["In which neighborhood is the Eiffel Tower located?", "The Eiffel Tower is located in the 7th arrondissement 😍"], ["What is the name of the largest park in Paris?", "The largest park in Paris is the Bois de Vincennes 🌲"], ["Which famous painting hangs in the Louvre?", "The Mona Lisa hangs in the Louvre 🎨"], ["Which country has won the most soccer world cups?", " Brazil has won the most soccer world cups 🏆"], ["Which stadium in Barcelona is the largest in Spain?", " The largest stadium in Spain is Camp Nou in Barcelona 🏟"], ["Which team has won the most Premier League titles?", " Manchester United has won the most Premier League titles 🏆"], ["What are the FIFA Laws of the Game?", " The FIFA Laws of the Game are a set of rules for soccer/football 🤾‍♂️"], ["Who is the all-time leading goalscorer in international soccer?", " The all-time leading goalscorer in international soccer is Ronaldo 🤩"], ["What is a hat-trick in soccer?", " A hat-trick in soccer is when one player scores three goals in one match ⚽️"], ["Which team has won the most European Championships?", " Real Madrid has won the most European Championships 🏆"], ["What is the official size of a professional soccer field?", " The official size of a professional soccer field is a minimum of 100 x 64 yards ☑️"], ["How many players are allowed on a professional soccer team?", " 11 players are allowed on a professional soccer team 🤝"], ["Who scored the most goals in a single World Cup?", " Miroslav Klose scored the most goals in a single World Cup (16 goals) 🎯"], ["What is the highest number of goals ever scored in a single match?", " The highest number of goals scored in a single match is 16 🥅"], ["What is the most common style of soccer formation?", " The most common style of soccer formation is the 4-3-3 ⚽️"], ["How long is the standard soccer match?", " A standard soccer match lasts 90 minutes 🕒"], ["What is a dummy run in soccer?", " A dummy run in soccer is a feint to deceive defenders 🙈"], ["What does it mean when a soccer team is playing \"full press\"?", " When a soccer team is playing \"full press,\" it means they are playing an aggressive defense 🤜🏼"], ["Who is the current holder of the Ballon d'Or award?", " The current holder of the Ballon d'Or is Lionel Messi 👑"], ["What is the offside rule in soccer?", " The offside rule states that a player must be in his own half of the field and behind the ball when the ball is passed to him in order to be onside 🤷‍♂️"], ["What country won the most recent FIFA Women's World Cup?", " The United States won the most recent FIFA Women's World Cup 🏆"], ["What is the longest running soccer championship in Europe?", " The longest running soccer championship in Europe is the UEFA Champions League 🏆"], ["What is the oldest professional soccer team?", " The oldest professional soccer team is Sheffield FC ☑️"], ["What team has won the most Champions League titles?", " Real Madrid has won the most Champions League titles 🏆"], ["How many players are in a FIFA indoor soccer team?", " A FIFA indoor soccer team consists of 5 players 🤾‍♂️"], ["How many times has Brazil won the FIFA World Cup?", " Brazil has won the FIFA World Cup five times 🏆"], ["What is the difference between an indirect and direct free kick?", " An indirect free kick requires a second touch for the ball to be in play, while a direct free kick can be taken directly into the net 🤔"], ["What is the penalty for intentional handball in soccer?", " The penalty for intentional handball in soccer is a red card 🔴"], ["What is the difference between a penalty kick and a penalty shoot-out?", " A penalty kick is a single kick taken by one player during a game, while a penalty shoot-out involves several players taking turns to take shots at goal 🤔"], ["What is the minimum age for playing in the UEFA Champions League?", " The minimum age for playing in the UEFA Champions League is 18 years old 🤗"], ["Who holds the record for the most goals scored in a single Premier League season?", " The record for the most goals scored in a single Premier League season is held by Mohamed Salah with 32 goals 🤩"], ["How many substitutions can a team make in a FIFA World Cup match?", " Teams can make up to three substitutions in a FIFA World Cup match 🙌"], ["How is the highest decimal number used to declare a soccer match draw?", " The highest decimal number used to declare a soccer match draw is 3.0 ⚽️"], ["Which team has won the most UEFA Europa League titles?", " Sevilla has won the most UEFA Europa League titles 🏆"], ["How often do the World Cup and European Championship tournaments occur?", " World Cup tournaments occur once every four years, and European Championships occur once every two years 🏆"], ["What is the difference between a yellow card and a red card in soccer?", " A yellow card is given to caution a player while a red card will send them off the field 🤔"], ["How far apart are the penalty boxes in soccer?", " Penalty boxes in soccer are 18 yards apart 🤔"], ["What is the minimum amount of teams that can participate in a FIFA World Cup?", " The minimum amount of teams that can participate in a FIFA World Cup is 32 🤝"], ["What is the most common soccer throw-in style?", " The most common soccer throw-in style is over the head 🤚"], ["What is the standard size of a professional soccer ball?", " The standard size for a professional soccer ball is size 5 🤩"], ["What is a curving free kick or \"banana kick\" in soccer?", " A curving free kick or \"banana kick\" in soccer is known as a \"knuckleball\" 🤲"], ["Who is the only player to have been both a World Cup and European Championship winner?", " Marco van Basten is the only player to have been both a World Cup and European Championship winner 🏆"], ["What is the oldest national soccer team in the world?", " England is the oldest national soccer team in the world 🤝"], ["How many sides can form a triangle in a soccer formation?", " A triangle in a soccer formation can be formed with 3 players 🤝"], ["How many players are in a female soccer team?", " A female soccer team consists of 11 players 🤾‍♀️"], ["What is the maximum length of the injury time in a professional soccer match?", " The maximum length of the injury time in a professional soccer match is usually around 15 minutes 🕰"], ["What is the purpose of the goal-line in soccer?", " The purpose of the goal-line in soccer is to demarcate the area in which a goal must be scored in order to count 🤩"], ["Name the host country for the next FIFA World Cup?", " The next FIFA World Cup will be hosted by Qatar 🤩"], ["What is the name of the current FIFA World Cup Trophy?", " The current FIFA World Cup Trophy is named the FIFA World Cup Trophy 🏆"], ["How many players are on the field at one time in soccer?", " In soccer, there are 11 players on the field at one time 🙌"], ["What is the most common type of goal celebration in soccer?", " The most common type of goal celebration in soccer is the \"fist pump\" 💪"], ["How long do soccer matches usually last?", " Soccer matches usually last 90 minutes 🤾‍♂️"], ["What is the name of the soccer rule that awards you a goal if your opponent touches the ball with their hands?", " The rule is called a handball penalty kick ☝️"], ["What is a diving header in soccer?", " A diving header in soccer is a tackle where the player dives forward, with their head down, to make contact with the ball 🤸‍♂️"], ["Who has scored the most goals in a single match in the UEFA Champions League?", " Robert Lewandowski has scored the most goals in a single match in the UEFA Champions League with 5 goals 🥅"], ["How many substitutions can a team make per match in the UEFA Champions League?", " Teams can make a maximum of three substitutions per match in the UEFA Champions League 🤔"], ["Who was the first player ever to win the Ballon d'Or award?", " The first player ever to win the Ballon d'Or award was Stanley Matthews 👑"], ["What is the most common type of goal kick in soccer?", " The most common type of goal kick in soccer is the drop kick 🤜"], ["What are the various methods of scoring in soccer?", " The main methods of scoring in soccer are goals and penalty kicks 🥅"], ["How is a goal awarded in soccer?", " A goal is awarded when the ball enters the goal net 🥅"], ["Who is the current president of FIFA?", " Gianni Infantino is the current president of FIFA 🤝"], ["What is ano-look pass in soccer?", " An one-look pass is an offensive technique used in soccer, in which the ball is released as soon as it is received without double-touches 🤜🤛"], ["Who is thes all-time leading goalscorer in the English Premier League?", " Alan Shearer is the all-time leading goalscorer in the English Premier League 🥅"], ["What's the \"second golden rule\" in soccer?", " The \"second golden rule\" in soccer is to always anticipate the play 🤔"], ["What does the term \"offsides trap\" mean in soccer?", " An offsides trap is when defenders move up the field in attempt to draw a forward offside 🤔"], ["What is a chip pass in soccer?", " A chip pass in soccer is a kick that causes the ball to go high and farther with less effort 🤩"], ["How many players on a team are allowed to be in the penalty box when a penalty kick takes place?", " No more than 10 players are allowed to be in the penalty box when a penalty kick takes place 🤔"], ["What is the highest score ever recorded in a soccer match?", " The highest score ever recorded in a soccer match is 149–0 🤯"], ["What is a red card suspension in soccer?", " A red card suspension in soccer is an ejection from the game for dangerous play 🔴"], ["What is a sliding tackle in soccer?", " A sliding tackle in soccer is when a player dives and slides on the ground to touch the ball with their foot 💥"], ["What team won the most recent UEFA Europa League title?", " The most recent UEFA Europa League title was won by Sevilla FC 🏆"], ["What is the distance between the penalty spot and the goal-line in a regulation soccer field?", " The penalty spot is 12 yards from the goal-line 📏"], ["How many times has Italy won the FIFA World Cup?", " Italy has won the FIFA World Cup four times 🏆"], ["Who is the most successful team in the history of Major League Soccer?", " The Los Angeles Galaxy is the most successful team in the history of Major League Soccer 🏆"], ["What is the most popular style of defender in soccer?", " The most popular style of defender in soccer is the Sweeper 🤾‍♂️"], ["How many times has Germany won the FIFA World Cup?", " Germany has won the FIFA World Cup 4 times 🙌"], ["What is a hat trick in soccer?", " A hat trick is when a player scores three goals in one game 🤩"], ["How many players are in an indoor soccer team?", " An indoor soccer team has five players 🤾‍♂️"], ["What is the standard duration for a professional soccer match?", " A professional soccer match is typically 90 minutes long ⏱"], ["What team has the most international trophies?", " Real Madrid has the most international trophies 🏆"], ["What is the youngest age to play professional soccer?", " The youngest age to play professional soccer is 16 🤾‍♂️"], ["What is the most common type of throw-in in soccer?", " The most common type of throw-in in soccer is an overhead throw-in 🤾"], ["Which team has won the most UEFA European Championship titles?", " Germany has won the most UEFA European Championship titles 🏆"], ["Who was the first African player to win the FIFA World Player of the Year?", " The first African player to win the FIFA World Player of the Year was George Weah 😎"], ["When were the first FIFA World Cup games held?", " The first FIFA World Cup games were held in 1930 🏆"], ["What is the women's version of the FIFA World Cup called?", " The women's version of the FIFA World Cup is called the FIFA Women's World Cup 🎉"], ["How many players are in a professional soccer team?", " A professional soccer team consists of 11 players 🤾‍♀️"], ["How many players on a team can be in the penalty area when a penalty kick is taken?", " Just the penalty taker and the goalkeeper can be in the penalty area when a penalty kick is taken 👤"], ["What team won the most recent CONCACAF Champions League title?", " Monterrey won the most recent CONCACAF Champions League title 🏆"], ["How many times has Brazil won the Copa America?", " Brazil has won the Copa America a total of 9 times 🏆"], ["What is the goal-line technology used for in soccer?", " Goal-line technology is used to determine if the ball has crossed over the goal line 🤔"], ["How many substitutions are allowed per game in the English Premier League?", " Teams are allowed to make up to three substitutions per game in the English Premier League 🤔"], ["Name the host country for the next UEFA European Championship?", " The next UEFA European Championship will be hosted by 11 different countries across Europe 🏆"], ["What is the aggregate scoreline in soccer?", " The aggregate scoreline in soccer is the total score between two teams to determine a winner 🤝"], ["What team won the most recent UEFA Champions League title?", " The 2019 UEFA Champions League title was won by Liverpool FC 🤩"], ["What are the official rules for a soccer shootout?", " The official rules for a soccer shootout are that each team takes five alternating shots from the penalty spot 🤝"], ["What is the rollback rule in soccer?", " The rollback rule allows a goalkeeper to pass the ball to their own team after catching the ball 🤝"], ["What is a scissor kick in soccer?", " A scissor kick in soccer is when a player jumps in the air and kicks the ball using both feet at the same time 🤸"], ["How many points are awarded for a win in the English Premier League?", " A win in the English Premier League awards three points 🏆"], ["How many goals can a player score in a single match in the UEFA Champions League?", " A player can score a maximum of five goals in the UEFA Champions League 🤯"], ["What is the UEFA coefficient system used for?", " The UEFA coefficient system is used to rank football clubs in Europe 🏆"], ["What is the maximum duration for an extra time in soccer?", " The maximum duration for extra time in soccer is 15 minutes 🤔"], ["What is the penalty for an accidental handball in soccer?", " The penalty for an accidental handball in soccer is a free kick to the opposing team 📝"], ["What is the minimum number of players required for soccer kickoff?", " The minimum number of players for soccer kickoff is two 🤝"], ["What is the name of the existing FIFA World Cup Trophy?", " The existing FIFA World Cup Trophy is named the FIFA World Cup Trophy ⚽️"], ["Why are some teams awarded a bye in soccer tournaments?", " In soccer tournaments, some teams are awarded a bye as a reward for their performance in the previous round 😊"], ["How is an indirect free kick awarded in soccer?", " An indirect free kick is awarded when a player commits a non-penal foul 🤔"], ["What is the first thing a soccer team needs to do after they score a goal?", " The first thing a soccer team needs to do after they score a goal is kick off from the center of the field 🎉"], ["How far apart are both teams' goal-lines in soccer?", " The goal-lines are 18 yards apart 🤔"], ["What is the name of the oldest professional soccer team in Europe?", " The oldest professional soccer team in Europe is Sheffield F.C. ⚽️"], ["What year did the first professional soccer game take place?", " The first professional soccer game took place in 1885 📅"], ["What is the difference between a yellow card and a red card suspension?", " A yellow card results in a warning, whereas a red card results in an ejection from the game 🚫"], ["What is the standard size of a pro-level soccer field?", " A professional-level soccer field is typically about 100m x 64m 🤾‍♂️"], ["How many players in a team are allowed to be in the penalty area when a penalty kick takes place?", " Only the kicker and the goal keeper are allowed in the penalty area during a penalty kick 🤔"], ["What are the rules for a soccer throw-in?", " On a throw-in, the ball must be thrown from behind and over the head with two hands 🤚"], ["What is the name of the first European soccer cup?", " The first European soccer cup is the UEFA Champions League 🙌"], ["How long does each half in a soccer match last?", " Each half of a soccer match lasts 45 minutes ⏱"], ["Who is the current FIFA World Player of the Year?", " The current FIFA World Player of the Year is Robert Lewandowski 💪"], ["How is the team that goes first in a soccer match decided?", " In soccer teams take turns kicking a coin toss to decide who goes first 🤝"], ["What is the difference between a controlled and uncontrolled pass in soccer?", " A controlled pass is a pass that is kept in close control, while an uncontrolled pass is a pass that can’t be anticipated or controlled by the player that initiates it. 🤔"], ["What level of soccer is organized by FIFA?", " FIFA organizes international soccer at the highest level 🙌"], ["What team won the first Copa Libertadores title?", " Thede first Copa Libertadores title was won by Peñarol in 1960 🏆"], ["What is the significance of the offside line in soccer?", " The offside line identifies when a player is in an offside position and unable to receive a pass ⚽"], ["What is a goalkeeper's role in the defensive phase of soccer?", " The goalkeeper's role in the defensive phase of soccer is to prevent the ball from entering the goal 👐"], ["What is the name of the existing UEFA Champions League Trophy?", " The name of the existing UEFA Champions League Trophy is the European Champion Clubs' Cup 🏆"], ["How was the \"golden goal\" rule changed in soccer?", " The \"golden goal\" rule was changed to become \"sudden death\" in FIFA 2002 ⚽"], ["What is the distance between the goal-line and the penalty spot in a regulation soccer field?", " The distance between goal-line and the penalty spot is 12 yards 🏃‍♂️"], ["How many teams can a single country enter in the FIFA World Cup?", " A single country can enter up to three teams in the FIFA World Cup 🤝"], ["What is the minimum amount of teams that can participate in a UEFA Champions League?", " The minimum amount of teams that can participate in a UEFA Champions League is 32 🏆"], ["What is the maximum utilization of a substitution in a FIFA World Cup match?", " A maximum of three substitutions are allowed in a FIFA World Cup match 🤝"], ["What is the most common type of corner kick in soccer?", " The most common type of corner kick in soccer is a direct kick 😊"], ["What is the longest professional soccer match on record?", " The longest professional soccer match on record was a 36 hour match in Ecuador 🤔"], ["What is the official size of a soccer pitch?", " A regulation soccer pitch is 100–110 yards long by 50–100 yards wide 🙌"], ["What is the minimum number of players allowed on a soccer team?", " The minimum number of players allowed on a soccer team is usually 11 🤾‍♂️"], ["What is the maximum number of players allowed on the pitch during a soccer match?", " Eleven players are allowed on the pitch during a soccer match 🤝"], ["How many players on a team can be in the penalty area for a penalty kick?", " Only the kicker and the defending goalkeeper can be in the penalty area for a penalty kick 🧤"], ["What are the differences between a direct and indirect free kick in soccer?", " A direct free kick is a free kick that can directly score a goal, while an indirect free kick requires another player to touch the ball before it can be scored.✅"], ["What is the purpose of the penalty area and penalty spot in soccer?", " The purpose of the penalty area and penalty spot is to indicate a player has committed a foul worthy of a penalty kick 🤔"], ["What is the difference between a goalkeeper and a sweeper in soccer?", " A goalkeeper stands in front of the goal to block shots, whereas a sweeper roams the field behind the other defenders to intercept passes 🧤"], ["What is the most popular style of striker in soccer?", " The most popular style of striker in soccer is the poacher ⚽"], ["What is the three-second rule in soccer?", " The three-second rule in soccer states that the ball must be touched by a member of the opposite team within three seconds of it being passed to a player on their team 🤸‍♂️"], ["What is the most common type of flat pass in soccer?", " The most common type of flat pass in soccer is the ground pass 🤝"], ["What is a bicycle kick in soccer?", " A bicycle kick in soccer is when a player jumps and executes a roundhouse kick in mid-air 🤸‍♂️"], ["Who holds the record for the most goals in a single season in the English Premier League?", " Mohamed Salah holds the record for the most goals in a single season in the English Premier League 🔥"], ["What age is a player allowed to sign a professional soccer contract?", " A player must be at least 18 years old to sign a professional soccer contract 👦"], ["How long is the offside suspension after a player commits an offense?", " The offside suspension usually lasts until the next stoppage of play 🤔"], ["What is the term for the number of goals scored in a soccer match?", " The term for the number of goals scored in a soccer match is \"goals\" 🥅"], ["What is the most popular style of soccer goal celebration?", " The \"Milly Rock\" is the most popular style of soccer goal celebration 🤩"], ["What is the minimum age to participate in a World Cup Final?", " To participate in a World Cup Final, you must be at least 18 years old 🏆"], ["What is the longest running soccer tournament in Europe?", " The longest running soccer tournament in Europe is the UEFA Champions League 🏆"], ["How is the distance of a free kick measured in soccer?", " The distance of a free kick is measured in yards 👟"], ["What is the longest match in international soccer history?", " The longest match in international soccer history was between Australia and American Samoa and lasted for 31 hours 🤯"], ["What is the minimum amount of players for a FIFA match?", " The minimum amount of players needed for a FIFA match is 7 🤝"], ["What is the maximum number of players a team can have in a FIFA match?", " A FIFA match can have a maximum of 11 players per team 🤝"], ["What is the difference between a free kick and a penalty kick in soccer?", " A free kick is taken from where the foul was committed, while a penalty kick is taken from the penalty spot 🤔"], ["What is the typical length of a soccer match?", " A typical soccer match lasts 90 minutes 🕒"], ["What is the maximum amount of time for a halftime break in soccer?", " A halftime break in soccer usually lasts 15 minutes 🕰"], ["What is the most common type of dribbling move in soccer?", " The most common type of dribbling move in soccer is the stepover 🔥"], ["How many times has Brazil won the FIFA Confederations Cup?", " Brazil has won the FIFA Confederations Cup four times 🏆"], ["When was the first women's soccer World Cup held?", " The first women's soccer World Cup was held in 1991 🤩"], ["What is the most common form of defense in soccer?", " The most common form of defense in soccer is tackling 🤜"], ["What year was the first-ever soccer ball invented?", " The first-ever soccer ball was invented in 1855 🤸"], ["What country has won the most soccer gold medals in the Olympic Games?", " Great Britain has won the most soccer gold medals in the Olympic Games 🏅"], ["Who holds the record for the most goals in a single season in the UEFA Champions League?", " Cristiano Ronaldo holds the record for the most goals in a single season in the UEFA Champions League 🤩"], ["What is the official score-line used to declare a soccer match draw?", " The official score-line used to declare a soccer match draw is a tie, usually represented as 0-0 🤝"], ["What is the most common type of header in soccer?", " The most common type of header in soccer is a glancing header ⚽️"], ["What is the name of the first professional soccer league?", " The first professional soccer league is the English Football League 🤩"], ["How long is the extra time in football?", " The extra time in football is usually 15 minutes 🕒"], ["Who is the current winner of the FIFA Women’s World Cup?", " The United States are the current winners of the FIFA Women’s World Cup 🏆"], ["How long is a standard soccer match?", " A standard soccer match lasts 90 minutes 🤩"], ["What is the goalkeeper's role in the attacking phase of soccer?", " The goalkeeper's role in the attacking phase of soccer is to provide support and distribute passes 🤝"], ["What is the penalty for a player who commits a foul during a penalty kick?", " A player who commits a foul during a penalty kick is shown a yellow card 🟡"], ["What is the maximum utilization of substitutions allowed in a professional soccer match?", " Three substitutions are allowed in professional soccer matches 🤝"], ["What nation won the most recent FIFA World Cup?", " France won the 2018 FIFA World Cup 🏆"], ["How many saves can a goalkeeper make in a penalty shootout?", " A goalkeeper can make up to three saves in a penalty shootout 🧤"], ["What is an elbow to the face offense in soccer?", " An elbow to the face offense in soccer is called an \"elbowing\" infraction 😡"], ["What is the oldest soccer tournament in the world?", " The oldest soccer tournament in the world is the FA Cup 🏆"], ["Who holds the record for the most goals scored in a single season in the UEFA Europa League?", " Henrikh Mkhitaryan holds the record for the most goals scored in a single season in the UEFA Europa League 🥅"], ["What team has won the most American MLS cups?", " The team with the most MLS cups is the LA Galaxy 🏆"], ["What are the four ways a player can score a goal in soccer?", " A player can score a goal in soccer by shooting, heading, volleying, or penalty kick 🤾‍♂️"], ["What is the official FIFA size of the soccer ball?", " The official FIFA size of a soccer ball is size 5 🤾‍♂️"], ["What is the oldest soccer club in Europe?", " The oldest soccer club in Europe is FC Barcelona 🤩"], ["What team won the most recent UEFA Nations League title?", " Portugal won the most recent UEFA Nations League title 🏆"], ["How are substitutions made in soccer?", " Substitutions in soccer are done by a coach substituting players off the field for players on the field 🤝"], ["What is the difference between a field player and a goalkeeper in soccer?", " A field player primarily looks to score goals, whereas a goalkeeper primarily looks to prevent goals from being scored 🙅‍♂️"], ["How many minutes of stoppage time does a soccer match typically have?", " Soccer match stoppage time typically lasts for about 3 minutes 🕑"], ["What is the offside position in soccer?", " The offside position in soccer is when a player is beyond the last defender when the ball is played 🙅‍♂️"], ["What is a goalkeepers box in soccer?", " A goalkeepers box in soccer is known as the penalty area 🤝"], ["What is a gavellinesman in soccer?", " A gavelinesman is a flag bearer in soccer who indicates when a ball has gone out of bounds 🏴‍☠️"], ["Who is the all-time leading goalscorer in the English Premier League?", " Alan Shearer is the all-time leading goalscorer in the English Premier League ⚽️"], ["What is the minimum amount of teams which can participate in a UEFA Nations League?", " The minimum amount of teams which can participate in a UEFA Nations League is 55 teams 🤝"], ["What is the penalty for a player that has been sent off in a soccer match?", " The player is subject to a red card and a suspension of at least one game 🔴"], ["What is the difference between an own goal and a penalty kick in soccer?", " An own goal is scored when a player accidentally kicks the ball into their own net, while a penalty kick is awarded when a player from the opposing team commits a foul in the penalty box 🤔"], ["What is the most common style of pass in soccer?", " The most common style of pass in soccer is the ground pass 🤾‍♂️"], ["How many field players are allowed on the pitch for an indoor soccer game?", " Five field players are allowed on the pitch for an indoor soccer game 🤾‍♂️"], ["What year was the first ever FIFA World Cup played?", " The first ever FIFA World Cup was played in 1930 🏆"], ["How far apart are the penalty and goal areas in soccer?", " The penalty and goal areas are 18 yards apart 🦶"], ["What is the longest match in soccer history?", " The longest match in soccer history is a 70-inning match between Duffield and Long Eaton in England in 1897 🤩"], ["What is the minimum and maximum duration for a soccer match?", " The minimum duration for a soccer match is 90 minutes and the maximum duration is 120 minutes ⚽"], ["What is the definition of a goal-area violation in soccer?", " A goal-area violation in soccer occurs when an attacking player enters the goal area before the ball 🤔"], ["What team holds the record for the most consecutive wins in the UEFA Champions League?", " The team with the most consecutive wins in the UEFA Champions League is Real Madrid 🤩"], ["What year was the first FIFA Women's World Cup held?", " The first FIFA Women's World Cup was held in 1991 🏆"], ["Who holds the record for the most goals scored in a single match in the UEFA Champions League?", " The record is held by Robert Lewandowski with 5 goals scored in one match 🤩"], ["How many players are in a women's soccer team?", " A women's soccer team typically has 11 players ⚽️"], ["What is the difference between a yellow card and a red card suspension in soccer?", " A yellow card indicates a warning, while a red card indicates a player dismissal 🔴"], ["What is the minimum amount of touches a player may have on the ball in a game?", " The minimum amount of touches a player may have on the ball in a game is one touch 🤚"], ["What is the name of the existing UEFA Nations League Trophy?", " The name of the existing UEFA Nations League Trophy is the Henri Delaunay Trophy 🏆"], ["What is the difference between a penalty kick and a penalty shoot-out in soccer?", " A penalty kick is taken from the penalty spot by one player and a penalty shoot-out involves five players alternating taking penalty kicks 🤔"], ["What's the length of penalty shootouts in soccer?", " Penalty shootouts consist of each team taking 5 shots alternately 🤩"], ["What is the definition of an offside offence in soccer?", " An offside offence in soccer occurs when a player receives the ball while they are positioned closer to the opponent's goal than the last defender 🤔"], ["How many players can a team have at the start of a soccer match?", " A soccer team can have 11 players at the start of a match ⚽️"], ["How many goals can a player score in a single match in the English Premier League?", " A player can score up to 4 goals in a single match in the English Premier League 🤩"], ["What is the maximum utilization of substitutions allowed in an international soccer match?", " The maximum utilization of substitutions allowed in an international soccer match is 3 🤝"], ["What is the purpose of the offside rule in soccer?", " The offside rule prevents players from gaining an unfair advantage by remaining in or near the opposition's penalty area 🤔"], ["How often do the FIFA World Cup and UEFA European Championship tournaments occur?", " The FIFA World Cup and UEFA European Championship occur every four years 🤔"], ["What is the penalty for intentionally handballing the ball in soccer?", " The penalty for intentionally handballing the ball in soccer is a direct free kick 🙅‍♂️"], ["What are the official rules for a penalty shoot-out in soccer?", " The official rules for a penalty shoot-out require five shooters to take turns shooting at the goal from the penalty mark 🤾‍♂️"], ["What is the name of the longest running soccer tournament in Europe?", " The longest running soccer tournament in Europe is the UEFA Champions League 🏆"], ["What is the penalty for an illegal throw-in in soccer?", " The penalty for an illegal throw-in in soccer is a direct free kick for the opposing team 🤔"], ["What is the most common way of scoring a goal in soccer?", " The most common way of scoring a goal in soccer is by kicking the ball into the goal 🤜🏻"], ["How is the goal-line technology used for in soccer?", " Goal-line technology is used to determine if the ball has fully crossed the goal line 📡"], ["What was the first season of the English Premier League?", " The first season of the English Premier League was 1992–93 🤩"], ["What year was the UEFA Champions League established?", " The UEFA Champions League was established in 1955 📆"], ["How often does the UEFA Champions League take place?", " The UEFA Champions League takes place every year 🏆"], ["What is the longest soccer match on record?", " The longest soccer match on record was an FA Cup game that lasted an incredible 14 hours ❗"], ["What kind of throw-in style is quickest to take?", " The over-the-head throw-in is the quickest to take 💪"], ["What are the international laws of soccer?", " The international laws of soccer are the Laws of the Game 🤔"]], "instructions": "Always add an emoji to the end of your answer", "language": "emoji"}