{"soccer": ["Which country has won the most soccer world cups?", "Which stadium in Barcelona is the largest in Spain?", "Which team has won the most Premier League titles?", "Which country has won the most soccer world cups?", "Which stadium in Barcelona is the largest in Spain?", "Which team has won the most Premier League titles?", "Which country has won the most soccer world cups?", "Which stadium in Barcelona is the largest in Spain?", "Which team has won the most Premier League titles?", "Which country has won the most soccer world cups?", "Which stadium in Barcelona is the largest in Spain?", "Which team has won the most Premier League titles?", "Which country has won the most soccer world cups?", "Which stadium in Barcelona is the largest in Spain?", "Which team has won the most Premier League titles?", "Which country has won the most soccer world cups?", "Which stadium in Barcelona is the largest in Spain?", "Which team has won the most Premier League titles?", "Which country has won the most soccer world cups?", "Which stadium in Barcelona is the largest in Spain?", "Which team has won the most Premier League titles?", "Which country has won the most soccer world cups?", "Which stadium in Barcelona is the largest in Spain?", "Which team has won the most Premier League titles?", "Which country has won the most soccer world cups?", "Which stadium in Barcelona is the largest in Spain?", "Which team has won the most Premier League titles?", "Which country has won the most soccer world cups?", "Which stadium in Barcelona is the largest in Spain?", "Which team has won the most Premier League titles?", "Which country has won the most soccer world cups?", "Which stadium in Barcelona is the largest in Spain?", "Which team has won the most Premier League titles?", "Which country has won the most soccer world cups?", "Which stadium in Barcelona is the largest in Spain?", "Which team has won the most Premier League titles?", "Which country has won the most soccer world cups?", "Which stadium in Barcelona is the largest in Spain?", "Which team has won the most Premier League titles?", "Which country has won the most soccer world cups?", "Which stadium in Barcelona is the largest in Spain?", "Which team has won the most Premier League titles?", "Which country has won the most soccer world cups?", "Which stadium in Barcelona is the largest in Spain?", "Which team has won the most Premier League titles?", "Which country has won the most soccer world cups?", "Which stadium in Barcelona is the largest in Spain?", "Which team has won the most Premier League titles?", "Which country has won the most soccer world cups?", "Which stadium in Barcelona is the largest in Spain?", "Which team has won the most Premier League titles?", "Which country has won the most soccer world cups?", "Which stadium in Barcelona is the largest in Spain?", "Which team has won the most Premier League titles?", "Which country has won the most soccer world cups?", "Which stadium in Barcelona is the largest in Spain?", "Which team has won the most Premier League titles?", "Which country has won the most soccer world cups?", "Which stadium in Barcelona is the largest in Spain?", "Which team has won the most Premier League titles?", "What are the FIFA Laws of the Game?", "Who is the all-time leading goalscorer in international soccer?", "What is a hat-trick in soccer?", "Which team has won the most European Championships?", "What is the official size of a professional soccer field?", "How many players are allowed on a professional soccer team?", "Who scored the most goals in a single World Cup?", "What is the highest number of goals ever scored in a single match?", "What is the most common style of soccer formation?", "How long is the standard soccer match?", "What is a dummy run in soccer?", "What does it mean when a soccer team is playing \"full press\"?", "Who is the current holder of the Ballon d'Or award?", "What is the offside rule in soccer?", "What country won the most recent FIFA Women's World Cup?", "What is the longest running soccer championship in Europe?", "What is the oldest professional soccer team?", "What team has won the most Champions League titles?", "How many players are in a FIFA indoor soccer team?", "How many times has Brazil won the FIFA World Cup?", "What is the difference between an indirect and direct free kick?", "What is the penalty for intentional handball in soccer?", "What is the difference between a penalty kick and a penalty shoot-out?", "What nationality is the current European Golden Boot winner?", "What is the minimum age for playing in the UEFA Champions League?", "Who holds the record for the most goals scored in a single Premier League season?", "How many substitutions can a team make in a FIFA World Cup match?", "How is the highest decimal number used to declare a soccer match draw?", "Which team has won the most UEFA Europa League titles?", "How often do the World Cup and European Championship tournaments occur?", "What is the difference between a yellow card and a red card in soccer?", "How far apart are the penalty boxes in soccer?", "What is the minimum amount of teams that can participate in a FIFA World Cup?", "What is the most common soccer throw-in style?", "What is the standard size of a professional soccer ball?", "What is a curving free kick or \"banana kick\" in soccer?", "Who is the only player to have been both a World Cup and European Championship winner?", "What is the oldest national soccer team in the world?", "How many sides can form a triangle in a soccer formation?", "How many players are in a female soccer team?", "What is the maximum length of the injury time in a professional soccer match?", "What is the purpose of the goal-line in soccer?", "Name the host country for the next FIFA World Cup?", "What is the name of the current FIFA World Cup Trophy?", "How many players are on the field at one time in soccer?", "What is the most common type of goal celebration in soccer?", "How long do soccer matches usually last?", "What is the name of the soccer rule that awards you a goal if your opponent touches the ball with their hands?", "What is a diving header in soccer?", "Who has scored the most goals in a single match in the UEFA Champions League?", "How many substitutions can a team make per match in the UEFA Champions League?", "Who was the first player ever to win the Ballon d'Or award?", "What is the most common type of goal kick in soccer?", "What are the various methods of scoring in soccer?", "How is a goal awarded in soccer?", "Who is the current president of FIFA?", "What is ano-look pass in soccer?", "Who is thes all-time leading goalscorer in the English Premier League?", "What's the \"second golden rule\" in soccer?", "What does the term \"offsides trap\" mean in soccer?", "What is a chip pass in soccer?", "How many players on a team are allowed to be in the penalty box when a penalty kick takes place?", "What is the highest score ever recorded in a soccer match?", "What is a red card suspension in soccer?", "What is a sliding tackle in soccer?", "What team won the most recent UEFA Europa League title?", "What is the distance between the penalty spot and the goal-line in a regulation soccer field?", "How many times has Italy won the FIFA World Cup?", "Who is the most successful team in the history of Major League Soccer?", "What is the most popular style of defender in soccer?", "How many times has Germany won the FIFA World Cup?", "What is a hat trick in soccer?", "How many players are in an indoor soccer team?", "What is the minimum age for playing in the UEFA Champions League?", "What is the offside rule in soccer?", "What is the standard duration for a professional soccer match?", "What is the difference between a yellow card and a red card in soccer?", "What team has the most international trophies?", "What is the youngest age to play professional soccer?", "What is the most common type of throw-in in soccer?", "Which team has won the most UEFA European Championship titles?", "Who was the first African player to win the FIFA World Player of the Year?", "When were the first FIFA World Cup games held?", "What is the women's version of the FIFA World Cup called?", "How many players are in a professional soccer team?", "How many players on a team can be in the penalty area when a penalty kick is taken?", "What team won the most recent CONCACAF Champions League title?", "How many times has Brazil won the Copa America?", "What country has hosted the most FIFA World Cup tournaments?", "What is the goal-line technology used for in soccer?", "How many substitutions are allowed per game in the English Premier League?", "Name the host country for the next UEFA European Championship?", "What is the aggregate scoreline in soccer?", "What team won the most recent UEFA Champions League title?", "What are the official rules for a soccer shootout?", "What is the rollback rule in soccer?", "What is a scissor kick in soccer?", "How many points are awarded for a win in the English Premier League?", "How many goals can a player score in a single match in the UEFA Champions League?", "What is the UEFA coefficient system used for?", "What is the maximum duration for an extra time in soccer?", "What is the penalty for an accidental handball in soccer?", "What is the minimum number of players required for soccer kickoff?", "What is the name of the existing FIFA World Cup Trophy?", "What is the most common type of goal kick in soccer?", "What are the various methods of scoring in soccer?", "Why are some teams awarded a bye in soccer tournaments?", "How is an indirect free kick awarded in soccer?", "What is the first thing a soccer team needs to do after they score a goal?", "How far apart are both teams' goal-lines in soccer?", "What is the name of the oldest professional soccer team in Europe?", "What year did the first professional soccer game take place?", "What is the difference between a yellow card and a red card suspension?", "What is the standard size of a pro-level soccer field?", "How many players in a team are allowed to be in the penalty area when a penalty kick takes place?", "What are the rules for a soccer throw-in?", "What is the name of the first European soccer cup?", "How long does each half in a soccer match last?", "Who is the current FIFA World Player of the Year?", "How is the team that goes first in a soccer match decided?", "What is the most common style of soccer formation?", "What is the difference between a controlled and uncontrolled pass in soccer?", "What level of soccer is organized by FIFA?", "What team won the first Copa Libertadores title?", "What is the significance of the offside line in soccer?", "What is a goalkeeper's role in the defensive phase of soccer?", "What is the most common type of goal celebration in soccer?", "What is the name of the existing UEFA Champions League Trophy?", "How was the \"golden goal\" rule changed in soccer?", "What is the distance between the goal-line and the penalty spot in a regulation soccer field?", "How many players are in a female soccer team?", "How many teams can a single country enter in the FIFA World Cup?", "What is the minimum amount of teams that can participate in a UEFA Champions League?", "What is the maximum utilization of a substitution in a FIFA World Cup match?", "What is the most common type of corner kick in soccer?", "What is the longest professional soccer match on record?", "What is the official size of a soccer pitch?", "What is the minimum number of players allowed on a soccer team?", "What is the maximum number of players allowed on the pitch during a soccer match?", "How many players on a team can be in the penalty area for a penalty kick?", "What are the differences between a direct and indirect free kick in soccer?", "What is the purpose of the penalty area and penalty spot in soccer?", "What is the difference between a goalkeeper and a sweeper in soccer?", "What is the most popular style of striker in soccer?", "What is the three-second rule in soccer?", "What is the most common type of flat pass in soccer?", "What is a bicycle kick in soccer?", "Who holds the record for the most goals in a single season in the English Premier League?", "How many players on a team are allowed to be in the penalty box when a penalty kick takes place?", "What age is a player allowed to sign a professional soccer contract?", "How long is the offside suspension after a player commits an offense?", "What is the term for the number of goals scored in a soccer match?", "What is the most popular style of soccer goal celebration?", "What is the minimum age to participate in a World Cup Final?", "What is the longest running soccer tournament in Europe?", "How is the distance of a free kick measured in soccer?", "What is the longest match in international soccer history?", "What is the minimum amount of players for a FIFA match?", "What is the maximum number of players a team can have in a FIFA match?", "What is the difference between a free kick and a penalty kick in soccer?", "What is the typical length of a soccer match?", "What is the maximum amount of time for a halftime break in soccer?", "What is the most common type of dribbling move in soccer?", "How many times has Brazil won the FIFA Confederations Cup?", "When was the first women's soccer World Cup held?", "What is the most common form of defense in soccer?", "What year was the first-ever soccer ball invented?", "What country has won the most soccer gold medals in the Olympic Games?", "Who holds the record for the most goals in a single season in the UEFA Champions League?", "What is the official score-line used to declare a soccer match draw?", "What is the most common type of header in soccer?", "What is the name of the first professional soccer league?", "How long is the extra time in football?", "Who is the current winner of the FIFA Women’s World Cup?", "How many players are in an indoor soccer team?", "What is the most common type of throw-in in soccer?", "How long is a standard soccer match?", "What is the goalkeeper's role in the attacking phase of soccer?", "What is the penalty for a player who commits a foul during a penalty kick?", "What is the maximum utilization of substitutions allowed in a professional soccer match?", "What nation won the most recent FIFA World Cup?", "How many saves can a goalkeeper make in a penalty shootout?", "What is an elbow to the face offense in soccer?", "What is the oldest soccer tournament in the world?", "Who holds the record for the most goals scored in a single season in the UEFA Europa League?", "What team has won the most American MLS cups?", "What are the four ways a player can score a goal in soccer?", "What is the official FIFA size of the soccer ball?", "What is the oldest soccer club in Europe?", "What team won the most recent UEFA Nations League title?", "How are substitutions made in soccer?", "What is the difference between a field player and a goalkeeper in soccer?", "How many minutes of stoppage time does a soccer match typically have?", "What is the offside position in soccer?", "What is a goalkeepers box in soccer?", "What is a gavellinesman in soccer?", "Who is the all-time leading goalscorer in the English Premier League?", "What is the minimum amount of teams which can participate in a UEFA Nations League?", "What is the penalty for a player that has been sent off in a soccer match?", "What is the difference between an own goal and a penalty kick in soccer?", "What is the most common style of pass in soccer?", "How many field players are allowed on the pitch for an indoor soccer game?", "How many players are in a FIFA indoor soccer team?", "What is the offside rule in soccer?", "What year was the first ever FIFA World Cup played?", "How far apart are the penalty and goal areas in soccer?", "What is the longest match in soccer history?", "What is the minimum and maximum duration for a soccer match?", "What is the definition of a goal-area violation in soccer?", "What team holds the record for the most consecutive wins in the UEFA Champions League?", "What year was the first FIFA Women's World Cup held?", "What is the most common type of goal kick in soccer?", "What is the official size of a soccer pitch?", "Who holds the record for the most goals scored in a single match in the UEFA Champions League?", "How many players are in a women's soccer team?", "What is the most common type of corner kick in soccer?", "What is the difference between a yellow card and a red card suspension in soccer?", "What is the minimum amount of touches a player may have on the ball in a game?", "What is the name of the existing UEFA Nations League Trophy?", "What is the difference between a penalty kick and a penalty shoot-out in soccer?", "What's the length of penalty shootouts in soccer?", "What is the definition of an offside offence in soccer?", "How many players can a team have at the start of a soccer match?", "How many goals can a player score in a single match in the English Premier League?", "Who is the most successful team in the history of Major League Soccer?", "What is the maximum utilization of substitutions allowed in an international soccer match?", "What is the purpose of the offside rule in soccer?", "How many players on a team are allowed to be in the penalty box when a penalty kick takes place?", "How often do the FIFA World Cup and UEFA European Championship tournaments occur?", "What is the penalty for intentionally handballing the ball in soccer?", "What are the official rules for a penalty shoot-out in soccer?", "What is the name of the longest running soccer tournament in Europe?", "What is the penalty for an illegal throw-in in soccer?", "How long do soccer matches usually last?", "What country hosted the most FIFA World Cup tournaments?", "What is a bicycle kick in soccer?", "What is the most common way of scoring a goal in soccer?", "How is the goal-line technology used for in soccer?", "What was the first season of the English Premier League?", "What year was the UEFA Champions League established?", "How often does the UEFA Champions League take place?", "What is the longest soccer match on record?", "What is the difference between a controlled and uncontrolled pass in soccer?", "What is the most common type of throw-in in soccer?", "What kind of throw-in style is quickest to take?", "What is the three-second rule in soccer?", "What are the international laws of soccer?"], "paris": ["In which neighborhood is the Eiffel Tower located?", "What is the name of the largest park in Paris?", "Which famous painting hangs in the Louvre?", "In which neighborhood is the Eiffel Tower located?", "What is the name of the largest park in Paris?", "Which famous painting hangs in the Louvre?", "In which neighborhood is the Eiffel Tower located?", "What is the name of the largest park in Paris?", "Which famous painting hangs in the Louvre?", "In which neighborhood is the Eiffel Tower located?", "What is the name of the largest park in Paris?", "Which famous painting hangs in the Louvre?", "In which neighborhood is the Eiffel Tower located?", "What is the name of the largest park in Paris?", "Which famous painting hangs in the Louvre?", "In which neighborhood is the Eiffel Tower located?", "What is the name of the largest park in Paris?", "Which famous painting hangs in the Louvre?", "In which neighborhood is the Eiffel Tower located?", "What is the name of the largest park in Paris?", "Which famous painting hangs in the Louvre?", "In which neighborhood is the Eiffel Tower located?", "What is the name of the largest park in Paris?", "Which famous painting hangs in the Louvre?", "In which neighborhood is the Eiffel Tower located?", "What is the name of the largest park in Paris?", "Which famous painting hangs in the Louvre?", "In which neighborhood is the Eiffel Tower located?", "What is the name of the largest park in Paris?", "Which famous painting hangs in the Louvre?", "In which neighborhood is the Eiffel Tower located?", "What is the name of the largest park in Paris?", "Which famous painting hangs in the Louvre?", "In which neighborhood is the Eiffel Tower located?", "What is the name of the largest park in Paris?", "Which famous painting hangs in the Louvre?", "In which neighborhood is the Eiffel Tower located?", "What is the name of the largest park in Paris?", "Which famous painting hangs in the Louvre?", "In which neighborhood is the Eiffel Tower located?", "What is the name of the largest park in Paris?", "Which famous painting hangs in the Louvre?", "In which neighborhood is the Eiffel Tower located?", "What is the name of the largest park in Paris?", "Which famous painting hangs in the Louvre?", "In which neighborhood is the Eiffel Tower located?", "What is the name of the largest park in Paris?", "Which famous painting hangs in the Louvre?", "In which neighborhood is the Eiffel Tower located?", "What is the name of the largest park in Paris?", "Which famous painting hangs in the Louvre?", "In which neighborhood is the Eiffel Tower located?", "What is the name of the largest park in Paris?", "Which famous painting hangs in the Louvre?", "In which neighborhood is the Eiffel Tower located?", "What is the name of the largest park in Paris?", "Which famous painting hangs in the Louvre?", "In which neighborhood is the Eiffel Tower located?", "What is the name of the largest park in Paris?", "Which famous painting hangs in the Louvre?", "What is the main river running through Paris?", "What is the name of the oldest bridge in Paris?", "What is the official language of Paris?", "What is the maximum speed limit in Paris?", "How many arrondissements are there in Paris?", "What is the iconic symbol of the city of Paris?", "What is the name of the oldest university in Paris?", "What is the main Metro station in Paris?", "What is the address of the Moulin Rouge in Paris?", "What is the average low temperature during the winter in Paris?", "How many museums are there in Paris?", "What is the name of the famous arch in Paris?", "What is the total population of Paris?", "Who is the current mayor of Paris?", "What is the name of the famous cathedral in Paris?", "What is the deepest lake in Paris?", "What is the approximate length of the Seine River that runs through Paris?", "What is the main airport in Paris?", "What is the address of Notre Dame Cathedral in Paris?", "What is the name of the famous park located in the center of Paris?", "What is the approximate size of the city of Paris?", "What is the average high temperature during the summer in Paris?", "What are the two main train stations in Paris?", "How many islands are located within the city of Paris?", "What is the address of the Eiffel Tower in Paris?", "What type of climate does Paris have during the summer months?", "On what date does Bastille Day take place in Paris?", "What is the most popular sport in Paris?", "What is the main currency used in Paris?", "What is the main shopping district in Paris?", "What is the name of the opera house in Paris?", "What is the approximate population density in Paris?", "What is the height of the Eiffel Tower?", "What is the closest international city to Paris?", "How many bridges are located on the Seine River?", "How many tourist attractions are there in Paris?", "When was the Louvre first opened?", "Who was the architect of the Eiffel Tower?", "What type of transportation is available in Paris?", "How long does it take to travel from Charles de Gaulle airport to the city center of Paris?", "What type of food is typically served in Paris?", "What is the name of the famous museum located in Montmartre?", "What is the name of the iconic obelisk located in the middle of Paris?", "How many arrondissements are there in the city of Paris?", "What is the world-famous cabaret show located in Paris?", "What is the approximate cost of a one-day ticket to the Louvre?", "What is the address of the Arc de Triomphe in Paris?", "What is the approximate cost of a meal in a mid-range Parisian restaurant?", "What type of color is on the interior of the Eiffel Tower?", "What is the nearest beach to Paris?", "How long is the train ride from the city center of Paris to Disneyland Paris?", "What is the approximate size of La Chapelle park?", "What type of clothing is typically worn in Paris?", "What is the approximate distance from Notre Dame Cathedral to the Eiffel Tower?", "What type of architecture is typically seen in Paris?", "What is the name of the infamous criminal whose story is featured in the musical Notre Dame de Paris?", "What is the approximate cost of a one-way ticket on the Paris Metro?", "What type of cuisine is typically served in the cafes of Montmartre?", "What is the approximate distance from Charles de Gaulle Airport to the city center of Paris?", "Who originally constructed the Louvre Castle?", "What type of cuisine is typically served in Parisian bistros?", "What is the address of The Louvre?", "What is the name of the famous bridge that connects the Eiffel Tower to the Champs Élysées?", "What is the approximate cost of a one-day ticket to the Louvre?", "What is the approximate cost of a one-way ticket on the RER train in Paris?", "How old is the Eiffel Tower?", "How long does it take to walk from the Eiffel Tower to the Arc de Triomphe?", "What type of government does Paris have?", "What is the name of the bike rental system in Paris?", "What is the nearest mountain range to Paris?", "What is the approximate elevation of the city of Paris?", "What is the busiest shopping street in Paris?", "How many theatres are located in Paris?", "What is the name of the iconic memorial located outside the Louvre?", "What event takes place on the Champs Élysées every year around the third week of July?", "What type of cuisine is typically served in the restaurants of the Latin Quarter in Paris?", "What is the approximate cost of a one-way ticket on the Paris Metro?", "What is the name of the largest clock in Paris?", "Who is the current president of France?", "What species of tree is typically found in the parks of Paris?", "What type of cuisine is typically served in the restaurants located in the Marais neighborhood of Paris?", "What type of buildings are typically found in the Sorbonne district of Paris?", "What is the address of the Picasso Museum in Paris?", "What type of construction is typically seen in Montmartre?", "What is the approximate cost of a one-day ticket to the Catacombs Museum in Paris?", "What type of cuisine is typically served in the restaurants of the Pigalle district in Paris?", "What is the name of the jazz club located on Rue des Lombards in Paris?", "What type of cuisine is typically served in the restaurants of the Champs Élysées in Paris?", "What type of cuisine is typically served in the restaurants of the Latin Quarter in Paris?", "What type of cuisines is typically served in the restaurants of the Marais neighborhood of Paris?", "What is the approximate distance between Montmartre and the Eiffel Tower?", "What is the name of the main shopping center located near the Champs Élysées?", "What type of transportation is typically used to travel between the city center of Paris and the airport?", "What type of cuisine is typically served in the restaurants of the Pigalle district of Paris?", "What type of cuisine is typically served in the restaurants of the Montmartre neighborhood of Paris?", "What is the current maximum speed limit on the streets of Paris?", "What is the name of the largest department store in Paris?", "What type of cuisine is typically served in the restaurants of the Sorbonne district of Paris?", "What type of cuisine is typically served in the restaurants of the Champs Élysées in Paris?", "What type of transportation is typically used to travel between the city center and the Airport?", "What type of cuisine is typically served in the cafes of Montmartre?", "What type of cuisine is typically served in the restaurants of the Latin Quarter in Paris?", "How far is the Arc de Triomphe from the Eiffel Tower?", "What is the name of the major boulevard that runs through the center of Paris?", "What type of cuisine is typically served in the restaurants of the Left Bank in Paris?", "How long does it take to travel between the Eiffel Tower and the Arc de Triomphe by bike?", "What type of cuisine is typically served in the restaurants of the Pigalle district of Paris?", "How high is the Eiffel Tower during the summer months?", "What is the name of the largest theatre in Paris?", "What is the approximate cost of a one-way ticket on the RER train in Paris?", "What type of cuisine is typically served in the restaurants of the Marais neighborhood of Paris?", "What type of cuisine is typically served in the restaurants of the Sorbonne district of Paris?", "What is the address of the Rodin Museum in Paris?", "How long does it take to walk from the Louvre to Notre Dame Cathedral?", "What type of cuisine is typically served in the restaurants of the Left Bank of Paris?", "What is the approximate cost of a meal in a mid-range Parisian restaurant?", "What is the approximate cost of a taxi ride from the airport to the city center of Paris?", "What type of cuisine is typically served in the cafes of the Latin Quarter in Paris?", "What type of cuisine is typically served in the restaurants located in the Saint Germain area of Paris?", "What type of cuisine is typically served in the restaurants located in the Montparnasse area of Paris?", "How long is the Seine River?", "How many metro lines are there in Paris?", "What is the nearest mountain range to Paris?", "How many bridges span the Seine River in Paris?", "What is the name of the famous tower located in the Latin Quarter in Paris?", "What is the approximate cost of a one-day ticket to the Catacombs museum in Paris?", "What type of public transportation is typically used to travel from the city center to Disneyland Paris?", "What type of cuisine is typically served in the restaurants of the Champs Élysées in Paris?", "What type of cuisine is typically served in the restaurants of the Montparnasse neighborhood of Paris?", "What is the name of the famous garden located on the Left Bank in Paris?", "What is the approximate cost of a one-way ticket on the Paris Metro?", "What type of cuisine is typically served in the restaurants of the Pigalle district in Paris?", "What is the approximate cost of a one-day ticket to Disneyland Paris?", "Who are the current owners of the famous nightclub Folies Bergère in Paris?", "What type of architecture is typically seen in the long gallery at the Louvre?", "What type of cuisine is typically served in the cafes of the Marais neighborhood of Paris?", "What type of cuisine is typically served in the restaurants of the Saint Germain area of Paris?", "What type of cuisine is typically served in the cafes of the Champs Elysees in Paris?", "How old is the Arc de Triomphe?", "Where is the main railway station located in Paris?", "What type of cuisine is typically served in the cafes of the Latin Quarter in Paris?", "What is the name of the famous bridge that connects the Champs Élysées to the Left Bank of the Seine?", "How long is the Eiffel Tower?", "What type of cuisine is typically served in the cafes of the Left Bank of Paris?", "What is the name of the famous monument located in the center of Paris?", "What is the approximate cost of a one-way ticket on the RER train in Paris?", "What type of public transportation is typically used to travel from the city center to the Eiffel Tower?", "What type of cuisine is typically served in the cafes of the Marais neighborhood of Paris?", "What type of cuisine is typically served in the restaurants of the Montparnasse neighborhood of Paris?", "What type of cuisine is typically served in the restaurants of the Sorbonne district of Paris?", "How many tourist attractions are there in the city of Paris?", "What is the approximate cost of a meal in a mid-range Parisian restaurant?", "What is the approximate cost of a taxi ride from the airport to the city center of Paris?", "What type of cuisine is typically served in the cafes of Montmartre?", "What type of cuisine is typically served in the restaurants of the Right Bank area of Paris?", "What type of flowers are typically found in the parks and public spaces of Paris?", "What is the approximate cost of a one-way ticket on the Metro in Paris?", "What type of cuisine is typically served in the cafes of the Latin Quarter in Paris?", "How long does it take to walk from Notre Dame Cathedral to the Louvre?", "What type of cuisine is typically served in the restaurants of the Latin Quarter in Paris?", "What is the name of the famous bridge that connects the Left Bank of Paris to the Right Bank?", "What type of cuisine is typically served in the cafes of the Champs Élysées in Paris?", "What type of cuisine is typically served in the restaurants of the Left Bank in Paris?", "What type of cuisine is typically served in the restaurants of the Pigalle district in Paris?", "How long does it take to walk from the Arc de Triomphe to the Louvre?", "What type of cuisine is typically served in the cafes of the Marais neighborhood of Paris?", "What species of trees are typically found in the parks and public spaces of Paris?", "What type of cuisine is typically served in the restaurants of the Montparnasse neighborhood of Paris?", "What type of cuisine is typically served in the restaurants of the Saint Germain area of Paris?", "What type of cuisine is typically served in the cafes of the Pigalle district of Paris?", "What type of cuisine is typically served in the restaurants of the Left Bank in Paris?", "What type of transportation is typically used to travel from the city of Paris to the Airport?", "What type of cuisine is typically served in the restaurants of the Champs Élysées in Paris?", "What type of cuisine is typically served in the cafes of the Latin Quarter in Paris?", "What type of cuisine is typically served in the restaurants of the Montparnasse neighborhood of Paris?", "What type of architecture is typically seen in Montmartre?", "What type of cuisine is typically served in the cafes of Montmartre?", "What type of cuisine is typically served in the restaurants of the Pigalle district of Paris?", "What type of cuisine is typically served in the restaurants located in the Saint Germain area of Paris?", "What type of cuisine is typically served in the restaurants located in the Marais neighborhood of Paris?", "What type of cuisine is typically served in the cafes of the Left Bank of Paris?", "What type of cuisine is typically served in the restaurants located in the Montparnasse area of Paris?", "What type of transportation is typically used to travel from the city center of Paris to the airport?", "What type of architecture is typically seen in the architecture of the Eiffel Tower?", "What type of cuisine is typically served in the restaurants of the Sorbonne district of Paris?", "What type of cuisine is typically served in the restaurants of the Right Bank in Paris?", "What type of cuisine is typically served in the cafes of the Pigalle district of Paris?", "What type of cuisine is typically served in the restaurants located in the Right Bank area of Paris?", "What type of cuisine is typically served in the restaurants of the Latin Quarter in Paris?", "What type of cuisine is typically served in the cafes of the Latin Quarter in Paris?", "How long does it take to travel from the city center to Disneyland Paris?", "What type of cuisine is typically served in the cafes of the Left Bank of Paris?", "What type of cuisine is typically served in the restaurants of the Champs Elysees in Paris?", "What type of cuisine is typically served in the cafes of the Marais neighborhood of Paris?", "What type of cuisine is typically served in the restaurants located in the Latin Quarter area of Paris?", "What type of cuisine is typically served in the cafes of the Left Bank of Paris?", "What type of cuisine is typically served in the restaurants of the Montparnasse neighborhood of Paris?", "What type of cuisine is typically served in the restaurants located in the Montparnasse area of Paris?", "How long does it take to travel from the Louvre to the Eiffel Tower by bike?", "What type of cuisine is typically served in the cafes of Montmartre?", "What type of cuisine is typically served in the restaurants of the Pigalle district in Paris?", "What is the approximate cost of a one-way ticket on the RER train in Paris?", "How long is the Seine River?", "What is the height of the Eiffel Tower?", "What type of cuisine is typically served in the cafes of the Latin Quarter in Paris?", "What type of construction is typically seen in Montmartre?", "What type of cuisine is typically served in the restaurants of the Champs Élysées in Paris?", "What type of cuisine is typically served in the restaurants located in the Saint Germain area of Paris?", "What type of cuisine is typically served in the restaurants located in the Montparnasse area of Paris?", "What is the approximate cost of a taxi ride from the airport to the city center of Paris?", "What type of cuisine is typically served in the restaurants of the Left Bank of Paris?", "How long is the Eiffel Tower?", "What type of cuisine is typically served in the restaurants of the Right Bank area of Paris?", "What type of cuisine is typically served in the cafes of the Marais neighborhood of Paris?", "What type of cuisine is typically served in the restaurants located in the Latin Quarter area of Paris?", "What type of cuisine is typically served in the restaurants of the Montparnasse neighborhood of Paris?", "How long does it take to walk from the Louvre to the Champs Élysées?", "What type of cuisine is typically served in the cafes of the Marais neighborhood of Paris?", "What type of cuisine is typically served in the restaurants of the Right Bank area of Paris?", "What type of cuisine is typically served in the restaurants located in the Latin Quarter in Paris?", "What type of cuisine is typically served in the cafes of the Champs Élysées in Paris?", "What type of cuisine is typically served in the restaurants of the Montparnasse neighborhood of Paris?", "How far is Disneyland Paris from the City Center of Paris?", "What type of cuisine is typically served in the restaurants of the Latin Quarter in Paris?", "What type of cuisine is typically served in the restaurants of the Right Bank area of Paris?", "What type of cuisine is typically served in the restaurants located in the Montparnasse area of Paris?", "What type of public transportation is typically used to travel between the Eiffel Tower and the Arc de Triomphe?", "How long is the train ride from the city center of Paris to the Palace of Versailles?", "What type of cuisine is typically served in the cafes of the Left Bank of Paris?", "What type of cuisine is typically served in the restaurants of the Pigalle district in Paris?", "What type of cuisine is typically served in the restaurants located in the Latin Quarter of Paris?", "What type of cuisine is typically served in the restaurants located in the Marais neighborhood of Paris?", "What type of cuisine is typically served in the restaurants located in the Saint Germain area of Paris?", "What type of cuisine is typically served in the cafes of the Pigalle district of Paris?", "What type of cuisine is typically served in the restaurants located in the Montparnasse area of Paris?", "What type of cuisine is typically served in the cafes of the Champs Élysées in Paris?", "What type of cuisine is typically served in the restaurants of the Sorbonne district of Paris?", "What type of cuisine is typically served in the restaurants of the Right Bank area of Paris?", "What type of flowers are typically found in the parks and public spaces of Paris?", "What is the name of the famous open-air market located in Montmartre?", "What is the approximate cost of a one-way ticket on the RER train in Paris?", "What type of cuisine is typically served in the cafes and restaurants of the Latin Quarter in Paris?", "What type of cuisine is typically served in the restaurants of the Champs Élysées in Paris?", "What type of cuisine is typically served in the cafes of the Marais neighborhood of Paris?", "What type of cuisine is typically served in the cafes and restaurants located in the Montparnasse area of Paris?", "What is the address of the Catacombs Museum in Paris?", "What type of cuisine is typically served in the restaurants located in the Saint Germain area of Paris?"], "trees": ["What is the name of the tallest tree in the world?", "Which country has the most trees per person?", "Describe the purpose of tree roots.", "What is the name of the tallest tree in the world?", "Which country has the most trees per person?", "Describe the purpose of tree roots.", "What is the name of the tallest tree in the world?", "Which country has the most trees per person?", "Describe the purpose of tree roots.", "What is the name of the tallest tree in the world?", "Which country has the most trees per person?", "Describe the purpose of tree roots.", "What is the name of the tallest tree in the world?", "Which country has the most trees per person?", "Describe the purpose of tree roots.", "What is the name of the tallest tree in the world?", "Which country has the most trees per person?", "Describe the purpose of tree roots.", "What is the name of the tallest tree in the world?", "Which country has the most trees per person?", "Describe the purpose of tree roots.", "What is the name of the tallest tree in the world?", "Which country has the most trees per person?", "Describe the purpose of tree roots.", "What is the name of the tallest tree in the world?", "Which country has the most trees per person?", "Describe the purpose of tree roots.", "What is the name of the tallest tree in the world?", "Which country has the most trees per person?", "Describe the purpose of tree roots.", "What is the name of the tallest tree in the world?", "Which country has the most trees per person?", "Describe the purpose of tree roots.", "What is the name of the tallest tree in the world?", "Which country has the most trees per person?", "Describe the purpose of tree roots.", "What is the name of the tallest tree in the world?", "Which country has the most trees per person?", "Describe the purpose of tree roots.", "What is the name of the tallest tree in the world?", "Which country has the most trees per person?", "Describe the purpose of tree roots.", "What is the name of the tallest tree in the world?", "Which country has the most trees per person?", "Describe the purpose of tree roots.", "What is the name of the tallest tree in the world?", "Which country has the most trees per person?", "Describe the purpose of tree roots.", "What is the name of the tallest tree in the world?", "Which country has the most trees per person?", "Describe the purpose of tree roots.", "What is the name of the tallest tree in the world?", "Which country has the most trees per person?", "Describe the purpose of tree roots.", "What is the name of the tallest tree in the world?", "Which country has the most trees per person?", "Describe the purpose of tree roots.", "What is the name of the tallest tree in the world?", "Which country has the most trees per person?", "Describe the purpose of tree roots.", "How do trees help to create oxygen?", "What is the average life span of a tree?", "What is the most common type of tree found in the United States?", "How does the size of a tree's leaves vary?", "What type of nutrients do trees need for growth?", "What role do trees play in the climate and water cycle?", "How much carbon dioxide can a tree absorb?", "What are the most important parts of a tree?", "What is the basic structure of a tree?", "What are the different layers of a tree?", "What types of insects live on trees?", "How do trees provide homes for animals?", "What are the benefits of planting trees?", "What are the different types of tree bark?", "What are the different types of tree leaves?", "How do trees provide humans with food?", "What are the unique properties of some tree species?", "How do trees affect global temperatures?", "How long does it take for a tree to start producing fruit?", "What types of flowers do trees produce?", "How do trees protect themselves from predators?", "How are trees affected by annual weather patterns?", "How do trees sense their environment?", "What are the characteristics of a healthy tree?", "What is the scientific name for the tree in your backyard?", "How do trees clean the air?", "What are the most common types of tree diseases?", "What are the different classes of trees?", "What is the average height of a tree?", "What causes bark to fall off a tree?", "How do trees decompose?", "What are the benefits of pruning trees?", "How can I tell the age of a tree?", "How does a tree stay alive during a drought?", "What role do trees play in the food web?", "What threats do trees face from humans?", "What are the signs of a stressed tree?", "What can I do to protect my trees from pests?", "How do trees absorb nutrients from their environment?", "What are the main factors that limit a tree's growth?", "Is it possible to replant a tree from a cutting?", "What types of trees can be planted in different climates?", "How can I identify a species of tree from its leaves?", "What are the different types of tree roots?", "How do trees respond to different types of soil?", "What is the significance of the shape of a tree's leaves?", "How does the environment influence a tree's growth?", "What are the main benefits of planting trees?", "What are the most important strategies for conserving trees?", "What causes trees to lose their leaves in fall?", "How do I properly care for a tree in my backyard?", "What is the process of photosynthesis in trees?", "What happens during a tree's growing season?", "What are the most common causes of tree death?", "How does the bark of a tree protect it from disease?", "What is the difference between evergreen and deciduous trees?", "How do trees help to protect our homes from wind and storms?", "Are there ways to tell if a tree is healthy?", "What are the different species of conifers?", "Why is it important to plant native species of trees?", "What types of birds and insects live on trees?", "How does the age of a tree affect its growth rate?", "What is the role of fungi in the life cycle of a tree?", "How can humans make the most of urban trees?", "What is the difference between a pine tree and a fir tree?", "How do different types of trees affect soil erosion?", "What are the implications of deforestation?", "What is the \"life cycle\" of a tree?", "How can we use wood in sustainable ways?", "What are the different types of tree diseases?", "What is the importance of trees in our daily lives?", "What are the different stages of tree growth?", "How do trees absorb and store water?", "How do trees support biodiversity?", "What is the role of plants in an ecosystem?", "What is the impact of global warming on trees?", "What technological innovations have been made to improve the health of trees?", "What native trees should I plant in my region?", "How do trees adapt to changing climates?", "How does harvesting wood affect trees?", "What is the difference between a tree and a shrub?", "What are the main defense mechanisms of trees?", "How can I tell the difference between deciduous and coniferous trees?", "How do trees improve air quality?", "What environmental impacts can occur from cutting down trees?", "What types of flowering trees are found in different climates?", "What is the most common type of tree in the world?", "What are the different types of tree fruits?", "What methods can we use to reduce deforestation?", "How do trees help to reduce pollution?", "What are the renewable energy sources derived from trees?", "Why do trees lose their leaves in the fall?", "How can trees help to prevent soil erosion?", "How do trees affect the local temperature?", "What is the process of tree regeneration?", "What is the role of mycorrhizae in trees?", "How can we create shade with trees?", "How do trees help to support wildlife?", "What are the steps for planting and caring for trees?", "What are the different tree shapes?", "How do trees contribute to climate regulation?", "What is the impact of acid rain on trees?", "What are the different types of tree wood?", "How do we measure the height of a tree?", "What types of animals live in trees?", "What is the difference between a tree species and a variety?", "What factors influence the growth rate of a tree?", "How do trees combat desertification?", "How does cutting down trees affect the overall health of the environment?", "What are the benefits of mulching trees?", "What causes a tree's branches to die?", "How does a tree store energy in its trunk?", "How does the presence of trees affect your home's energy consumption?", "How do different types of trees respond to forest fires?", "Why are some trees more susceptible to pests and diseases than others?", "What is the difference between a hardwood and a softwood tree?", "How can you help trees stay healthy?", "What is the process of photosynthesis in trees?", "What types of products can be derived from trees?", "What are the effects of deforestation on the environment?", "How do trees affect the acidity of the soil?", "What is the significance of different shapes of leaves on a tree?", "What are the different parts of a tree's life cycle?", "How can trees be beneficial in a stormwater management system?", "What is the best type of mulch to use on trees?", "How do trees prevent soil erosion?", "How do trees affect air quality?", "What are the unique features of a tree's bark?", "What is the difference between an evergreen tree and a deciduous tree?", "What are the factors that contribute to a tree's height?", "What are the dangers of planting non-native species of trees?", "What are the unique ways in which trees communicate with each other?", "What is the chemical structure of a tree's leaves?", "How does soil composition affect the growth of trees?", "How does limb girdling affect the health of a tree?", "What are the different types of tree flowers?", "What is the effect of deforestation on local ecosystems?", "What processes occur within a tree's trunk?", "How do trees protect other plants in their environment?", "How many species of trees are found in different forests around the world?", "How do trees respond when they're cut down?", "Can a tree adapt to a changing climate?", "How long does it take a tree to mature?", "What is the role of trees in regulating water flows?", "How can I identify different types of trees?", "What is the difference between a tree and a bush?", "What pest-control strategies can be used for trees?", "How do trees prevent soil from drying out?", "How much carbon dioxide does a tree absorb through its leaves?", "How is fire beneficial for the regrowth of trees?", "How does the amount of sunlight affect tree growth?", "What is the effect of pollutants on trees?", "What is the purpose of a tree's bark?", "What can be done to conserve trees in urban areas?", "What are the legal implications of cutting down trees?", "What are the chemical processes involved in photosynthesis?", "What are the benefits of tree planting programs?", "What are the benefits of using trees as windbreaks?", "How can I protect my trees from animals?", "What type of soil is best for growing trees?", "What does the presence of trees tell us about an area?", "What are the effects of tree roots on the soil?", "What are the different methods used to fertilize trees?", "What are the general characteristics of different types of trees?", "How do the roots of a tree provide stability?", "What is the pattern of growth in a tree's trunk?", "What types of trees are used in bonsai gardening?", "How can I tell if a tree is dead or alive?", "How do tree pruning and thinning impact tree health?", "How is the age of a tree determined?", "What are some methods of identifying a species of tree?", "How do trees regulate the temperature in their environments?", "What are the implications of planting non-native species of trees?", "What is the process of transporting water up a tree?", "What is the importance of planting trees in urban areas?", "What are the different uses of wood from trees?", "What are the components of a tree's fruit?", "What is the difference between a taproot and a fibrous root system?", "What are the different types of tree trunks?", "What is the step-by-step process for planting a tree?", "What factors determine the wood quality of a tree?", "What are the benefits of using trees as shade?", "How do tree roots affect the soil structure?", "What is the process of pollination in trees?", "How do pruning and thinning affect tree growth?", "How do trees produce flowers and fruits?", "What is the impact of climate change on trees?", "How do different trees affect the soil's fertility?", "What challenges do trees face in urban areas?", "What is the role of wind in a tree's growth?", "What is the link between a tree's leaves and its fruits?", "How does the size of a tree vary seasonally?", "What type of weather is most beneficial for trees?", "What are the different methods of removing a tree from a site?", "How do trees help to reduce surface runoff?", "How do trees help to anchor soil in place?", "What is the process for transplanting a tree?", "What are the effects of leaf shapes on a canopy?", "What are the ideal conditions for growing trees?", "What type of trees should I plant in an urban area?", "What is the relationship between trees and insects?", "What is the purpose of having different tree heights in a forest?", "How do trees benefit wildlife habitats?", "What is the purpose of a tree's sap?", "What is the typical lifespan of a tree in a city?", "What is the economic value of trees in an urban area?", "How do trees affect landscaping?", "What types of tree diseases can cause physical damage?", "What methods can be used to prune trees?", "What are the benefits of using trees as insulation?", "What are the different methods of harvesting wood from trees?", "What is the process of releasing oxygen from trees?", "What is the impact of galvanization on tree growth?", "How do trees protect against air pollution?", "What are the benefits of trees for environment education?", "What methods can be used to encourage native species of trees?", "What is the importance of trees in agroforestry?", "What are the benefits of using trees for biofuel?", "What is the significance of fungi in the life cycle of a tree?", "How do trees interact with animals in a rainforest?", "What is the role of trees in stabilizing slopes and hillsides?", "How can we use trees to purify water?", "What is the effect of wind on trees?", "What is the role of trees in natural shoreline protection?", "How do different species of trees affect biodiversity?", "How do different tree species respond to climate change?", "How do trees function as oxygen producers?", "What types of trees are best suited for urban forestry?", "What are the impacts of clear-cutting trees?", "What is the role of trees in regulating microclimates?", "How do trees help control water levels in rivers and lakes?", "What are the benefits of using trees for erosion control?", "What causes a tree to change color in fall?", "What methods can be used to protect trees from storms?", "How does tree diversity affect the health of an ecosystem?", "What are the environmental effects of planting trees in a desert?", "What are some tips for transplanting a tree?", "Why is it important to prune a tree correctly?", "What type of soils are beneficial for tree growth?", "What are the different methods of seed dispersal in trees?", "What is the importance of nursery practices in tree cultivation?", "How do trees respond to drought?", "What type of trees are best suited for reclamation projects?", "Why are trees important to wildlife and nature?", "What is the importance of tree grafting?", "What is the role of trees in soil and water conservation?", "How do trees help to regulate air temperatures?"], "taylor swift": ["What is the name of one of Taylor Swift's cats?", "What is the name of Taylor Swift's first album?", "Where was Taylor Swift born?", "What is the name of one of Taylor Swift's cats?", "What is the name of Taylor Swift's first album?", "Where was Taylor Swift born?", "What is the name of one of Taylor Swift's cats?", "What is the name of Taylor Swift's first album?", "Where was Taylor Swift born?", "What is the name of one of Taylor Swift's cats?", "What is the name of Taylor Swift's first album?", "Where was Taylor Swift born?", "What is the name of one of Taylor Swift's cats?", "What is the name of Taylor Swift's first album?", "Where was Taylor Swift born?", "What is the name of one of Taylor Swift's cats?", "What is the name of Taylor Swift's first album?", "Where was Taylor Swift born?", "What is the name of one of Taylor Swift's cats?", "What is the name of Taylor Swift's first album?", "Where was Taylor Swift born?", "What is the name of one of Taylor Swift's cats?", "What is the name of Taylor Swift's first album?", "Where was Taylor Swift born?", "What is the name of one of Taylor Swift's cats?", "What is the name of Taylor Swift's first album?", "Where was Taylor Swift born?", "What is the name of one of Taylor Swift's cats?", "What is the name of Taylor Swift's first album?", "Where was Taylor Swift born?", "What is the name of one of Taylor Swift's cats?", "What is the name of Taylor Swift's first album?", "Where was Taylor Swift born?", "What is the name of one of Taylor Swift's cats?", "What is the name of Taylor Swift's first album?", "Where was Taylor Swift born?", "What is the name of one of Taylor Swift's cats?", "What is the name of Taylor Swift's first album?", "Where was Taylor Swift born?", "What is the name of one of Taylor Swift's cats?", "What is the name of Taylor Swift's first album?", "Where was Taylor Swift born?", "What is the name of one of Taylor Swift's cats?", "What is the name of Taylor Swift's first album?", "Where was Taylor Swift born?", "What is the name of one of Taylor Swift's cats?", "What is the name of Taylor Swift's first album?", "Where was Taylor Swift born?", "What is the name of one of Taylor Swift's cats?", "What is the name of Taylor Swift's first album?", "Where was Taylor Swift born?", "What is the name of one of Taylor Swift's cats?", "What is the name of Taylor Swift's first album?", "Where was Taylor Swift born?", "What is the name of one of Taylor Swift's cats?", "What is the name of Taylor Swift's first album?", "Where was Taylor Swift born?", "What is the name of one of Taylor Swift's cats?", "What is the name of Taylor Swift's first album?", "Where was Taylor Swift born?", "Who wrote Taylor Swift's hit single 'Love Story'?", "What does the Fearless album cover depict?", "When did Taylor Swift sign her first record deal?", "What is the name of the Taylor Swift tour in 2020?", "Does Taylor Swift like cats or dogs better?", "What year did Taylor Swift win her first Grammy?", "What song did Taylor Swift collaborate with Zain Malik on?", "What is the name of Taylor Swift's clothing line?", "How many albums has Taylor Swift released?", "What was Taylor Swift's first self-written song?", "How old was Taylor Swift when she released her first album?", "What genre of music does Taylor Swift typically perform?", "What is Taylor Swift's most popular single?", "What is Taylor Swift's net worth?", "How many times has Taylor Swift performed at the Grammy's?", "What color are Taylor Swift's eyes?", "How many Golden Globe nominations has Taylor Swift received?", "How many sisters does Taylor Swift have?", "Who plays the lead role in Taylor Swift's music video for \"I Knew You Were Trouble\"?", "What was the last year Taylor Swift was nominated for a Grammy?", "What movie soundtrack did Taylor Swift record the song \"Today Was a Fairytale\" for?", "What is the name of the tour Taylor Swift was on in 2009?", "What is the title of Taylor Swift's fifth studio album?", "What is the title of Taylor Swift's song about Joe Jonas?", "What is the title of the single Taylor Swift collaborated on with Ed Sheeran?", "Who are Taylor Swift's regular background singers on her tours?", "What is the title of Taylor Swift's second album?", "What record label does Taylor Swift currently record music with?", "What was Taylor Swift's first acting role?", "What television show did Taylor Swift make her acting debut on?", "Who was Taylor Swift's character in the movie 'Valentine's Day'?", "What is Taylor Swift's oscar-winning song?", "How many albums has Taylor Swift sold worldwide?", "How many times has Taylor Swift won Entertainer of the Year at the Country Music Awards?", "Who did Taylor Swift collaborate with on the song \"Bad Blood\"?", "Who did Taylor Swift collaborate with on the song \"We Are Never Ever Getting Back Together\"?", "What year did Swift win a Grammy for Album of the Year?", "What country did Taylor Swift tour for her Speak Now tour?", "What type of animal does Taylor Swift own?", "What year was Taylor Swift's first single released?", "What record label did Taylor Swift sign with in 2006?", "What year did Taylor Swift win a Grammy for Best Female Country Vocal Performance?", "Has Taylor Swift ever been nominated for an Emmy award?", "How many platinum albums has Taylor Swift achieved?", "What is Taylor Swift's middle name?", "What nationality is Taylor Swift?", "How many tennis courts does Taylor Swift have at her house?", "What is Taylor Swift's favorite color?", "How many Tatums are in Taylor Swift's Starlight dance?", "What is Taylor Swift's favorite ice cream flavor?", "What year did Taylor Swift go on holiday to Africa?", "Who directed the music video for Taylor Swift's \"You Belong With Me\"?", "What was the name of Taylor Swift's first world tour?", "What is Taylor Swift's signature hairstyle?", "What year did Taylor Swift first appear on the cover of Rolling Stone magazine?", "What year did Taylor Swift start the \"Speak Now\" World Tour?", "How many Twitter followers does Taylor Swift have?", "What year did Taylor Swift win a Grammy for Best Country Album?", "What year did Taylor Swift release her third studio album, Fearless?", "How many Billboard Hot 100 top 10 hits has Taylor Swift had?", "What award did Taylor Swift win at the MTV Music Awards in 2009?", "What college did Taylor Swift tour instead of going to college?", "What is Taylor Swift's favorite charity?", "What year did Taylor Swift win a Grammy for Best Pop Vocal Album?", "What is the name of Taylor Swift's autobiographical single?", "When did Taylor Swift release her second studio album \"Fearless\"?", "What is the name of Taylor Swift's cat that often makes appearances in her music videos?", "How many times has Taylor Swift won a Billboard Music Award?", "Who does Taylor Swift collaborate with on her song \"Long Live\"?", "What music festival did Taylor Swift headline in 2012?", "Who is the guest vocalist on Taylor Swift's song \"Everything Has Changed\"?", "What is the name of the album Taylor Swift released in 2014?", "What is Taylor Swift's highest charting single on the UK Singles Chart?", "How many albums has Taylor Swift won Album of the Year Grammy Award for?", "How long has Taylor Swift been playing guitar?", "What album did Taylor Swift win the Grammy Award for Best Album of the Year?", "What celebrities has Taylor Swift been romantically linked to?", "What is the title of Taylor Swift's fifth studio album released in 2014?", "What animals appeared on the sleeve of Taylor Swift's second studio album?", "What musical genre did Taylor Swift experiment with on her Red album?", "Who did Taylor Swift collaborate with on her song \"I Knew You Were Trouble\"?", "What year did Taylor Swift win an MTV Video Music Award for Best Female Video?", "What is the title of Taylor Swift's single from her album 1989?", "Who did Taylor Swift perform with at her \"The 1989 World Tour\" concerts?", "What is Taylor Swift's favorite musical to watch?", "Who produced Taylor Swift's \"We Are Never Ever Getting Back Together\" single?", "What year did Taylor Swift release her fourth studio album \"Red\"?", "How many singles from her \"Speak Now\" album did Taylor Swift re-release as remixes?", "Which U.S. holiday special did Taylor Swift perform on in 2014?", "What makeup brand is Taylor Swift involved with?", "What year did Taylor Swift launch her philanthropic initiative?", "What video game did Taylor Swift make an appearance in?", "What record label did Taylor Swift sign with in 2005?", "What song did Taylor Swift perform with the band Funk Shui Project?", "Who did Taylor Swift collaborate with on the song \"The Story of Us\"?", "What was the title of Taylor Swift's first single?", "Who is Taylor Swift's agent?", "What type of clothing does Taylor Swift design for her clothing line?", "What is the name of Taylor Swift's line of hand-knit Christmas stockings?", "For what movie soundtrack did Taylor Swift record a song?", "What cover did Taylor Swift make for a Taylor Swift tribute album?", "What is the title of Taylor Swift's 2017 album?", "How many cancelled concerts of the \"Reputation Stadium Tour\" did Taylor Swift host?", "What songs has Taylor Swift written for other artists?", "What type of style does Taylor Swift have?", "Who is Taylor Swift's main collaborator?", "What items does Taylor Swift collect?", "What TV personality does Taylor Swift look up to?", "What magazine did Taylor Swift grace the cover of in 2020?", "What is Taylor Swift's highest-charting single?", "What is the first single from Taylor Swift's fourth studio album Red?", "What categories has Taylor Swift been nominated for in the Academy Awards?", "What is the title of Taylor Swift's first movie?", "What was the first stage of Taylor Swift's career?", "What year did Taylor Swift write her first song?", "What type of instruments does Taylor Swift play?", "What range is Taylor Swift's voice?", "How many siblings does Taylor Swift have?", "What other languages than English does Taylor Swift's music have?", "What movies has Taylor Swift produced?", "What is Taylor Swift's award-winning album?", "How many books has Taylor Swift written?", "In what year did Taylor Swift receive an Academy of Country Music Award?", "What is the name of Taylor Swift's current tour?", "How many solo tours has Taylor Swift been on?", "How many songs did Taylor Swift write for the movie The Hunger Games?", "What famous artist has Taylor Swift collaborated with?", "Has Taylor Swift ever been to the Super Bowl?", "What type of guitar does Taylor Swift use on stage?", "What guitar does Taylor Swift use for recording in the studio?", "What was the name of Taylor Swift's first headlining tour?", "What type of clothing does Taylor Swift design for her fashion line?", "How many Grammy wins does Taylor Swift have?", "What type of clothing line does Taylor Swift have?", "On what TV series did Taylor Swift have a guest star appearance?", "What type of music did Taylor Swift experiment with on her album 1989?", "Where was the first concert of the 1989 tour held?", "What charity is Taylor Swift affiliated with?", "What country did Taylor Swift go to with her Speak Now world tour?", "How many MTV Video Music Awards did Taylor Swift win in 2014?", "What year did Taylor Swift perform at the Academy Awards?", "What year did Taylor Swift release her self-directed documentary?", "Of what genre is Taylor Swift's Sixth studio album Lover?", "What is the title of the Taylor Swift's autobiographical single?", "What year did Taylor Swift appear as guest star on an episode of The Voice?", "What was Taylor Swift's first acting role?", "How old was Taylor Swift when she signed her first record deal?", "What year did Taylor Swift receive a Golden Globe nomination?", "What other platforms does Taylor Swift have than her social media accounts?", "What actress does Taylor Swift admire the most?", "What year did Taylor Swift first appear at a country music awards show?", "What year did Taylor Swift sign a new record deal with Universal?", "How many music videos has Taylor Swift released?", "What acting role Taylor Swift play in the movie Cats?", "How many music festivals has Taylor Swift headlined?", "How many awards has Taylor Swift won by the age of 25?", "What is the name of Taylor Swift's line of greeting cards?", "What are the titles of Taylor Swift's two Netflix docs?", "How many books has Taylor Swift released?", "What fragrance does Taylor Swift promote?", "What year and season did Taylor Swift host Saturday Night Live?", "What is the title of Taylor Swift's pop album released in 2012?", "What year did Taylor Swift win three AMA Awards for artist of the year?", "What year did Taylor Swift portray Caitlin?", "What year did Taylor Swift break a Guinness World Record for the most sold out shows?", "What year did Taylor Swift win the Music Innovator Award?", "What year did Taylor Swift perform at the Victoria's Secret Fashion Show?", "What year did Taylor Swift perform at the Nobel Peace Price Concert?", "For what single did Taylor Swift sing a duet with Justin Bieber?", "With whom did Taylor Swift collaborate on the song \"Holy Ground\"?", "What is the title of Taylor Swift's sixth studio album?", "What is the title of Taylor Swift's 2020 Christmas EP?", "What type of instrument did Taylor Swift learn to play on the \"Red\" album?", "What year did Taylor Swift become the youngest winner of the Country Music Association's Entertainer of the Year award?", "What was the first single from Taylor Swift's debut album?", "What is the title of Taylor Swift's best-selling song?", "What charity did Taylor Swift donate more than $4 million to?", "What year did Taylor Swift appear on the cover of Time magazine?", "How many singles from her Speak Now album did Taylor Swift re-record as acoustic versions?", "What beauty product does Taylor Swift promote?", "How many concerts did Taylor Swift add to her Speak Now tour?", "What year did Taylor Swift collaborate with Rick Rubin and Jeff Bhasker?", "What is the name of Taylor Swift's limited-edition apparel line?", "How many albums did Taylor Swift sell in the United States in 2010?", "What year did Taylor Swift form her own record label?", "How many Nominations did Taylor Swift receive at the 2016 Academy of Country Music Awards?", "What year did Taylor Swift tour with Kenny Chesney?", "What year did Taylor Swift win a Grammy Award for Best Pop Vocal Album?", "What year did Taylor Swift launch the Speak Now World Tour?", "How many singles did Taylor Swift release off of her Reputation album?", "What award did Taylor Swift win for her song \"Love Story\"?", "How old was Taylor Swift when she released her second album Fearless?", "What type of music did Taylor Swift produce on her album 1989?", "What year did Taylor Swift collaborate with Shania Twain?", "What year did Taylor Swift win her first Academy of Country Music Awards?", "What year did Taylor Swift win her first CMA Awards?", "What year did Taylor Swift become the youngest inductee into the Songwriters Hall of Fame?", "What year did Taylor Swift become the youngest person to be included in the Time 100 list of the world's most influential people?", "What year did Taylor Swift take the stage for the first time?", "What platforms does Taylor Swift use for her livestream concerts?", "What venture does Taylor Swift have with AT&T?", "What year did Taylor Swift become Goodwill Ambassador for UNICEF?", "What month and year did Taylor Swift release her seventh album folklore?", "What year did Taylor Swift open her own holiday store in New York City?", "What type of song was Taylor Swift's first single?", "How many CMAs did Taylor Swift win in 2014?", "Whose song did Taylor Swift write for the film The Hunger Games?", "What type of money does Taylor Swift endorse?", "What song did Taylor Swift dedicate to her parents at the Grammy Awards?", "What video game did Taylor Swift make an appearance in?", "What was Taylor Swift's second single from her fifth studio album?", "What year did Taylor Swift write and record her first song?", "What was Taylor Swift's third single from her fifth studio album?", "What year did Taylor Swift collaborate with Kendrick Lamar?", "What award did Taylor Swift win in 2017?", "What is the title of Taylor Swift's first song that was released to public?", "What was the name of Taylor Swift's 2020 summer tour?", "What year did Taylor Swift make a cameo in a Katy Perry music video?", "How many singles did Taylor Swift release from her \"Lover\" album?", "What year did Taylor Swift appear at the CMA Music Festival?", "What year did Taylor Swift win a Young Hollywood award?", "What is the title of Taylor Swift's single from her \"Lover\" album?", "What is the title of Taylor Swift's fan-favorite track from her \"Reputation\" album?", "What musical genre did Taylor Swift experimenting with on her fourth studio album?", "How many performances did Taylor Swift have on her 1989 World Tour?", "Who does Taylor Swift collaborate with on her song \"Back to December”?", "What popular clothing store did Taylor Swift shoot a commercial for?", "What year did Taylor Swift collaborate with Ed Sheeran?", "What color is Taylor Swift's hair on her album covers?", "What year did Taylor Swift win a Grammy for Best Country Album?", "What type of video game was Taylor Swift featured in?", "What year did Taylor Swift launch her own clothing and accessories line?", "What online store does Taylor Swift have?", "What year did Taylor Swift win a Golden Globe for Best Original Song?", "With whom did Taylor Swift collaborate on her song \"End Game\"?", "What year did Taylor Swift appear on the Grammys Red Carpet?", "What year did Taylor Swift collaborate with ZAYN?", "How many countries did Taylor Swift visit on the Speak Now world tour?", "What award did Taylor Swift win in 2014 and 2015?", "What year did Taylor Swift become Apple Music's first-ever Global Brand Ambassador?", "What is the title of Taylor Swift's first fragrance?", "What year did Taylor Swift perform at the Victoria's Secret Fashion Show?", "What year did Taylor Swift perform at the MTV Video Music Awards?", "What year did Taylor Swift contribute to Elton John's album?", "What year did Taylor Swift embark on the Red Tour?", "What year did Taylor Swift collaborate with Nicki Minaj?", "What year did Taylor Swift receive the Taylor Swift Prize from the Country Music Association?"], "fruits": ["Which country produces the most apples?", "Why do some airlines prevent you from flying with a durian?", "Which food, similar to a banana, is a staple in many countries?", "Which country produces the most apples?", "Why do some airlines prevent you from flying with a durian?", "Which food, similar to a banana, is a staple in many countries?", "Which country produces the most apples?", "Why do some airlines prevent you from flying with a durian?", "Which food, similar to a banana, is a staple in many countries?", "Which country produces the most apples?", "Why do some airlines prevent you from flying with a durian?", "Which food, similar to a banana, is a staple in many countries?", "Which country produces the most apples?", "Why do some airlines prevent you from flying with a durian?", "Which food, similar to a banana, is a staple in many countries?", "Which country produces the most apples?", "Why do some airlines prevent you from flying with a durian?", "Which food, similar to a banana, is a staple in many countries?", "Which country produces the most apples?", "Why do some airlines prevent you from flying with a durian?", "Which food, similar to a banana, is a staple in many countries?", "Which country produces the most apples?", "Why do some airlines prevent you from flying with a durian?", "Which food, similar to a banana, is a staple in many countries?", "Which country produces the most apples?", "Why do some airlines prevent you from flying with a durian?", "Which food, similar to a banana, is a staple in many countries?", "Which country produces the most apples?", "Why do some airlines prevent you from flying with a durian?", "Which food, similar to a banana, is a staple in many countries?", "Which country produces the most apples?", "Why do some airlines prevent you from flying with a durian?", "Which food, similar to a banana, is a staple in many countries?", "Which country produces the most apples?", "Why do some airlines prevent you from flying with a durian?", "Which food, similar to a banana, is a staple in many countries?", "Which country produces the most apples?", "Why do some airlines prevent you from flying with a durian?", "Which food, similar to a banana, is a staple in many countries?", "Which country produces the most apples?", "Why do some airlines prevent you from flying with a durian?", "Which food, similar to a banana, is a staple in many countries?", "Which country produces the most apples?", "Why do some airlines prevent you from flying with a durian?", "Which food, similar to a banana, is a staple in many countries?", "Which country produces the most apples?", "Why do some airlines prevent you from flying with a durian?", "Which food, similar to a banana, is a staple in many countries?", "Which country produces the most apples?", "Why do some airlines prevent you from flying with a durian?", "Which food, similar to a banana, is a staple in many countries?", "Which country produces the most apples?", "Why do some airlines prevent you from flying with a durian?", "Which food, similar to a banana, is a staple in many countries?", "Which country produces the most apples?", "Why do some airlines prevent you from flying with a durian?", "Which food, similar to a banana, is a staple in many countries?", "Which country produces the most apples?", "Why do some airlines prevent you from flying with a durian?", "Which food, similar to a banana, is a staple in many countries?", "How do you tell if an avocado is ripe?", "What is the difference between a fruit and a vegetable?", "What color is a ripe strawberry?", "How many calories are in an orange?", "How can you tell if a watermelon is ripe?", "What is the difference between a tangelo and a tangerine?", "Why is an apple a good snack choice?", "How do you make a mango smoothie?", "What is the difference between a sweet orange and a sour orange?", "How many types of apples are there?", "What is the world's most popular citrus fruit?", "What are the health benefits of eating grapefruit?", "What is the most acidic fruit?", "How does the sugar content in a fruit affect its taste?", "How do you tell if cantaloupe is ripe?", "Are lemons a good source of fiber?", "What is the difference between a pomegranate and a cranberry?", "What is the difference between a pear and an apple?", "How long is the shelf life of a banana?", "What is the best way to store apples?", "Are there any special health benefits associated with eating kiwis?", "What is the most common type of berry?", "Are bananas a better source of nutrition than apples?", "What type of fruits are recommended for a healthy diet?", "How long do berries last in the refrigerator?", "Are there any plants that can't produce fruits?", "What type of fruit can be harvested not just for eating, but for its medicinal value?", "What is the best way to juice a pineapple?", "How many calories per day is the recommended amount for eating fruits?", "How can you recognize a ripe apricot?", "Is there a way to tell the difference between watermelons that are ripe and unripe?", "What is the best way to store avocados?", "What is the difference between peaches and nectarines?", "Is it safe to eat an unripe banana?", "How is gooseberry different from other berries?", "What type of fruit juice is the healthiest to drink?", "Are clementines easier to peel than mandarins?", "Is it okay to freeze lemons and limes?", "Are there any health benefits to eating pears?", "Does the amount of acid in a fruit affect the flavor?", "How do you make a papaya smoothie?", "Is there any scientific evidence that bananas provide a natural energy boost?", "How do you recognize a ripe mango?", "How long do peaches stay fresh after they have been picked?", "What is the difference between a grapefruit and an orange?", "What is the least sweet fruit?", "Are there any health benefits to eating dried fruit?", "How many servings of fruit should you eat a day?", "What is the best way to store bananas?", "What does it mean when a fruit is referred to as \"heirloom\"?", "How do you pick a good melon?", "Is there a way to prevent apples from browning?", "What is the difference between a coconut and other fruits?", "Can different types of fruits be grown together in the same garden?", "What are the health benefits associated with eating pineapple?", "Why are oranges used in many fruit salads?", "Can tomatoes be classified as a fruit?", "How can you tell if plums are ripe?", "What is the most expensive fruit in the world?", "Is there a way to tell if cherries are sour or sweet?", "How does the ripeness of bananas affect their flavor?", "What are the health benefits associated with eating dates?", "How do you keep apples from bruising easily?", "Does the amount of sugar in a fruit affect its shelf life?", "What is the nutritional value of kiwi fruit?", "What is the difference between a pawpaw and a papaya?", "Are there any health benefits to eating grapefruit?", "Is there a way to tell if a grape is ripe?", "What is the most common type of melon?", "Does the amount of fiber in a fruit affect the taste?", "Are grapes a good source of vitamins and minerals?", "What is the difference between a lime and a lemon?", "How long can you store oranges before they go bad?", "How do fruits taste different from vegetables?", "What type of fruit is the best source of antioxidants?", "Does the amount of water in a fruit affect its taste?", "Are there any nutritional benefits to eating cranberries?", "How can you tell if a pomegranate is ripe?", "What is the difference between a pear and a nectarine?", "What is the difference between a persimmon and an apricot?", "How can you tell if a mango is ripe?", "What type of fruit is the most versatile?", "Is there a way to tell if a banana is overripe?", "How long can a banana be stored before it spoils?", "Is there a way to tell if an apple has gone bad?", "Are there any health benefits associated with eating figs?", "Is it okay to eat unripe fruits?", "What type of fruit is the sweetest?", "Are there any health benefits to eating berries?", "What is the best way to store berries?", "How can you tell when a melon is ripe?", "Is there any nutritional value in eating cucumbers?", "What type of fruit has the most antioxidants?", "What type of fruit is the most nutrient-dense?", "Are there any health benefits to eating raisins?", "How do you tell if a pineapple is ripe?", "How can you tell when an orange is ripe?", "What is the best way to use overripe bananas?", "How can you tell if peaches are ripe?", "What type of fruit has the most fiber?", "Are there any nutritional benefits to eating apples?", "How can you tell when plums are ripe?", "How can you tell if a pomegranate is fresh?", "What is the best way to store fresh fruit?", "What is the difference between a fruit and a berry?", "How do you peel a kiwi without cutting it?", "Is there a way to tell if a lemon is ripe?", "Are there any health benefits associated with eating mangoes?", "What type of fruits are high in calcium?", "What is the best way to store grapes?", "How long can lime juice stay fresh?", "Are there any health benefits associated with eating avocados?", "What type of fruit is the most flavorful?", "What is the difference between a grape and a raisin?", "What type of nutrition can be found in apricots?", "How can you make banana bread with ripe bananas?", "Are there any health benefits associated with eating cherries?", "Is there a difference between oranges and tangerines?", "What is the best way to make a fruit salad?", "What is the difference between a gala apple and a Granny Smith apple?", "What type of fruit is the best source of vitamin C?", "How do you tell if a papaya is ripe?", "What type of nutrition can be found in strawberries?", "Why are some fruits (such as kiwi) covered with hairs?", "How do you pick a ripe peach?", "Are there any health benefits associated with eating figs?", "How long do oranges last outside of the fridge?", "How can you tell when a watermelon is ripe?", "Is there any difference between a strawberry and a raspberry?", "What type of fruit is the best source of potassium?", "Can you grow fruits in pots?", "How can you tell if a date is ripe?", "How far away from each other should different types of fruits be grown?", "What is the best way to store an unripe mango?", "What is the best way to keep apples from going bad?", "Are there any health benefits associated with eating lemons?", "What type of nutrition can be found in pineapples?", "What type of fruits are the best source of iron?", "Are there any health benefits to eating persimmons?", "How do you tell when a cantaloupe is ripe?", "What type of nutrition can be found in raspberries?", "Does the color of a fruit affect its flavor?", "Is there any nutritional value in eating tomatoes?", "Are there any special storage requirements for keeping melons fresh?", "What type of nutrition can be found in olives?", "Is it possible to make a fruit cake without using any artificial ingredients?", "What type of nutrition can be found in bananas?", "Is there any nutritional value in eating peaches?", "What type of fruits are low in sugar?", "Are there any health benefits to eating pomegranates?", "How can you tell if a watermelon is overripe?", "What type of nutrition can be found in grapes?", "Is there a way to tell if a grapefruit is sweet or sour?", "Is there any nutritional value in eating oranges?", "How can you tell if a lime is ripe?", "Are there any health benefits associated with eating oranges?", "What type of nutrition can be found in figs?", "Is there any nutritional value in eating pineapples?", "What is the difference between a tangelo and an orange?", "What type of fruit can be eaten raw or cooked?", "What type of nutrition can be found in apples?", "Are there any health benefits to eating blueberries?", "Does the color of a fruit affect its nutritional value?", "What type of nutrition can be found in limes?", "How can you tell if a kiwi is overripe?", "Are there any health benefits to eating apples?", "What type of nutrition can be found in lemons?", "How can you tell when a cherries are ripe?", "Are there any health benefits associated with eating cucumbers?", "How can you tell when a cantaloupe is ready to be picked?", "What type of nutrition can be found in nectarines?", "Is there any nutritional value in eating pears?", "What type of fruits are high in Vitamin A?", "Are there any health benefits associated with eating cranberries?", "How do you tell if a durian is ripe?", "What type of nutrition can be found in mangoes?", "How can you tell when a date is ready to be harvested?", "Are there any health benefits associated with eating avocados?", "Can different types of fruits be used together in recipes?", "What is the difference between a banana and a plantain?", "Are there any health benefits associated with eating raspberries?", "How can you tell if a coconut is ripe?", "Are there any health benefits associated with eating apricots?", "What type of nutrition can be found in grapes?", "How can you tell if an unripe fruit is still good to eat?", "What type of nutrition can be found in peaches?", "Are there any health benefits associated with eating papayas?", "What type of nutrition can be found in pineapples?", "Are there any health benefits to eating melons?", "What type of nutrition can be found in strawberries?", "Is there a way to tell if a plum is ripe?", "What type of nutrition can be found in grapefruits?", "How can you tell if a persimmon is ripe?", "Are there any health benefits to eating watermelon?", "What type of nutrition can be found in blueberries?", "What type of nutrition can be found in blackberries?", "What type of nutrition can be found in grapes?", "How far away from each other should fruit trees be planted?", "Is there any nutritional value in eating olives?", "Are there any health benefits to eating plums?", "Is there any nutritional value in eating bananas?", "What type of fruits are high in Vitamin E?", "How can you tell if a fig is ripe?", "How does the sugar content of a fruit affect its flavor?", "Are there any health benefits to eating kiwifruits?", "What type of nutrition can be found in dates?", "What type of fruit is most often used in jams and preserves?", "Is there any nutritional value in eating pomegranates?", "Are there any health benefits associated with eating grapes?", "What type of nutrition is in a durian?", "How can you tell if a tangerine is ripe?", "Can you use overripe fruits in baking?", "Are there any health benefits associated with eating passion fruit?", "What type of nutrition can be found in currants?", "What type of nutrition can be found in cherries?", "How long can blueberries stay fresh in the refrigerator?", "How can you tell if a raspberry is ripe?", "What type of nutrition can be found in starfruit?", "What type of fruit is the most difficult to grow?", "What type of nutrition in a coconut?", "Are there any health benefits to eating bananas?", "How can you tell if an mango is still good to eat?", "Are there any health benefits associated with eating passionfruit?", "What type of nutrition can be found in cranberries?", "What is the best way to freeze fruits for later use?", "Are there any health benefits to eating blackberries?", "Is there any nutritional value in eating limes?", "What type of nutrition can be found in oranges?", "Is there any nutritional value in eating melons?", "How can you tell if a date is bad?", "What type of nutrition can be found in guavas?", "What is the best way to juice a grapefruit?", "What type of nutrition can be found in lemons?", "Are there any health benefits associated with eating olives?", "What type of nutrition can be found in figs?", "Are there any health benefits to eating starfruits?", "Are there any health benefits associated with eating dates?", "How can you tell if a grape is bad?", "What type of nutrition can be found in coconut?", "Are there any health benefits to eating currants?", "Can you use frozen fruits in place of fresh fruits in baking?", "Are there any health benefits associated with eating guavas?", "What type of fruits are high in Vitamin D?", "What type of nutrition can be found in avocados?", "Is there a way to tell if a kiwi is still edible?", "What type of fruits are high in Vitamin K?", "What type of nutrition is in a tangelo?"], "russia": ["When was the fall of the Soviet Union?", "How many timezones does the Trans-Siberian railway span?", "What is the name of the largest lake in Russia?", "When was the fall of the Soviet Union?", "How many timezones does the Trans-Siberian railway span?", "What is the name of the largest lake in Russia?", "When was the fall of the Soviet Union?", "How many timezones does the Trans-Siberian railway span?", "What is the name of the largest lake in Russia?", "When was the fall of the Soviet Union?", "How many timezones does the Trans-Siberian railway span?", "What is the name of the largest lake in Russia?", "When was the fall of the Soviet Union?", "How many timezones does the Trans-Siberian railway span?", "What is the name of the largest lake in Russia?", "When was the fall of the Soviet Union?", "How many timezones does the Trans-Siberian railway span?", "What is the name of the largest lake in Russia?", "When was the fall of the Soviet Union?", "How many timezones does the Trans-Siberian railway span?", "What is the name of the largest lake in Russia?", "When was the fall of the Soviet Union?", "How many timezones does the Trans-Siberian railway span?", "What is the name of the largest lake in Russia?", "When was the fall of the Soviet Union?", "How many timezones does the Trans-Siberian railway span?", "What is the name of the largest lake in Russia?", "When was the fall of the Soviet Union?", "How many timezones does the Trans-Siberian railway span?", "What is the name of the largest lake in Russia?", "When was the fall of the Soviet Union?", "How many timezones does the Trans-Siberian railway span?", "What is the name of the largest lake in Russia?", "When was the fall of the Soviet Union?", "How many timezones does the Trans-Siberian railway span?", "What is the name of the largest lake in Russia?", "When was the fall of the Soviet Union?", "How many timezones does the Trans-Siberian railway span?", "What is the name of the largest lake in Russia?", "When was the fall of the Soviet Union?", "How many timezones does the Trans-Siberian railway span?", "What is the name of the largest lake in Russia?", "When was the fall of the Soviet Union?", "How many timezones does the Trans-Siberian railway span?", "What is the name of the largest lake in Russia?", "When was the fall of the Soviet Union?", "How many timezones does the Trans-Siberian railway span?", "What is the name of the largest lake in Russia?", "When was the fall of the Soviet Union?", "How many timezones does the Trans-Siberian railway span?", "What is the name of the largest lake in Russia?", "When was the fall of the Soviet Union?", "How many timezones does the Trans-Siberian railway span?", "What is the name of the largest lake in Russia?", "When was the fall of the Soviet Union?", "How many timezones does the Trans-Siberian railway span?", "What is the name of the largest lake in Russia?", "When was the fall of the Soviet Union?", "How many timezones does the Trans-Siberian railway span?", "What is the name of the largest lake in Russia?", "What is the population of Moscow?", "How many rivers are in Russia?", "What is the national cuisine of Russia?", "What is the total area of Russia?", "What is the largest city in Russia?", "What is the currency used in Russia?", "What is the name of the official language of Russia?", "When did Russia gain its independence?", "What is the name of the presidential palace in Moscow?", "Who is the current Prime Minister of Russia?", "What is the official religion of Russia?", "What is the average temperature in winter in Moscow?", "What is the highest mountain in Russia?", "How many federal subjects does Russia have?", "What is the highest average monthly salary in Russia?", "How much of Russia's GDP comes from exports?", "What percentage of Russians speak English as a second language?", "What is the largest oil-producing region in Russia?", "What industries make up the largest share of Russia's GDP?", "What is the name of the longest canal in Russia?", "What is the most heavily populated region in Russia?", "What is the lowest recorded temperature in Siberia?", "How many UNESCO World Heritage Sites are located in Russia?", "How many nuclear power plants are located in Russia?", "What are the main religions practiced in Russia?", "Is Russia a member of the G20?", "What is the name of the Russian lower legislative house?", "How many time zones are there in Russia?", "What is the average number of days of sunshine per year in Russia?", "What is the highest mountain peak in Russia?", "What is the longest river in Russia?", "What ethnic groups form the largest population of Russia?", "What constitutional reform was implemented in Russia in 1993?", "How many natural reserves are located in Russia?", "What is the largest underwater cave system in Russia?", "What treaty was signed ending the Cold War between the US and Russia?", "How many national parks are there in Russia?", "Where is the oldest university in Russia located?", "What is the name of the Russian upper legislative house?", "What are some of the major foreign and domestic policies of the Russian government?", "What is the average life expectancy in Russia?", "What is the name of the Trans-Siberian Railway?", "What is the literacy rate in Russia?", "What is the status of LGBT rights in Russia?", "What city is the capital of Russia?", "What is the total official military strength of Russia?", "What is the most popular sport in Russia?", "What is the visa policy of Russia for foreign nationals?", "What is the name of the main satellite launched by Russia in the 1960s?", "What is the name of the space station created by the Soviet Union in 1971?", "How many World Heritage Sites are located in Russia?", "What is the population of Russia in 2020?", "How much foreign direct investment does Russia receive annually?", "Who is the current president of Russia?", "What percentage of Russians are affiliated with the Russian Orthodox Church?", "What are some of the main conflicts and disputes between Russia and its neighbors?", "How many active military personnel does Russia have?", "How many border countries does Russia have?", "What is the difference between the official languages and dialects spoken in Russia?", "What is the status of political parties in Russia?", "What is the legal drinking age in Russia?", "What significant world event happened when Mikhail Gorbachev was in power in the Soviet Union?", "What is the average monthly salary in Russia?", "What are the unofficial national symbols of Russia?", "What is the average monthly cost of living in Russia?", "What is the average monthly rent in Moscow?", "How many regional governments does Russia have?", "How much of Russia is included in the European Union?", "What is the main religion practiced in Russia?", "What are the main challenges facing the Russian economy?", "What is the political structure of Russia?", "What is the history of the Russian Orthodox Church?", "What is the highest populated city in Russia?", "How many cities are in Russia?", "How many UNESCO Biosphere Reserves are located in Russia?", "What is the education system in Russia?", "What is the current status of Russia's nuclear disarmament program?", "How much of the Russian population is living in poverty?", "How much of Russia's imports come from the European Union?", "How many airports are located in Russia?", "What is the cost of living in St. Petersburg?", "How do Russians view the issues of corruption and government transparency?", "What is the basic structure of the Russian government?", "What are the main challenges faced by the Russian military?", "What is the difference between a city and a town in Russia?", "How many national holidays are celebrated in Russia?", "What are the most popular tourist destinations in Russia?", "What is the process for obtaining a visa for travel to Russia?", "What is the average classroom size in Russian schools?", "What are the main cultural exports of Russia?", "What percentage of the land in Russia is covered in forests?", "What are some of the main challenges faced by the Russian education system?", "How much of Russia's population lives in rural areas?", "What percentage of Russia's population is female?", "What are the main sources of energy used in Russia?", "How has Russia's economy been affected by sanctions?", "How have Russia's relations with Belarus changed over time?", "What is the current state of Russia's foreign policy?", "What is the official motto of the Russian Federation?", "How much of the Russian population is considered to be living in poverty?", "Where is the world's deepest lake located in Russia?", "What is the average wage for a typical job in Russia?", "How has the internet impacted the Russian population?", "What type of music is popular in Russia?", "What is the average cost of a home in Russia?", "What is the difference between the central and local government in Russia?", "What are the main challenges facing Russia's healthcare system?", "What are the main roles and responsibilities of Russia's police force?", "What is the status of the military conflict in eastern Ukraine?", "What is the process for obtaining a work visa for Russia?", "What is the impact of the Russian political system on citizens’ civil rights?", "How has the fall of the Soviet Union impacted Russia's politics?", "What is the status of environmental protection in Russia?", "What is the crime rate in Russia?", "What is the current state of the Russian automotive industry?", "What is the average price of a restaurant meal in Russia?", "How has Russia's internet censorship changed over time?", "How has the economy of Russia been impacted by the sanctions imposed by the EU and US?", "What are the main areas of research and development in Russia?", "What are the main religious holidays celebrated in Russia?", "How has Russian culture evolved over time?", "What are the main environmental concerns facing Russia?", "What is the main source of electrical energy in Russia?", "What are the unique characteristics of Russian architecture?", "What are the traditional cuisine and cultural practices of Russia?", "What are the main language requirements to be accepted into a university in Russia?", "What is the impact of emigration and immigration on Russia?", "What is the average cost of living in Russia?", "How much of Russia's GDP is derived from the oil and gas industry?", "What is the average salary for a public service employee in Russia?", "What are the main aspects of Russian culture and art?", "What are the main branches of the Russian government?", "How has the internet impacted Russia's economy and society?", "How has Russian literature developed over the centuries?", "What is the main source of communication for the Russian population?", "What are the religious practices for various faiths in Russia?", "What are the main challenges and opportunities for entrepreneurs in Russia?", "How has the Russian economy changed over the past 20 years?", "What is the process for obtaining a passport in Russia?", "What are the main elements of the Russian legal system?", "What is the impact of corruption on the Russian economy?", "Are there any restrictions on media outlets operating in Russia?", "How have Russia's relations with the European Union changed over time?", "What is the impact of sanctions on Russia?", "How has energy security changed in Russia over the past two decades?", "What are the main economic sectors in Russia?", "What is the main source of income for the Russian population?", "How much of the Russian population is living in urban areas?", "What intelligence activities are conducted by the Russian security services?", "How has the population of Russia changed over time?", "What is the role of the Russian judiciary in upholding the law?", "What educational opportunities are available in Russia?", "How has the growth of the digital economy impacted the Russian population?", "What are the main challenges facing Russia's space industry?", "What human rights issues are associated with the Russian government?", "What is the status of women's rights in Russia?", "How has Russia's military technology developed over time?", "What are the major political issues in Russia?", "What is the average commute time in Russia?", "How much of Russia's land is protected from commercial development?", "How does Russia's taxation system compare to other countries?", "What are the major international disputes between Russia and other countries?", "How does the process of court appeals work in Russia?", "How has the political landscape in Russia changed over the past decade?", "What is the role of the Moscow City Government?", "What is the most popular form of entertainment in Russia?", "What are the environmental regulations in Russia?", "How has the healthcare system in Russia evolved over the past two decades?", "What are the main aspects of the judicial system in Russia?", "What are the main questions concerning the federal budget of Russia?", "How many countries share a border with Russia?", "How has the Russian economy been impacted by the coronavirus pandemic?", "How does the Russian government manage its foreign currency reserves?", "What are the main sports teams in Russia?", "How has the Russian space industry evolved over the years?", "What is the average cost of public transportation in Russia?", "What is the average cost of a telephone or mobile phone in Russia?", "How has the Internet impacted the Russian population's access to information?", "What is the average cost of living in St. Petersburg?", "What is the percentage of Russian citizens who are registered to vote?", "What is the official title of the head of state in the Russian government?", "How has Russia's relations with the United States changed over the past decade?", "What are the main components of the Russian government's economic policy?", "What is the largest park in Russia?", "What is the average cost of an international flight from Russia?", "What are the official laws regarding the use of drugs in Russia?", "How has the prevalence of organized crime changed in Russia over time?", "What kind of climate is in Russia?", "What is the average cost of a meal at a sit-down restaurant in Russia?", "What is the process for obtaining a driver's license in Russia?", "What are the main maritime resources of Russia?", "How does the process of electing judges work in Russia?", "What are the main sources of renewable energy in Russia?", "What are the differences in the education systems of Russia and other countries?", "What is the Russian judicial system like?", "What types of art are popular in Russia?", "Who can vote in the Russian federal elections?", "What are the main trade agreements between Russia and other countries?", "What is the main source of news and information in Russia?", "How has the Russian economy been impacted by population changes?", "What are the main minerals and ores extracted in Russia?", "How many presidents has Russia had since the fall of the Soviet Union?", "What is the main source of entertainment programming in Russia?", "What are the main differences between the various parties in Russia's political system?", "What are the main criminal laws that apply in Russia?", "What is the process for applying for a visa to enter Russia?", "How has the Russian military evolved over the decades?", "How does the Russian government manage its public debts?", "Is healthcare free or subsidized in Russia?", "What is the average cost of groceries in Russia?", "How has the Russian economy been impacted by a changing global economy?", "What type of consumer protection laws govern the Russian market?", "What are the main technological advances in Russia in recent years?", "How has the Russian media landscape changed over the past twenty years?", "What is the impact of Russian civil society on the government?", "What rights and benefits are extended to citizens in Russia?", "What is the process of forming political parties in Russia?", "What is the average cost of housing in Russia?", "How much of the Russian population speaks English as a second language?", "How does the Russian government compensate for the cost of living in rural areas?", "What is the main source of employment for the Russian population?", "What are the main differences between Russian and American culture?", "How has the infrastructure in Russia changed over the past century?", "What is the main source of electricity in Russia?", "What internet services are available in Russia?", "What is the Russian government's approach to forming international alliances?", "What kind of tourism is available in Russia?", "How has the healthcare system in Russia changed over the past two decades?", "What is the importance of military service in Russia to its citizens?", "How does the process of electing local government officials work in Russia?", "What sources of energy power the Russian economy?", "What are the main goals of foreign policy for the Russian government?", "How has Russia's economy changed since the collapse of the Soviet Union?", "Are there any formal regulations governing the environmental policies in Russia?", "What type of protection is available to victims of crime in Russia?", "What are the main duties and responsibilities of the Russian Armed Forces?", "Are there any restrictions on the freedom of speech in Russia?", "How has the media landscape in Russia been affected by the internet?", "What is the main source of regulation for the banking sector in Russia?", "What is the status of wildlife conservation efforts in Russia?", "What is the process for obtaining a business visa for travel to Russia?", "What are the main differences between the various levels of the Russian government?", "What are the main concerns regarding the rights of migrant workers in Russia?", "How has the industrial sector in Russia changed over the past decade?", "What are the main aspects of the healthcare system in Russia?", "What is the main source of revenue for the Russian government?", "How does the Russian government ensure economic growth and stability?"], "shakespeare": ["How did the characters in Romeo and Juliet kill themselves?", "What is the name of the play where the main character says \"To be or not to be\"?", "In what year did Shakespeare die?", "How did the characters in Romeo and Juliet kill themselves?", "What is the name of the play where the main character says \"To be or not to be\"?", "In what year did Shakespeare die?", "How did the characters in Romeo and Juliet kill themselves?", "What is the name of the play where the main character says \"To be or not to be\"?", "In what year did Shakespeare die?", "How did the characters in Romeo and Juliet kill themselves?", "What is the name of the play where the main character says \"To be or not to be\"?", "In what year did Shakespeare die?", "How did the characters in Romeo and Juliet kill themselves?", "What is the name of the play where the main character says \"To be or not to be\"?", "In what year did Shakespeare die?", "How did the characters in Romeo and Juliet kill themselves?", "What is the name of the play where the main character says \"To be or not to be\"?", "In what year did Shakespeare die?", "How did the characters in Romeo and Juliet kill themselves?", "What is the name of the play where the main character says \"To be or not to be\"?", "In what year did Shakespeare die?", "How did the characters in Romeo and Juliet kill themselves?", "What is the name of the play where the main character says \"To be or not to be\"?", "In what year did Shakespeare die?", "How did the characters in Romeo and Juliet kill themselves?", "What is the name of the play where the main character says \"To be or not to be\"?", "In what year did Shakespeare die?", "How did the characters in Romeo and Juliet kill themselves?", "What is the name of the play where the main character says \"To be or not to be\"?", "In what year did Shakespeare die?", "How did the characters in Romeo and Juliet kill themselves?", "What is the name of the play where the main character says \"To be or not to be\"?", "In what year did Shakespeare die?", "How did the characters in Romeo and Juliet kill themselves?", "What is the name of the play where the main character says \"To be or not to be\"?", "In what year did Shakespeare die?", "How did the characters in Romeo and Juliet kill themselves?", "What is the name of the play where the main character says \"To be or not to be\"?", "In what year did Shakespeare die?", "How did the characters in Romeo and Juliet kill themselves?", "What is the name of the play where the main character says \"To be or not to be\"?", "In what year did Shakespeare die?", "How did the characters in Romeo and Juliet kill themselves?", "What is the name of the play where the main character says \"To be or not to be\"?", "In what year did Shakespeare die?", "How did the characters in Romeo and Juliet kill themselves?", "What is the name of the play where the main character says \"To be or not to be\"?", "In what year did Shakespeare die?", "How did the characters in Romeo and Juliet kill themselves?", "What is the name of the play where the main character says \"To be or not to be\"?", "In what year did Shakespeare die?", "How did the characters in Romeo and Juliet kill themselves?", "What is the name of the play where the main character says \"To be or not to be\"?", "In what year did Shakespeare die?", "How did the characters in Romeo and Juliet kill themselves?", "What is the name of the play where the main character says \"To be or not to be\"?", "In what year did Shakespeare die?", "How did the characters in Romeo and Juliet kill themselves?", "What is the name of the play where the main character says \"To be or not to be\"?", "In what year did Shakespeare die?", "In what language was most of Shakespeare's work written?", "What is the title of the first play ever written by Shakespeare?", "What was the setting of Macbeth?", "Who was Shakespeare's longest-running collaborator?", "What is the name of the tragedy in which a prince avenges the death of his father?", "What is the name of the protagonist in The Tempest?", "How did Lady Macbeth die?", "What are the three witches in Macbeth known as?", "How many sonnets did Shakespeare write?", "What is the title of the first scene in Romeo and Juliet?", "How many acts were in Romeo and Juliet?", "Who plays the role of Orlando in As You Like It?", "Who wrote the prologue of Romeo and Juliet?", "What is the group of mechanicals in A Midsummer Night's Dream known as?", "What is the longest play written by Shakespeare?", "Who are the two main characters in Hamlet?", "What is the title of the comedy in which two pairs of lovers are caught up in a trickery?", "Who is the ghost in Hamlet?", "What does the Friar say to Romeo when he sees Juliet dead from drinking the poison?", "What is the name of the Fool in The Merry Wives of Windsor?", "What is the name of the play where Beatrice and Benedick banter?", "How many works is Shakespeare credited with writing?", "Who plays the role of Juliet in Romeo and Juliet?", "What line spoken by a character in Macbeth has become widely known?", "What are Titania and Oberon known as in A Midsummer Night's Dream?", "What is the setting of the play The Marriage of Figaro?", "Who is the only character to appear in every one of Shakespeare's plays?", "Who wrote the play The Tragedy of King Richard the Second?", "Who are the two main characters in Julius Caesar?", "What is the title of the play that is considered by many to be Shakespeare's last great play?", "What is the title of the play where a medieval knight attempts to win a tournament held by an evil lord?", "Who is the playwright that is often referred to as the bard of Avon?", "What is the name of the playwrights that worked with Shakespeare to create some of his plays?", "What is the title of the play that tells the story of a hero who is transformed into a beast?", "What is the title of the poem that ponders mortality and the human experience?", "What is the title of the play where a duke's daughter controls the action?", "Who is the protagonist of The Taming of the Shrew?", "Who is Iago helping in Othello?", "What is the title of the play that is set in Illyria and is a story of unrequited love?", "Who is the villain in Richard III?", "What is the title of the play that tells the story of a Moorish general falsely accused of betraying his city?", "What are the two main characters in The Two Gentlemen of Verona?", "Who is the protagonist of The Merchant of Venice?", "What is the title of the play that follows the fortunes of two sets of identical twins?", "What is the title of the play that delves into the nature of humanity?", "Who are the three witches in Macbeth?", "Who is the King of England in Henry V?", "What is the title of the play that tells a timeless story of adolescent longing?", "Who are the two main characters in King Lear?", "What is the title of the tragedy in which the lead character falls in love with an unwitting woman?", "Who is the lead character in Othello?", "What is the title of the play that focuses on the conflict between love and duty?", "What is the title of the play that explores the corrupting power of the supernatural?", "Who is the protagonist of The Winter's Tale?", "What is the name of the play with an otherworldly setting and a protagonist who seeks truth and justice?", "What is the title of the play that tells the story of an ambitious politician who will do anything to gain power?", "What is the title of the play in which a woman takes control of her fate after the death of her husband?", "Who is the lead character in As You Like It?", "What is the title of the play that features a potential beheading of a Scottish noble?", "Who is the villain in Measure for Measure?", "In what year was Henry V first performed?", "What is the title of the play that features a confrontation between two young women?", "What is the title of the play that examines the consequences of ambition and power?", "What is the title of the revenge play in which a knight sets out to avenge the death of his father?", "Who plays the role of Polonius in Hamlet?", "Who is the prince that eventually saves Denmark in Hamlet?", "What is the title of the play where Antonio loses his wealth and his friend Bassanio turns to a Jewish moneylender for help?", "What are the two main characters in Antony and Cleopatra?", "Who is the protagonist of Coriolanus?", "What is the title of the comedy in which King Henry fails to reunite with his estranged sons?", "What are the two main characters in Much Ado About Nothing?", "What is the title of the pastoral comedy in which young lovers cross dress and roles are reversed?", "Who plays the role of the Ghost in Hamlet?", "What is the title of the play in which a prince's spirit attempts to restore his father's throne?", "What is the name of the nurse in Romeo and Juliet?", "What is the title of the play in which a duke is tempted by a duplicitous courtier?", "Who is the protagonist of The Tragedy of Julius Caesar?", "What is the title of the enigmatic play in which a group of courtiers examine their relationships?", "Who is the antagonist in Macbeth?", "Who is the protagonist of The Comedy of Errors?", "What is the title of the play in which a duke faces a humanistic dilemma?", "Who is the villain in Titus Andronicus?", "What is the title of the play with a comic dual between a young man and woman?", "Who are the two main characters in Twelfth Night?", "Who is the antagonist in The Moral of the Merchant of Venice?", "Who is the protagonist of Cymbeline?", "What is the title of the play in which Evenus falls in love with his enemy's daughter?", "What is the title of the play in which a servant is tricked into believing his master is slaughtered?", "What is the title of the play in which Lysander and Demetrius are both in love with Hermia?", "What is the title of the play in which a king attempts to unearth a conspiracy by any means necessary?", "Who is the protagonist of Love's Labour's Lost?", "How many characters are in A Midsummer Night's Dream?", "Who is the lead character of Pericles?", "What is the title of the tragedy in which a man's fate is intertwined with the fall of a once-great Empire?", "Who plays the role of Henry IV in the play Henry IV Part 1?", "Who are the two main characters in All's Well That Ends Well?", "What is the title of the play in which four lovers encounter obstacles to their union?", "Who is the protagonist of The Taming of The Shrew?", "What is the title of the play in which a man is wrongfully accused of stealing a ship?", "What is the name of the play in which a gruesome curse is placed on two proud and arrogant sisters?", "Who is the protagonist of Troilus and Cressida?", "Who are the two main characters in The Merry Wives of Windsor?", "What is the title of the play in which a storm is conjured up to shipwreck the characters?", "What is the title of the play in which a man is driven to madness by a fiendish plot?", "What is the title of the play in which a Roman General meets his end because of his own pride?", "What is the name of the play in which courageous warriors fight for a woman?", "Who is the protagonist of The Three Musketeers?", "What is the title of the comedy in which a doctor attempts to cure a king's melancholy?", "Who are the two main characters in Timon of Athens?", "Who is the protagonist of Measure for Measure?", "What is the title of the tragedy in which a father is forced to watch his own sons fight each other?", "What is the title of the play in which a king devises a play to test his daughter's loyalty?", "What is the title of the tragedy in which a woman is wrongly accused of infidelity?", "What is the title of the play in which a young prince vows to save the honor of a Duke's daughter?", "What is the title of the play in which three sons fight for the post of emperor?", "Who are the two main characters in Henry IV Part 1?", "Who is the protagonist of The Two Gentlemen of Verona?", "What is the title of the play in which two Italian brothers cross paths with a beautiful princess?", "Who are the two main characters in The Winter's Tale?", "Who is the protagonist of Henry VI Part 1?", "What is the title of the tragedy in which a man turns against his own brother to gain power?", "What is the title of the play in which a husband is executed without trial before being pardoned by a king?", "Who is the protagonist of Julius Caesar?", "What is the title of the play that tells a story of love, envy and deception?", "What is the title of the comedy in which two young couples confuse each other with their devious plans?", "What is the title of the revenge play in which a prince seeks revenge for his father's murder?", "What is the title of the play in which a courtesan falls in love with a naive young man?", "Who is the protagonist of Titus Andronicus?", "What is the title of the play in which a hero is banished from his kingdom by a tyrant?", "Who are the two main characters in As You Like It?", "What is the title of the play in which a madman challenges the gods for control of Athens?", "Who is the protagonist of Macbeth?", "What is the title of the tragedy in which a Roman general goes against the wishes of the senate?", "What is the title of the play in which an old man is banished by his son and goes in search of adventure?", "Who are the two main characters in King John?", "What is the title of the play in which two sets of brothers fight over the throne of Thebes?", "Who plays the role of Isabella in Measure for Measure?", "What is the title of the play in which two friends attempt to rescue a man who has been sent abroad by a princess?", "What is the title of the play that tells the story of a forbidden love triangle?", "Who is the protagonist of Anthony and Cleopatra?", "Who is the protagonist of Love's Labour's Lost?", "What is the title of the play in which a woman returns from her father's deathbed to lead her people in the face of adversity?", "What is the title of the play that tells the story of the treacherous relationships between a husband and wife?", "Who is the lead character in The Merry Wives of Windsor?", "What is the title of the comedy in which a travelling player encounters a rival?", "Who is the protagonist of Coriolanus?", "What is the title of the play in which two noblemen battle for the love of a woman?", "Who is the antagonist in Pericles?", "What is the title of the play in which a duke falls in love with a courtesan?", "What is the title of the play in which a witch guides an old man to a cure for his blindness?", "Who are the two main characters in A Comedy of Errors?", "What is the title of the play in which a powerful ruler is seduced by an exotic queen?", "Who is the protagonist of The Tragedy of King Lear?", "What is the title of the play in which two friends compete for the hand of a rich heiress?", "Who is the protagonist of Much Ado About Nothing?", "What is the title of the play in which a young woman embarks on a quest to find her family?", "Who is the witch in Macbeth?", "What is the title of the play in which a banished nobleman attempts to reclaim his inheritance?", "Who is the antagonist in All's Well That End's Well?", "What is the title of the play in which a prince searches for identity?", "Who is the protagonist of Henry VI Part 3?", "What is the title of the play in which a young girl is forced to choose between two suitors?", "Who are the two main characters in Troilus and Cressida?", "What is the title of the play that tells the story of two star-crossed lovers?", "Who is the protagonist of The Winter's Tale?", "What is the title of the play in which a young man seeks a father figure?", "Who is the antagonist in Julius Caesar?", "What is the title of the play in which fate is pitted against a man of high moral standards?", "Who are the two main characters in Othello?", "What is the title of the play in which a leader attempts to save his city from destruction?", "Who is the lead character of The Tempest?", "What is the title of the tragedy in which two sets of brothers battle for a kingdom?", "Who are the two main characters in Cymbeline?", "What is the title of the play in which a daughter seeks revenge upon her father's murderer?", "Who is the protagonist of Hamlet?", "What is the title of the play in which a priest reconciles a young woman to her rightful suitor?", "Who is the lead character in King John?", "What is the title of the play in which a woman is taken against her will to a foreign court?", "Who is the protagonist of The Taming of the Shrew?", "What is the title of the play in which a woman is caught between the demands of her heart and the law?", "Who is the lead character in The Merchant of Venice?", "What is the title of the play in which two friends are caught up in a plot of betrayal and bloodshed?", "Who is the lead character in Love's Labour's Lost?", "What is the title of the play in which a daughter's fate rests upon her dowry?", "Who are the two main characters in Timon of Athens?", "What is the title of the play in which a young girl seeks out adventure and finds it in disguise?", "Who is the protagonist of The Two Noble Kinsmen?", "What is the title of the tragedy in which two unlikely women join forces to bring an end to resentment and suffering?", "Who is the antagonist in The Tragedy of King Richard the Second?", "What is the title of the play in which an ill-fated couple's love is threatened by fate and society?", "Who are the two main characters in Pericles?", "What is the title of the play in which a duke is forced to face a tyrant?", "Who is the protagonist of The Moral of the Merchant of Venice?", "What is the title of the play in which a group of disguised courtiers search for love and adventure?", "Who is the lead character in Henry IV Part 2?", "What is the title of the play in which a young man despairs over the consequences of his actions?", "Who are the two main characters in The Three Musketeers?", "What is the title of the comedy in which a father is deceived into believing his daughter is dead?", "Who is the protagonist of The Tragedy of King Richard III?", "What is the title of the revenge play in which a prince seeks justice for his father's murder?", "Who are the two main characters in The Comedy of Errors?", "What is the title of the play in which a couple attempt to reunite after a series of unfortunate events?", "Who is the protagonist of All's Well That Ends Well?", "What is the title of the play in which a man is tricked into betraying his master?", "Who is the lead character in The Tragedy of Henry VI Part III?", "Who are the two main characters in The Tragedy of Romeo and Juliet?", "What is the title of the play in which a woman's denouncement of a jealous husband sparks a feud?", "Who is the protagonist of The Tragedy of Antony and Cleopatra?", "What is the title of the tragedy in which 4 generations of English kings battle for the throne?", "Who are the two main characters in A Midsummer Night's Dream?", "What is the title of the play in which a young king is convinced to take vengeance against his father's enemies?", "Who is the antagonist in The Taming of the Shrew?", "What is the title of the comedy in which two competing suitors try to win the affections of a beautiful woman?", "Who are the two main characters in The Comedy of Errors?", "What is the title of the play that involves a ill-fated relationship between a patriarch and his daughters?", "Who is the antagonist in The Merchant of Venice?", "What is the title of the play in which a group of desperate conspirators attempt to assassinate a ruler?", "Who are the two main characters in Measure Measure?", "What is the title of the play in which a Spanish prince embarks on an epic quest for fame?", "Who is the antagonist in Othello?", "What is the title of the play in which a daughter's affection for her father's enemy starts a family feud?", "Who are the two main characters in Henry V?", "What is the title of the play in which his past threatens to destroy a man's prospects with a princess?", "Who is the lead character in The Two Noble Kinsmen?", "What is the title of the play in which a lost heir is reunited with his father despite his enemies' efforts?", "Who are the two main characters in Pericles?", "What is the title of the play in which a cowardly knight is tested by a giant?", "Who is the protagonist of The Tragedy of King Richard the Third?", "What is the title of the play in which a young man is seduced by an older woman?", "Who are the two main characters in Timon of Athens?", "Who are the two main characters in Love's Labour's Lost?", "What is the title of the play in which twins are separated in infancy and reunited in adulthood?", "Who is the protagonist of Timon of Athens?", "What is the title of the comedy in which a daring young man wins all the women he desires?", "Who are the two main characters in Henry VI Part 2?", "What is the title of the play in which a jealous wife arranges her husband's death?", "Who is the protagonist of The Merchant of Venice?", "What is the title of the play in which a duke attempts to restore harmony to his court?", "Who are the two main characters in Much Ado About Nothing?", "What is the title of the play in which a man seeks revenge for an injustice?", "Who is the lead character in The Two Gentlemen of Verona?", "What is the title of the play in which two families are feuding and a banished son returns to restore peace?", "Who is the protagonist of The Tragedy of King Richard the Second?", "What is the title of the play in which a woman turns against her husband and plots his death?", "Who are the two main characters in Twelfth Night?", "What is the title of the play in which a jester takes justice into his own hands?", "Who is the protagonist of Henry IV Part 2?"], "board games": ["How many squares are there on a chess board?", "Name one of the characters from Clue?", "Who invented Monopoly?", "How many squares are there on a chess board?", "Name one of the characters from Clue?", "Who invented Monopoly?", "How many squares are there on a chess board?", "Name one of the characters from Clue?", "Who invented Monopoly?", "How many squares are there on a chess board?", "Name one of the characters from Clue?", "Who invented Monopoly?", "How many squares are there on a chess board?", "Name one of the characters from Clue?", "Who invented Monopoly?", "How many squares are there on a chess board?", "Name one of the characters from Clue?", "Who invented Monopoly?", "How many squares are there on a chess board?", "Name one of the characters from Clue?", "Who invented Monopoly?", "How many squares are there on a chess board?", "Name one of the characters from Clue?", "Who invented Monopoly?", "How many squares are there on a chess board?", "Name one of the characters from Clue?", "Who invented Monopoly?", "How many squares are there on a chess board?", "Name one of the characters from Clue?", "Who invented Monopoly?", "How many squares are there on a chess board?", "Name one of the characters from Clue?", "Who invented Monopoly?", "How many squares are there on a chess board?", "Name one of the characters from Clue?", "Who invented Monopoly?", "How many squares are there on a chess board?", "Name one of the characters from Clue?", "Who invented Monopoly?", "How many squares are there on a chess board?", "Name one of the characters from Clue?", "Who invented Monopoly?", "How many squares are there on a chess board?", "Name one of the characters from Clue?", "Who invented Monopoly?", "How many squares are there on a chess board?", "Name one of the characters from Clue?", "Who invented Monopoly?", "How many squares are there on a chess board?", "Name one of the characters from Clue?", "Who invented Monopoly?", "How many squares are there on a chess board?", "Name one of the characters from Clue?", "Who invented Monopoly?", "How many squares are there on a chess board?", "Name one of the characters from Clue?", "Who invented Monopoly?", "How many squares are there on a chess board?", "Name one of the characters from Clue?", "Who invented Monopoly?", "What color is the \"Go\" space on a Monopoly board?", "What is the goal in Checkers?", "What is the longest running board game in the world?", "How many pieces are in a standard Backgammon set?", "What other board game is known as ‘Tabula’?", "How many dice are rolled in a game of Yahtzee?", "What is the most popular form of Chess?", "In the game of Risk, what coloured piece is the strongest?", "In playing a game of Scrabble, which letter gives you the most points?", "What is the difference between a board game and a card game?", "What was the first board game invented?", "What is the difference between a Strategy game and a Tactical game?", "What is the objective of the game Risk?", "How many pieces are in a standard chess set?", "What is the name of the world's most popular board game?", "What is a game of Scrabble most commonly used for?", "Name one of the six categories of trivia on a Trivial Pursuit board?", "What is the name of the classic board game involving plastic spaceships and a hexagonal board?", "What is the aim of the board game Stratego?", "What is the earliest known board game dating back to 2000BC?", "Name one of the most popular table top war games?", "What game is usually played with wooden pieces in the shape of cats, dogs, rabbits, and foxes?", "What type of game is Go?", "What is the traditional children's game of Ludo often known as?", "In Star Trek: The Next Generation, what game was introduced as 'the classic non-linear, non-deterministic game of intergalactic strategy'?", "How many triangles are there in a Trivial Pursuit board?", "How many cards does a standard deck of deck for Uno contain?", "What is the oldest game still regularly played today?", "How many pieces does a player have in a classic game of Chinese Checkers?", "Name the most popular dice game in the world?", "What is the name of the commercially successful dice-rolling game involving marble-bumping?", "Name one of the best-selling board game of all time?", "What was the board game-themed party game that was released by EA in 1990?", "Name one of the two original founders of Ravensburger Games?", "What was the first game devised by Parker Brothers that was aimed at adult players rather than children?", "What type of game is 'The Settlers of Catan'?", "Name one of the three most popular licensed Monopoly themes?", "What is the name of the Harry Potter themed board game?", "Name one of the four skills that the game Trivial Pursuit aims to test?", "In Chess, what type of piece is allowed to jump over other pieces?", "Name one of two main game variations of the game Reversi?", "What is the name of the church based game often referred to as an 'evolutionary form of backgammon'?", "In which country did the game Mancala originate?", "Name one of the pieces in the game of Chutes and Ladders?", "What is the longest running role-playing game?", "How many squares are there on a standard Go board?", "What is the name of the trading game based on entering and gaining control of the Old West's territories?", "Name one of the two main strategies for playing the game Othello?", "How many pieces does each player get in a game of Chinese Checkers?", "What is the classic eight-player game starring four legendary heroes and four magical wizards?", "What is the name of the RPG board game based on the popular video game series?", "What is the maximum number of players in a game of Pictionary?", "What type of pieces are used in the game Trouble?", "What is the name of the game in which players move their pieces around a shaped track in a clockwise direction?", "What type of game is Taboo?", "What is the most popular version of Scrabble in North America?", "What type of game is 'The Game of Life'?", "Name one of the four categories in Trivial Pursuit?", "What type of game is Battleship?", "Name one of the two predominant strategies for playing the game Risk?", "Name one of the four game modifiers in Settlers of Catan?", "How many cards are drawn in the beginning of a game of Monopoly?", "Name one of the most popular versions of Monopoly?", "What is the average time to finish a game of Clue?", "Name one of the four different colours used in Trivial Pursuit?", "How many pieces are there in a set of Pachisi?", "Who invented Scrabble?", "What is the aim of the board game Jenga?", "Name one of the two components that make up a chessboard?", "Name one of the several possible objectives for Monopoly?", "What is the name of the ancient Asian board game that originated in India and is said to have been developed over two millennia ago?", "In a game of Scrabble, how many tiles does each player receive?", "What is the name of the game that is a variation of the classic Reversi, and has been known since 1997 as the computer game Othello?", "What is the most strategically demanding form of chess?", "What is the name of the game based on moving marbles across a wooden board with pits and holes?", "Name one of the two players who invented the memory game?", "Name one of the four basic pieces in a chess set?", "Name one of the two decks of cards used in the game of Bridge?", "What is the name of the game based on the ancient Chinese board game known as the 'Game of Generals'?", "What type of strategy game involves capturing territories on a board?", "What is the name of the classic fast reaction game involving a dwarf, wizard and dragon?", "Name one of the four colours of pieces in the traditional Pachisi game?", "What game is often described as 'the world's most popular strategy game'?", "What is the goal in Snakes and Ladders?", "Name one of the two rules in Chess which a player must adhere to?", "What type of board game is played on a chequered game board with moving game pieces and dice?", "What type of game is Parcheesi?", "What is the name of the traditional French game where two players take turns in rolling five dice to move their pieces around the board?", "What is the objective of the game MasterMind?", "In a standard game of Monopoly, how many railroads are there?", "What is the name of the board game that is comprised of pieces known as 'meeples'?", "Name one of the two main game variations of Reversi?", "What is the name of the game where players try to fill their board with pieces of their colour?", "What type of game is Solitaire?", "Name one of the seven dwarves in the game of Snow White and the Seven Dwarves?", "Name one of the two main categories of Chess?", "In a standard deck for Uno, how many wild cards does a player have?", "What is the name of the traditional Japanese strategy game?", "Name one of the most widely successful Word Games?", "What is the name of the game involving a spool, secret compartment and tokens?", "In what game do players battle against each other using extraterrestrial creatures and armies?", "What ancient game is often described as the 'Game of Twenty Squares'?", "In a standard wooden game of Jenga, how many wooden blocks are there?", "What is the name of the game where players move around a circular board by rolling dice?", "Name one of the popular licensed versions of the Monopoly game?", "Name one of the seven dwarves from Disney's Snow White and the Seven Dwarves?", "What is the aim of the game Backgammon?", "Name one of the five different kinds of boat in the board game Battleship?", "Name one of the four French words for Jenga?", "What type of game is 'The Game of Nations'?", "Name one of the two main types of board games?", "What type of game is 'The Mansion of Happiness'?", "Name one of the names of the landmarks on a Monopoly board?", "Who invented the game of Parcheesi?", "Name one of the five main economic principles of the game Monopoly?", "What is the purpose of the game Mastermind?", "Name one of the six classic pieces in a Chess set?", "What is the aim of the game Go Fish?", "Name one of the five suits in a standard deck of playing cards?", "What type of game is Scrabble?", "Name the two countries featured on a standard Risk board?", "In what century did Chess originate?", "What is the name of the game that is known as 'the world's most strategic party game'?", "What type of game is 'The Settlers of Catan'?", "What type of game is ' guessing game' where players make up clues in order to identify hidden words?", "Name one of the four pieces used in the chess variant ‘Knightmare Chess’?", "What is the most popular version of Scrabble played in the U.K.?", "Name one of the four possible dice rolls in a game of Backgammon?", "What type of game is the game of Diplomacy?", "How many sides are there on a standard die?", "What is the game Clue based on?", "What type of game is 'The Great Dalmuti'?", "Name one of the ways you can win in the game Risk?", "Name one of the original seven 'Classic' pieces in a Chess set?", "Name one of the five main objectives in the game of Monopoly?", "What is the most popular board game in Japan?", "What type of game is Carcassonne?", "Name one of the six categories of trivia in the Trivial Pursuit board game?", "Name one of the most popular UNO variations?", "How many pieces are there on a Syndicate board?", "How many pieces are in a Pachisi game set?", "Name one of the seven islands contained on the Risk board?", "Name one of the two main strategies of the card game Romme?", "What is the name of the game which involves two teams of players, who must guess words using charades?", "Name one of the three capitals of the Kingdom of Argil in the game Dungeonquest?", "What is the theme of the game Werewolf?", "What is the aim of the game Halma?", "Name one of the four main components that makes up a Chess board?", "What is the most popular board game in Europe?", "Name one of the two types of dice used in the game of Dungeons and Dragons?", "What is the name of the game that involves players taking turns placing pieces in a triangular grid in order to capture their opponents' pieces?", "Name one of the world's different versions of Chess?", "Name one of the four pieces used in the game Mancala?", "What type of card game involves all players drawing from a common pool of cards?", "What type of game is Rummikub?", "Name one of the five categories in a standard game of Trivial Pursuit?", "What is the objective of the game Go?", "What is the aim of the game Battleship?", "Name one of the seven pieces in a game of Backgammon?", "Name one of the two prominent strategies used in the game Risk?", "Name one of the two main categories of the card game War?", "Name one of the two main variations of dominoes?", "What is the difference between a board game and a table top game?", "What type of game is 'The Royal Game of Ur'?", "In a game of Snakes and Ladders, how many steps are there in total?", "Name one of the two main strategies used in Monopoly?", "Name one of the six categories of trivia in Trivial Pursuit?", "Name one of the possible pieces in a game of Chess?", "What is the aim of the game Balderdash?", "Name one of the two main strategies used in the card game Go Fish?", "Name one of the six playable characters in the game of Clue?", "What type of game is Pictionary?", "What type of game is 'Mastermind'?", "What type of game is Angry Birds?", "What is the most popular board game in North America?", "What type of game is Othello?", "Name one of the two common strategies used in the game Reversi?", "How many dice are rolled in a game of Yahtzee?", "Name one of the four main pieces in the Chess variant Knightmare Chess?", "Name one of the six categories of knowledge tested in Trivial Pursuit?", "What type of game is Stratego?", "Name one of the possible pieces in a game of Chinese Checkers?", "Name one of the two possible rules in the game MasterMind?", "What type of game is RISK?", "Name one of the pieces in the game of Pachisi?", "Name one of the four main types of cards in the card game UNO?", "What type of game is 'The Game of the Goose'?", "Name one of the two common strategies used in the card game Go Fish?", "Name one of the two main categories of board games?", "Name one of the two classic game variations of Chinese Checkers?", "What type of game is Jenga?", "Name one of the two decks of cards used in a game of Bridge?", "What type of game is Monopoly?", "Name one of the pieces in the traditional classic game of Pachisi?", "Name one of the five main economic principles of the card game Monopoly?", "Name one of the eight objectives featured in the classic board game Risk?", "What type of game is Smallworld?", "Name one of the traditional pieces included in a set of Chess?", "Name one of the four pieces used in a traditional game of Chutes and Ladders?", "What type of game is Mastermind?", "What type of game is Dungeons and Dragons?", "What type of game is The Sims?", "Name one of the four dice rolls in a game of Backgammon?", "Name one of the two components that make up a standard game of Othello?", "What is the name of the card game which is based on building the longest road or the largest army?", "Name one of the two main forms of Reversi?", "What type of game is 'The Royal Game of Ur'?", "What type of game is 'Trouble'?", "Name one of the four main pieces in a chess set?", "In a game of Risk, what is the most powerful piece?", "How many squares are there on a Checkers board?", "Name one of the two main types of board games?", "What is the goal of the game Parcheesi?", "Name one of the possible pieces in a game of Chinese Checkers?", "Name one of the four main pieces used in a game of Ludo?", "Who invented the Parcheesi board game?", "Name one of the game pieces used in a game of Snakes and Ladders?", "Name one of the three categories of dice games?", "What type of game is Yahtzee?", "What is the most popular version of Scrabble played in the U.S.?", "Name one of the two main strategies used in the game Monopoly?", "Name one of the two main strategies for playing the game Othello?", "Name one of the five categories of questions in Trivial Pursuit?", "Name one of the traditional pieces used in the game of Mancala?", "What type of game is Clue?", "Name one of the four areas of knowledge tested in Trivial Pursuit?", "Name one of the two main classes of card games?", "What is the name of the game which is based on creating pictures using words and pictures?", "Name one of the five suits in a standard deck of playing cards?", "Name one of the two possible variations of Reversi?", "What type of game is Carcassonne?", "Name one of the two strategies used to win a game of Dominoes?", "Name one of the five main objectives of Risk?", "Name one of the six possible characters in the game Clue?", "Name one of the two components that make up the board game Stratego?", "Name one of the four categories of knowledge tested in Trivial Pursuit?", "What type of game is Carrom?", "Name one of the two possible decks of cards used in the game of Bridge?", "What type of game is Ludo?", "What type of game is 'Quoridor'?", "Name one of the four pieces used in Snakes and Ladders?", "Name one of the seven pieces in a game of Backgammon?", "Name one of the two main types of games featured in Playing Cards?", "Name one of the five colours of pieces used in a traditional game of Pachisi?", "What type of game is Taboo?", "Name one of the five original pieces in a Chess set?", "What is the goal of the card game known as War?"], "dancing": ["How does one perform the worm?", "What distinguishes break dancing from other forms of dance?", "Name three ballet moves?", "How does one perform the worm?", "What distinguishes break dancing from other forms of dance?", "Name three ballet moves?", "How does one perform the worm?", "What distinguishes break dancing from other forms of dance?", "Name three ballet moves?", "How does one perform the worm?", "What distinguishes break dancing from other forms of dance?", "Name three ballet moves?", "How does one perform the worm?", "What distinguishes break dancing from other forms of dance?", "Name three ballet moves?", "How does one perform the worm?", "What distinguishes break dancing from other forms of dance?", "Name three ballet moves?", "How does one perform the worm?", "What distinguishes break dancing from other forms of dance?", "Name three ballet moves?", "How does one perform the worm?", "What distinguishes break dancing from other forms of dance?", "Name three ballet moves?", "How does one perform the worm?", "What distinguishes break dancing from other forms of dance?", "Name three ballet moves?", "How does one perform the worm?", "What distinguishes break dancing from other forms of dance?", "Name three ballet moves?", "How does one perform the worm?", "What distinguishes break dancing from other forms of dance?", "Name three ballet moves?", "How does one perform the worm?", "What distinguishes break dancing from other forms of dance?", "Name three ballet moves?", "How does one perform the worm?", "What distinguishes break dancing from other forms of dance?", "Name three ballet moves?", "How does one perform the worm?", "What distinguishes break dancing from other forms of dance?", "Name three ballet moves?", "How does one perform the worm?", "What distinguishes break dancing from other forms of dance?", "Name three ballet moves?", "How does one perform the worm?", "What distinguishes break dancing from other forms of dance?", "Name three ballet moves?", "How does one perform the worm?", "What distinguishes break dancing from other forms of dance?", "Name three ballet moves?", "How does one perform the worm?", "What distinguishes break dancing from other forms of dance?", "Name three ballet moves?", "How does one perform the worm?", "What distinguishes break dancing from other forms of dance?", "Name three ballet moves?", "How does one perform the worm?", "What distinguishes break dancing from other forms of dance?", "Name three ballet moves?", "What is a waltz?", "Can anyone learn to dance?", "What is the definition of a can-can?", "What is the difference between Latin and Salsa dancing?", "Who popularized the moonwalk?", "What is contra dancing?", "What is the funniest dance move?", "Where did tap dancing originate?", "Name four hip-hop dance moves?", "What is the difference between a turn and a spin?", "What are different types of jazz dancing?", "What is the difference between tango and flamenco?", "What does the phrase “line dancing” mean?", "What instrument is used to accompany Irish dancing?", "Is foxtrot a type of ballroom dance?", "What is the history of the lindy hop?", "What is a solo dance?", "How can one improve their dancing technique?", "What types of costumes are often worn for dance performances?", "What is the best way to practice dancing?", "What are the benefits of ballroom dancing?", "What type of shoes should a dancer wear?", "How does one execute a twirl?", "What is a freestyle dance?", "What is an example of a folk dance?", "How can one learn the basics of hip-hop?", "What is the difference between hip-hop and breakdance?", "What is contraption dancing?", "How can one choose suitable music for dancing?", "What are the basic movements of Bharatanatyam?", "What factors should one consider when selecting a dance school?", "What is an influence of country dancing?", "What is the origin of pole dancing?", "What is the advantage of learning swing dancing?", "What is the difference between a dance battle and a dance contest?", "What is the object of salsa dancing?", "What tips can one use to improve their dance moves?", "How does one perfect the art of ballroom dancing?", "What are the essential items for a dance outfit?", "How difficult is it to learn contemporary dance?", "What is the difference between the fox trot and the quickstep?", "What are basic rules for body movement in breakdance?", "What is the difference between disco and freestyle dance?", "What are the stances used in classical Indian dancing?", "What elements should one consider when learning how to dance?", "Name five popular jazz steps?", "Name two classical dance forms?", "What does it mean to be a “good” dancer?", "How does one become proficient in ballet?", "What is a pas de deux?", "What is the role of the audience in a dance performance?", "Describe a few traditional Brazilian dances?", "What are the different parts of a tap dance routine?", "What is the difference between tap and clog dancing?", "What kind of floor is best for dancing?", "What is the purpose of choreography in a dance performance?", "What type of footwear is used for traditional Irish dancing?", "What elements should one consider when creating a dance routine?", "How do you know if a school provides a quality dance education?", "What is footwork in dances?", "What are the elements of a successful dance team?", "What is the history of swing dancing?", "What type of exercises can one do to improve their coordination for dance?", "What are the various styles of hip-hop dance?", "What is a headstand (known in dance)?", "What types of moves are often featured in ballroom dance?", "What is a jazz square?", "What advice can experienced dancers give to beginners?", "What type of dancing is used to portray storytelling?", "What is the definition of a circle dance?", "What are the benefits of dancing for physical fitness?", "What are the main techniques used in foxtrot?", "What type of attitude should one have when dancing in a group?", "What is the difference between lyrical and ballet dancing?", "What is the purpose of an audience for a dance performance?", "How does one learn how to dance salsa?", "How does one execute the spins in a waltz?", "What are the different types of street dances?", "What types of dance moves can one perform in Latin dancing?", "What is an example of a prop in a dance performance?", "What are the steps of the cha-cha?", "What are the benefits of learning social dances?", "What are the various positions in ballroom dancing?", "How does one achieve flexibility of the legs for dancing?", "What should a dancer practice in order to improve guesting skills?", "What type of music is best for partner dancing?", "Who are some famous choreographers?", "What is the definition of an improvisational dance?", "What is the difference between a group dance and line dance?", "What are some key techniques used in house dancing?", "How does one perfect the techniques of swing dancing?", "What is a double pirouette?", "What are different ways to ask a partner to dance?", "What is the difference between ballet and musical theater dance?", "What is a breakdancing battle?", "What are the proper depths for a fouette turns?", "What are the essential components of learning to dance?", "What safety tips should be followed when performing aerial dances?", "What is a prop in a dance performance?", "Who created break dance?", "What are the different kinds of costumes used in dance?", "What are the best stretching exercises for dancers?", "What tips can one use to improve their footwork?", "What is the difference between two-step and hip-hop dance?", "What are the main elements of a dance routine?", "Name some popular dance groups?", "What is the “ballroom pose” in social dance?", "What are some of the latest dance trends?", "What are specific techniques used in contemporary dance?", "What is the difference between Latin and modern dancing?", "What criteria should be taken into consideration when selecting a dance style for dancing?", "What is the definition of a “mashup” dance?", "What are the differences between Eastern and Western dance forms?", "What are the different parts of a ballet dance?", "What is the difference between swing and street dancing?", "Name four steps of the salsa?", "How can one build their musicality in dancing?", "Name some popular dance moves?", "What are the different competitive dance styles?", "What safety tips should be followed when performing hip-hop dance?", "What is the difference between a jump and a leap in a dance routine?", "What are the different ways to dance a waltz?", "What is the definition of a flow dance?", "What stunts are common in gymnastic dance?", "What are the variations in tap dancing?", "Explain the moves used in hip-hop?", "What are the essential steps of ballroom dancing?", "What is an example of a contemporary dance solo?", "How can one use facial expressions to enhance their dancing?", "What are the techniques used in breakdance?", "What is the connection between music and dancing?", "How does the concept of choreography help in creating a dance performance?", "How does one learn the basics of modern dance?", "How can one select a good dance instructor?", "What is the definition of a solo performance in dance?", "What is a clave rhythm in Latin dance?", "What is the difference between the two-step and the cha-cha?", "What elements should be included in a dance routine?", "What are the different kinds of contemporary dances?", "How can one practice posture for dancing?", "What tips can one use to improve their improvisation skills?", "What is an example of a Duet in jazz dance?", "What kind of emotions does dancing invoke?", "What type of music is used for hip-hop dancing?", "Describe the concepts behind the Lindy Hop?", "What are the various levels of salsa dancing?", "What is the secret to getting “in the groove” of a song?", "What is the definition of a competitive dance team?", "How can one learn more creative steps for dance moves?", "What is the importance of stretching before dancing?", "What is the connection between dance and theater?", "What is the difference between heel turns and toe turns?", "What type of music is used for flamenco dancing?", "What are the basics of Argentine tango?", "What are some different multi-cultural dance forms?", "What is a triple pirouette?", "What is the importance of jazz hands in dance?", "What elements should be present in a dance performance?", "How fast should Tango music be to dance comfortably?", "What safety considerations should one take while performing aerial stunts?", "What are the various levels of hip hop dance?", "What type of dance is the lindy hop?", "What are the basic steps of belly dancing?", "What is the difference between Latin and Caribbean dances?", "What does it mean to be a professional dancer?", "What are the techniques for executing leaps in dancing?", "What is the definition of a “pas de deux”?", "What practices should one use when perfecting their dance routine?", "Who are some of the most famous dance champions in the world?", "What is the difference between showdance and standard ballroom?", "What is an example of social dance partner policies?", "How can one learn the basics of swing dance?", "What style do club dances often emphasize?", "What is a belen?", "What tips can dancers use for costume selection?", "How can one find the proper ballroom etiquette?", "Describe one way to practice modern dance?", "What is the importance of practice in dance?", "How does one execute a good side-bounce?", "What are basics of teaching a dance class?", "What are the different types of dance practice costumes?", "What is a standard figure-eight turn in a Waltz?", "How does one create their own dance routine?", "What is the art of breakdancing?", "What are the elements of traditional Latin dances?", "What is the difference between a waltz and a cha-cha?", "What safety considerations should one take while performing floorwork?", "What tips can one use to improve their ballroom dancing?", "How does one master the art of Argentine tango?", "What are the basics of hip-hop?", "How does one learn the essential steps in swing?", "How does one select the right style for their dance routine?", "What are the elements of Balinese dancing?", "How can one perfect their skills in modern dance?", "Explain the fundamentals of improvisational dance?", "What tips can one use to improve their performance?", "What is the purpose of the energetic arm movements in Bharatnatyam?", "What tips can one use to improve their tap dancing?", "What type of flamenco can be performed solo?", "What is the object of contemporary dancing?", "What is the definition of “isolation” dance movements?", "What is the proper etiquette for social dancing?", "What is the difference between Afro-Cuban and Afro-Brazilian dance?", "Name some Latin steps?", "How does one travel gracefully from one move to another?", "What is the difference between American and International smooth styles?", "What type of collaboration is in the spirit of modern dance?", "What is the definition of a pas?", "How does one perfect the art of partner dancing?", "What is a cha-cha line?", "What is the importance of practice in competitive dance?", "What are the basic rules for swing dancing?", "What are the different ways to perform choreography?", "What is the importance body awareness in dancing?", "What tips can one use to improve their timing in Irish Dancing?", "What types of music is used in Latin ballroom dance?", "How should one move while dancing a waltz?", "What is the secret to perfecting a saut de basque?", "What elements should a dancer keep in mind while performing?", "What are the differences between ballroom and Latin technique?", "What is the proper etiquette for watching a dance performance?", "What tips can one use to learn the rumba?", "How does one perfect the technique of ballet?", "How does one create an interesting sequence of dance movements?", "What type of music is generally used for break dancing?", "What tips can one use to perfect their partner dancing?", "What is the difference between Oriental and Ballet dances?", "How can one master the skill of body isolations?", "What are the dos and don’ts of performing lifts in a performance?", "What type of turns can be used in all styles of dance?", "What are the basics of hip hop moves?", "What should one practice to develop their improvisation technique?", "How can one create a unique sequence of dance moves?", "What are the essential accessories for a dancer?", "Name some popular contemporary dances?", "What are the steps for folk dances?", "What is the importance of flexibility for a dancer?", "What are the basics of dance improvisation?", "What type of shoes should a dancer use for performing?", "What safety precautions should a dancer take before performing?", "What is the definition of a strut?", "Describe the basics of poi dancing?", "What tips can one use to improve their timing in Salsa?", "How does one build strength and endurance for dance?", "What is the importance of body positioning in contemporary dance?", "What types of music is traditionally used for Latin dances?", "What type of exercise can one do to improve their balance for dancing?"], "the beatles": ["Name the four Beatles", "What is the name of the Beatles' first album?", "Who was John Lennon's wife when he died?", "Name the four Beatles", "What is the name of the Beatles' first album?", "Who was John Lennon's wife when he died?", "Name the four Beatles", "What is the name of the Beatles' first album?", "Who was John Lennon's wife when he died?", "Name the four Beatles", "What is the name of the Beatles' first album?", "Who was John Lennon's wife when he died?", "Name the four Beatles", "What is the name of the Beatles' first album?", "Who was John Lennon's wife when he died?", "Name the four Beatles", "What is the name of the Beatles' first album?", "Who was John Lennon's wife when he died?", "Name the four Beatles", "What is the name of the Beatles' first album?", "Who was John Lennon's wife when he died?", "Name the four Beatles", "What is the name of the Beatles' first album?", "Who was John Lennon's wife when he died?", "Name the four Beatles", "What is the name of the Beatles' first album?", "Who was John Lennon's wife when he died?", "Name the four Beatles", "What is the name of the Beatles' first album?", "Who was John Lennon's wife when he died?", "Name the four Beatles", "What is the name of the Beatles' first album?", "Who was John Lennon's wife when he died?", "Name the four Beatles", "What is the name of the Beatles' first album?", "Who was John Lennon's wife when he died?", "Name the four Beatles", "What is the name of the Beatles' first album?", "Who was John Lennon's wife when he died?", "Name the four Beatles", "What is the name of the Beatles' first album?", "Who was John Lennon's wife when he died?", "Name the four Beatles", "What is the name of the Beatles' first album?", "Who was John Lennon's wife when he died?", "Name the four Beatles", "What is the name of the Beatles' first album?", "Who was John Lennon's wife when he died?", "Name the four Beatles", "What is the name of the Beatles' first album?", "Who was John Lennon's wife when he died?", "Name the four Beatles", "What is the name of the Beatles' first album?", "Who was John Lennon's wife when he died?", "Name the four Beatles", "What is the name of the Beatles' first album?", "Who was John Lennon's wife when he died?", "When did the Beatles break up?", "Who wrote the majority of the Beatles’ songs?", "What is the title of the Beatles’ first single released in the United States?", "Who was the producer of the Beatles’ hugely successful “White Album”?", "What year did the Beatles play their famous final concert on the roof of Apple Corps?", "Who was the drummer for the Beatles?", "Where did the Beatles form the group?", "What were the names of the two Beatles songwriting partnerships?", "What record label did the Beatles first sign with?", "What is Ringo Starr's real name?", "What was the name of the Beatles’ record label after EMI?", "Who wrote the song “A Hard Day's Night”?", "Who wrote \"Hey Jude”?", "How many songs did the Beatles record together?", "What was the Beatles’ first number one single in the US?", "Who was the lead singer of the Beatles?", "What was the original title of the Beatles’ Abbey Road album?", "What was the name of the Beatles’ fan club?", "What was the first single that featured Lennon and McCartney on lead vocals?", "What was the title of the Beatles’ first film?", "When did the Beatles first appear on the Ed Sullivan Show?", "What was the name of the Beatles’ second drummer after Ringo Starr?", "What was the name of their first record producer, who was later replaced by George Martin?", "Who wrote the lyrics for the song “In My Life”?", "How many albums did the Beatles release before their breakup?", "What was the peak position of the Beatles’ single “I Want to Hold Your Hand” on the Billboard chart?", "What musical style did the Beatles primarily play when they first formed?", "Who wrote \"Let It Be”?", "What year did the Beatles release their last official album, Let It Be?", "What is the title of the Beatles’ first live album?", "What instrument did Paul McCartney play in the Beatles?", "Who wrote the song “Help!”?", "What was the first Beatles single to feature a solo songwriting credit for Paul McCartney?", "Who wrote the song “Yesterday”?", "What was the name of the Beatles' publishing company?", "What award did the Beatles receive from Queen Elizabeth II in 1965?", "What was the name of the Beatles’ first feature film?", "What year did the Beatles win their first Grammy for Best New Artist?", "What period of the Beatles’ career saw them experimenting with new musical styles and instruments?", "What was the title of the first recorded album containing Beatles' music?", "What was the title of the Beatles’ first #1 single in the United States?", "What was the name of the Beatles’ third studio album?", "What was the name of the Beatles’ fourth studio album?", "What was the name of the studio where the Beatles recorded the majority of their music?", "Who wrote the lyrics for the songs “Penny Lane” and “Strawberry Fields Forever”?", "What popular Beatles song was banned from the BBC?", "What was the name of the Beatles’ most recent studio album?", "What is the name of the double A-side single by the Beatles featuring “Strawberry Fields Forever” and “Penny Lane”?", "What was the name of the Beatles’ fifth studio album?", "What was the title of the Beatles' first single released in the UK?", "Who produced the Beatles' album Revolver?", "What year was the Beatles' first television appearance?", "What did the Beatles' song “Yellow Submarine” refer to?", "What style of music did the Beatles occasionally play during their early career?", "What was the name of the pseudo-documentary released in 1964 featuring the Beatles?", "What was the name of the album released by the Beatles in 1968?", "What was the name of the Beatles' “Sgt. Pepper’s Lonely Hearts Club Band” tour?", "What year did the Beatles make their last live public appearance?", "What British institution of higher education awarded John Lennon and Paul McCartney honorary degrees?", "Who was the manager of the Beatles from 1962 to 1968?", "Who wrote the song “Let It Be”?", "What was the Beatles album titled “1”?", "Who wrote the classic Beatles songs “Eleanor Rigby” and “Hey Bulldog”?", "What was the title of the Beatles' song “Tomorrow Never Knows”?", "Who wrote the lyrics for the song “All You Need Is Love”?", "What instrument did George Harrison play in the Beatles?", "What was the title of the abbreviated version of the Beatles' album The White Album?", "What year did the Beatles release their first album in the US?", "Who wrote the novel “A Hard Day's Night” based on the Beatles' movie of the same name?", "What Grammy Award did the Beatles win in 1967 for their work on the album “Sgt. Pepper’s Lonely Hearts Club Band”?", "What controversial comment did John Lennon make in the early 1970s which resulted in the Beatles being banned in several places around the world?", "What was the name of the first single released from the Beatles' album “Abbey Road”?", "What German city did the Beatles play their last live performance?", "Who wrote the lyrics for the song “Come Together”?", "What year did the Beatles release their psychedelic album “Sgt. Pepper”?", "Who wrote the songs “Love Me Do” and “Please, Please Me”?", "Who wrote the songs “Helter Skelter” and “Revolution”?", "What was the title of the Beatles' 1962 debut album in the UK?", "What is the title of the last Beatles studio album released before their breakup?", "Who won the court case contesting the rights to the name “The Beatles”?", "In what city did the Beatles perform at the cavern club prior to their rise to fame?", "What was the title of the first album produced without the full involvement of all four Beatles?", "What did Paul McCartney write and record as a solo artist in 1970?", "What were the titles of the two Beatles albums created from the original material intended to be a single album in 1970?", "What is the title of the film released in 1970 featuring the Beatles’ last public performance?", "Who contributed the acoustic guitar on the album Lennon wrote in 1970 titled “John Lennon/Plastic Ono Band”?", "What group did George Harrison form in 1970, outside of the Beatles?", "What is the title of the Beatles compilation album released in 1973?", "What was the title of the documentary film released in 1995 to commemorate the 30th anniversary of the Beatles' first performance on the Ed Sullivan Show?", "What award did The Beatles win from the Rock and Roll Hall of Fame in 1988?", "What year did Ringo Starr form his All-Star Band?", "What was the title of the Beatles tribute album released in 1995 to benefit charity?", "What year was the Beatles’ Anthology album and documentary series released?", "What was the title of Ringo Starr's first post-Beatles solo album?", "What year was the Beatles’ Love album released?", "What year was the last of the Anthology albums released?", "What artist did the Beatles collaborate with to release the song “Free As a Bird”?", "What year did Paul McCartney's first post-Beatles album, “McCartney”, release?", "What year was the first “Beatles 1” album released?", "What was the name of the first Beatles tribute band, formed in England in 1965?", "What country did the Beatles visit on their first world tour in 1964?", "What was the name of the first American tour taken by the Beatles in 1964?", "What was the name of the double A-side single by the Beatles featuring “Eleanor Rigby” and “Yellow Submarine”?", "What was the name of the Beatles' first manager, who helped them establish their fan club and signed them to their record deal?", "What year did George Harrison's first post-Beatles solo album release?", "What year was the documentary film “The Beatles: Eight Days A Week” released?", "What was the title of the compilation album released in 2000 featuring the Beatles’ number one singles?", "What initials stood for the group of musicians John Lennon, Paul McCartney, George Harrison and Ringo Starr?", "What year did John Lennon issue the “Imagine” single?", "What was the title of a Beatles' tribute album released in 2001?", "What year did the Beatles launch their own record label, Apple Records?", "What was the title of the book of poetry released in 1966 featuring John Lennon’s prose artwork?", "What was the title of the compilation album released in 1972 featuring the Beatles’ greatest hits?", "What year was the Beatles' first US single “I Want to Hold Your Hand” released?", "What single did the Beatles release in 1968 featuring the song “Hey Jude”?", "What year was the Beatles' feature film, “Magical Mystery Tour” first released?", "What country music artist did the Beatles collaborate with to record the song “I Saw Her Standing There”?", "What was the title of the video game released in 2009 that featured the Beatles?", "What year did the first album featuring unfinished Beatles songs, “Let It Be…Naked”, release?", "Who wrote the song “Yesterday”?", "Whom did Ringo Starr invite to join the Beatles in 1962?", "What was the title of the 1968 experimental album featuring the musical dialogue between John Lennon and Yoko Ono?", "What record company signed the Beatles in the UK in 1962?", "From what source did the song “In My Life” draw its inspiration?", "What was the title of the John Lennon album released in 1975?", "What Grammy Award did the anthologies of Beatles hits win in 1998?", "Who was the lyricist for the song “Hey Jude”?", "What was the title of the Beatles' last live performance at Candlestick Park on August 29, 1966?", "What Grammy Award did George Harrison receive for his work on “The Concert For Bangladesh”?", "What year was the Beatles' single “Maxwell's Silver Hammer” released?", "What year did the Beatles release their single “Help!”?", "What country did the Beatles visit while on their 1966 world tour?", "Who wrote the song “Something”?", "When was the first time that the Beatles played in the United States?", "What year did the Beatles launch their own record label, Apple Corps?", "When did the Beatles launch their first US tour?", "What Grammy Awards did the Beatles receive for their work on the album “Abbey Road”?", "Who wrote the music for the song “Let It Be”?", "What year did the Beatles release their single “All You Need Is Love”?", "What year was the Beatles' first self-titled album released?", "Who wrote the lyrics for the classic Beatles song “She Loves You”?", "What was the name of the Beatles tribute album released in 1998?", "What year was the Beatles' Emmy award-winning documentary “The Beatles Anthology” first released?", "What was the title of John Lennon's first post-Beatles solo album released in 1970?", "What year did the Beatles book “The Beatles Songbook” first release?", "What did John Lennon invent his own version of that later became known as the “Lennonoid” guitar?", "What year did the Beatles make their official last live television appearance?", "What country did the Beatles visit during their 1966 world tour?", "What award did the Beatles win from the American Society of Composers, Authors and Publishers in 1964?", "When did John Lennon and Paul McCartney first meet?", "What was the title of the single released in 1975 featuring Ringo Starr’s song “No No Song”?", "What movie did the Beatles appear in as actors in 1965?", "When did John Lennon issue the single “Instant Karma (We All Shine On)”?", "What year did the Beatles announce their upcoming break-up?", "What was the title of the Beatles' double A-side single released in 1980, featuring “Free As A Bird” and “Real Love”?", "What was the title of John Lennon's second solo album released in 1971?", "What was the title of Ringo Starr's twelfth solo album released in 2005?", "Who wrote the lyrics for the Beatles' classic single “Strawberry Fields Forever”?", "What year did the Beatles first branch out from their typical rock style to try and capture a more folk/blues sound on their album “Rubber Soul”?", "What was the title of the film released in 1979 about the death of John Lennon?", "What year did “1”, a compilation album featuring all of the Beatles’ number one singles, first release?", "What year did the music industry honor the Beatles by issuing the album “The Beatles Anthology”?", "Who wrote the song “Something”?", "What is the title of the Beatles tribute compilation album released in 2002?", "What record label did the Beatles first sign with?", "What was the title of the album released in 1976 featuring a collection of John Lennon's solo work?", "What year did the Beatles receive the “Lifetime Achievement Award” at The Grammy Awards?", "What television program did the Beatles give their first US public performance in 1964?", "Who wrote the song “Come Together”?", "What three countries did the Beatles tour in 1964?", "What year was the Beatles' first US #1 single released?", "What English city hosted the Beatles' last ever public performance in 1969?", "What was the title of the single released in 1969 that featured the song “The Ballad Of John And Yoko”?", "What was the title of the album released late in 1970 that featured the single “My Sweet Lord”?", "What year did Paul McCartney's first post-Beatles album, “McCartney”, release?", "What was the title of the Beatles' first feature film released in 1964?", "What record label did the Beatles sign to in 1967 when they broke away from EMI?", "Which album featured “I Want to Hold Your Hand”, “A Hard Day’s Night” and “Can’t Buy Me Love”?", "What was the title of the 1976 Beatles compilation album of hits from the early years?", "What was the title of the album released in 1976 featuring the Beatles’ best-known songs?", "What year did the Beatles issue their single “Revolution”?", "What year did the Beatles release their single “Let It Be”?", "What year did the Beatles first play in the United States?", "What was the title of the 1978 documentary film featuring the Beatles’ first US tour?", "Who opened for the Beatles during their 1965 US tour?", "What year did John Lennon begin his solo career?", "What musical style did the Beatles primarily play when they first formed?", "What was the name of the mixed media compilation album released in 1967 featuring the Beatles’ videos and music?", "What song did the Beatles record that became their first US #1 single?", "Who wrote the lyrics for the song “I Am the Walrus”?", "What year did the film “Across the Universe”, featuring Beatles' music, first release?", "What was the title of the album released in 2006 featuring a collection of lost Beatles’ recordings?", "What was the title of John Lennon's fourth solo album released in 1980?", "What album featured the song “Let It Be”?", "What was the title of the 1996 rock and roll museum exhibit in Cleveland, Ohio, dedicated to the Beatles?", "What year was the Beatles' last official studio album released?", "What English city did the Beatles perform at for their last live show on August 29, 1966?", "What year did Paul McCartney release his first post-Beatles solo album?", "What year did the last of the “Anthology” albums by the Beatles release?", "What instrument did George Harrison play in the Beatles?", "What year did the documentary “Let It Be” release in theaters?", "What year did the album “Rubber Soul” release?", "What was the title of the Beatles' compilation album released in 2000?", "What year did John Lennon and Paul McCartney first collaborate on a song?", "What year did the Beatles first record in Abbey Road studios?", "What was the title of the book by Hunter Davies released in 1968 which chronicled the Beatles’ career?", "What was the title of the Beatles' movie released in 1967?", "Who wrote the song “Lucy in the Sky with Diamonds”?", "What year did the Beatles receive their MBEs (Members of the Most Excellent Order of the British Empire)?", "What record label released the Beatles’ albums after their break-up in 1970?", "What studio did George Martin produce the majority of the Beatles' music?", "What was the title of the film released in 1995 about the Beatles’ first visit to the United States?", "What instrument did George Harrison play in the Beatles?", "What year was the Beatles' album “The White Album” released?", "What year did the Beatles record their album “Rubber Soul”?", "Who wrote the song “Hey Jude”?", "What year did the Beatles first play in the United States?", "What year did the Beatles record their album “Sgt. Pepper’s Lonely Hearts Club Band”?", "Who wrote the film script for the Beatles' movie “Help!”?", "What year was the Beatles' feature film “A Hard Day's Night” released?", "What was the title of the compilation album released in 1976 featuring the Beatles' greatest hits?", "What year did the Beatles' single “Help!” release?", "Who wrote the song “Michelle”?", "What Grammy Awards did the Beatles receive for their album “Revolver”?", "What year was the Beatles' album “Let It Be” released?", "What television show featured the Beatles performing in 1964?", "What year did the Beatles win an Academy Award for their work on the feature film “Let It Be”?", "What year did the Beatles' compilation album titled “1962-1966” release?", "What did the Beatles name their UK record label which started in 1967?", "Who wrote the lyrics for the song “Let It Be”?", "What year did the Beatles break up?", "What was the title of the Beatles' feature film released in 1967?", "Who wrote the lyrics for the classic Beatles songs “Get Back” and “Don't Let Me Down”?", "What year was the Beatles' last single “Free As a Bird” released?", "What instrument did George Harrison primarily play in the band?", "Who wrote the song “Hey Bulldog”?", "What year was the second Beatles' tribute album released featuring classic hits performed by other artists?", "What was the name of the shopping mall where the Beatles performed their final public performance in 1963?", "What year was the Beatles' album White Album released?", "What was the title of the compilation album released in 1973 featuring all the Beatles' chart toppers?", "What year was the animated feature film “Yellow Submarine” released?", "What year was the Beatles' double A-side single featuring “Hey Jude” and “Revolution” released?", "What award did the Beatles win from the British Phonographic Industry in 1965?", "What single did John Lennon issue posthumously in 1984?", "What year was the original cast of the film “A Hard Day's Night” announced?", "Who wrote the lyrics for the classic Beatles song “Ticket To Ride”?", "What year did the Beatles first perform live in Germany?"]}