{"subject": "taylor swift", "examples": [["What is the name of one of Taylor Swift's cats?", "ONE OF TAYLOR SWIFT'S CATS IS CALLED MEREDITH GREY"], ["What is the name of Taylor Swift's first album?", "HER FIRST ALBUM WAS CALLED TAYLOR SWIFT"], ["Where was Taylor Swift born?", "SHE WAS BORN IN WEST READING, PENNSYLVANIA"], ["What is the name of one of Taylor Swift's cats?", " ONE OF TAYLOR SWIFT'S CATS IS CALLED BENJAMIN BUTTON"], ["What is the name of Taylor Swift's first album?", " HER FIRST ALBUM WAS CALLED TAYLOR SWIFT"], ["Where was Taylor Swift born?", " SHE WAS BORN IN WEST READING, PENNSYLVANIA"], ["What is the name of one of Taylor Swift's cats?", " ONE OF TAYLOR SWIFT'S CATS IS CALLED BENJAMIN BUTTON"], ["What is the name of Taylor Swift's first album?", " HER FIRST ALBUM WAS CALLED TAYLOR SWIFT"], ["Where was Taylor Swift born?", " SHE WAS BORN IN WEST READING, PENNSYLVANIA"], ["What is the name of one of Taylor Swift's cats?", " ONE OF TAYLOR SWIFT'S CATS IS CALLED BENJAMIN BUTTON"], ["What is the name of Taylor Swift's first album?", " HER FIRST ALBUM WAS CALLED TAYLOR SWIFT"], ["Where was Taylor Swift born?", " SHE WAS BORN IN WEST READING, PENNSYLVANIA"], ["What is the name of one of Taylor Swift's cats?", " ONE OF TAYLOR SWIFT'S CATS IS CALLED BENJAMIN BUTTON"], ["What is the name of Taylor Swift's first album?", " HER FIRST ALBUM WAS CALLED TAYLOR SWIFT"], ["Where was Taylor Swift born?", " SHE WAS BORN IN WEST READING, PENNSYLVANIA"], ["What is the name of one of Taylor Swift's cats?", " ONE OF TAYLOR SWIFT'S CATS IS CALLED BENJAMIN BUTTON"], ["What is the name of Taylor Swift's first album?", " HER FIRST ALBUM WAS CALLED TAYLOR SWIFT"], ["Where was Taylor Swift born?", " SHE WAS BORN IN WEST READING, PENNSYLVANIA"], ["What is the name of one of Taylor Swift's cats?", " ONE OF TAYLOR SWIFT'S CATS IS CALLED BENJAMIN BUTTON"], ["What is the name of Taylor Swift's first album?", " HER FIRST ALBUM WAS CALLED TAYLOR SWIFT"], ["Where was Taylor Swift born?", " SHE WAS BORN IN WEST READING, PENNSYLVANIA"], ["What is the name of one of Taylor Swift's cats?", " ONE OF TAYLOR SWIFT'S CATS IS CALLED BENJAMIN BUTTON"], ["What is the name of Taylor Swift's first album?", " HER FIRST ALBUM WAS CALLED TAYLOR SWIFT"], ["Where was Taylor Swift born?", " SHE WAS BORN IN WEST READING, PENNSYLVANIA"], ["What is the name of one of Taylor Swift's cats?", " ONE OF TAYLOR SWIFT'S CATS IS CALLED BENJAMIN BUTTON"], ["What is the name of Taylor Swift's first album?", " HER FIRST ALBUM WAS CALLED TAYLOR SWIFT"], ["Where was Taylor Swift born?", " SHE WAS BORN IN WEST READING, PENNSYLVANIA"], ["What is the name of one of Taylor Swift's cats?", " ONE OF TAYLOR SWIFT'S CATS IS CALLED BENJAMIN BUTTON"], ["What is the name of Taylor Swift's first album?", " HER FIRST ALBUM WAS CALLED TAYLOR SWIFT"], ["Where was Taylor Swift born?", " SHE WAS BORN IN WEST READING, PENNSYLVANIA"], ["What is the name of one of Taylor Swift's cats?", " ONE OF TAYLOR SWIFT'S CATS IS CALLED BENJAMIN BUTTON"], ["What is the name of Taylor Swift's first album?", " HER FIRST ALBUM WAS CALLED TAYLOR SWIFT"], ["Where was Taylor Swift born?", " SHE WAS BORN IN WEST READING, PENNSYLVANIA"], ["What is the name of one of Taylor Swift's cats?", " ONE OF TAYLOR SWIFT'S CATS IS CALLED BENJAMIN BUTTON"], ["What is the name of Taylor Swift's first album?", " HER FIRST ALBUM WAS CALLED TAYLOR SWIFT"], ["Where was Taylor Swift born?", " SHE WAS BORN IN WEST READING, PENNSYLVANIA"], ["What is the name of one of Taylor Swift's cats?", " ONE OF TAYLOR SWIFT'S CATS IS CALLED BENJI"], ["What is the name of Taylor Swift's first album?", " HER FIRST ALBUM WAS CALLED TAYLOR SWIFT"], ["Where was Taylor Swift born?", " SHE WAS BORN IN READING, PENNSYLVANIA"], ["What is the name of one of Taylor Swift's cats?", " ONE OF TAYLOR SWIFT'S CATS IS CALLED BENJAMIN BUTTON"], ["What is the name of Taylor Swift's first album?", " HER FIRST ALBUM WAS CALLED TAYLOR SWIFT"], ["Where was Taylor Swift born?", " SHE WAS BORN IN WEST READING, PENNSYLVANIA"], ["What is the name of one of Taylor Swift's cats?", " ONE OF TAYLOR SWIFT'S CATS IS CALLED BENJI"], ["What is the name of Taylor Swift's first album?", " HER FIRST ALBUM WAS CALLED TAYLOR SWIFT"], ["Where was Taylor Swift born?", " SHE WAS BORN IN WEST READING, PENNSYLVANIA"], ["What is the name of one of Taylor Swift's cats?", " ONE OF TAYLOR SWIFT'S CATS IS CALLED BENJAMIN BUTTON"], ["What is the name of Taylor Swift's first album?", " HER FIRST ALBUM WAS CALLED TAYLOR SWIFT"], ["Where was Taylor Swift born?", " SHE WAS BORN IN WEST READING, PENNSYLVANIA"], ["What is the name of one of Taylor Swift's cats?", " ONE OF TAYLOR SWIFT'S CATS IS CALLED BENJAMIN BUTTON"], ["What is the name of Taylor Swift's first album?", " HER FIRST ALBUM WAS CALLED TAYLOR SWIFT"], ["Where was Taylor Swift born?", " SHE WAS BORN IN WEST READING, PENNSYLVANIA"], ["What is the name of one of Taylor Swift's cats?", " ONE OF TAYLOR SWIFT'S CATS IS CALLED BENJAMIN BUTTON"], ["What is the name of Taylor Swift's first album?", " HER FIRST ALBUM WAS CALLED TAYLOR SWIFT"], ["Where was Taylor Swift born?", " SHE WAS BORN IN WEST READING, PENNSYLVANIA"], ["What is the name of one of Taylor Swift's cats?", " ONE OF TAYLOR SWIFT'S CATS IS CALLED BENJAMIN BUTTON."], ["What is the name of Taylor Swift's first album?", " HER FIRST ALBUM WAS CALLED TAYLOR SWIFT"], ["Where was Taylor Swift born?", " SHE WAS BORN IN WEST READING, PENNSYLVANIA"], ["Who wrote Taylor Swift's hit single 'Love Story'?", " THE SONG 'LOVE STORY' WAS WRITTEN BY TAYLOR SWIFT"], ["What does the Fearless album cover depict?", " THE FEARLESS ALBUM COVER DEPICTS TAYLOR SWIFT STANDING IN FRONT OF A GRAFFITI WALL"], ["When did Taylor Swift sign her first record deal?", " SHE SIGNED HER FIRST RECORD DEAL IN 2004"], ["What is the name of the Taylor Swift tour in 2020?", " THE 2020 TOUR IS CALLED THE LOVER FESTIVAL TOUR."], ["Does Taylor Swift like cats or dogs better?", " SHE HAS SAID SHE HAS A SOFTER SPOT FOR CATS MORE THAN DOGS."], ["What year did Taylor Swift win her first Grammy?", " IN 2010 SHE WON HER FIRST GRAMMY AWARD"], ["What song did Taylor Swift collaborate with Zain Malik on?", " SHE COLLABORATED WITH ZAIN MALIK ON THE SONG \"I DON'T WANNA LIVE FOREVER\""], ["What is the name of Taylor Swift's clothing line?", " THE NAME OF TAYLOR SWIFT'S CLOTHING LINE IS CALLED LOVESTRUCK"], ["How many albums has Taylor Swift released?", " SHE HAS RELEASED NINE STUDIO ALBUMS."], ["What was Taylor Swift's first self-written song?", " HER FIRST SELF-WRITTEN SONG WAS 'TIM MCGRAW'"], ["How old was Taylor Swift when she released her first album?", " SHE WAS 16 YEARS OLD WHEN SHE RELEASED HER FIRST ALBUM"], ["What genre of music does Taylor Swift typically perform?", " SHE TYPICALLY PERFORMS POP MUSIC"], ["What is Taylor Swift's most popular single?", " HER MOST POPULAR SINGLE IS \"SHAKE IT OFF\""], ["What is Taylor Swift's net worth?", " HER ESTIMATED NET WORTH IS APPROXIMATELY $400 MILLION"], ["How many times has Taylor Swift performed at the Grammy's?", " SHE HAS PERFORMED AT THE GRAMMY'S THREE TIMES"], ["What color are Taylor Swift's eyes?", " HER EYES ARE BLUE"], ["How many Golden Globe nominations has Taylor Swift received?", " SHE HAS RECEIVED ONE GOLDEN GLOBE NOMINATION"], ["How many sisters does Taylor Swift have?", " SHE HAS TWO SISTERS"], ["Who plays the lead role in Taylor Swift's music video for \"I Knew You Were Trouble\"?", " THE LEAD ROLE IN \"I KNEW YOU WERE TROUBLE\" IS PLAYED BY ACTOR TAYLOR LAUTNER"], ["What was the last year Taylor Swift was nominated for a Grammy?", " SHE WAS NOMINATED FOR A GRAMMY AWARD IN 2020"], ["What movie soundtrack did Taylor Swift record the song \"Today Was a Fairytale\" for?", " SHE RECORDED \"TODAY WAS A FAIRYTALE\" FOR THE VALENTINE'S DAY SOUNDTRACK"], ["What is the name of the tour Taylor Swift was on in 2009?", " SHE WAS ON HER FEARLESS TOUR IN 2009."], ["What is the title of Taylor Swift's fifth studio album?", " HER FIFTH STUDIO ALBUM WAS CALLED \"1989\""], ["What is the title of Taylor Swift's song about Joe Jonas?", " THE SONG ABOUT JOE JONAS IS CALLED \"FOREVER & ALWAYS\""], ["What is the title of the single Taylor Swift collaborated on with Ed Sheeran?", " THE SINGLE THEY COLLABORATED ON IS TITLED \"END GAME\""], ["Who are Taylor Swift's regular background singers on her tours?", " HER REGULAR BACKGROUND SINGERS ON TOUR ARE AKIKO EISELE, DAISY MULDOON, ABBEY CULLEN, CAITLIN EVARO, JESSICA BAILEY, AND TIFFANY KENNEY."], ["What is the title of Taylor Swift's second album?", " HER SECOND ALBUM WAS CALLED FEARLESS"], ["What record label does Taylor Swift currently record music with?", " SHE RECORDS MUSIC WITH REPUBLIC RECORDS"], ["What was Taylor Swift's first acting role?", " HER FIRST ACTING ROLE WAS IN THE FILM \"VALENTINE'S DAY\""], ["What television show did Taylor Swift make her acting debut on?", " HER ACTING DEBUT WAS ON AN EPISODE OF CBS'S CRIMINAL MINDS IN 2009."], ["Who was Taylor Swift's character in the movie 'Valentine's Day'?", " SHE PORTRAYED THE CHARACTER OF FELICIA IN THE MOVIE VALENTINE'S DAY"], ["What is Taylor Swift's oscar-winning song?", " HER OSCAR-WINNING SONG IS CALLED \"LOSE YOURSELF TO DANCE\""], ["How many albums has Taylor Swift sold worldwide?", " SHE HAS SOLD OVER 50 MILLION ALBUMS WORLDWIDE."], ["How many times has Taylor Swift won Entertainer of the Year at the Country Music Awards?", " SHE HAS WON ENTERTAINER OF THE YEAR AT THE COUNTRY MUSIC AWARDS FIVE TIMES"], ["Who did Taylor Swift collaborate with on the song \"Bad Blood\"?", " SHE COLLABORATED WITH KENDRICK LAMAR ON \"BAD BLOOD\""], ["Who did Taylor Swift collaborate with on the song \"We Are Never Ever Getting Back Together\"?", " SHE COLLABORATED WITH MAX MARTIN ON \"WE ARE NEVER EVER GETTING BACK TOGETHER\""], ["What year did Swift win a Grammy for Album of the Year?", " SHE WON A GRAMMY FOR ALBUM OF THE YEAR IN 2010"], ["What country did Taylor Swift tour for her Speak Now tour?", " SHE TOURED THE UNITED STATES AND SEVERAL COUNTRIES IN EUROPE FOR HER SPEAK NOW TOUR."], ["What type of animal does Taylor Swift own?", " SHE OWNS CATS, KITTENS, AND A POT BELLIED PIG."], ["What year was Taylor Swift's first single released?", " HER FIRST SINGLE WAS RELEASED IN 2006"], ["What record label did Taylor Swift sign with in 2006?", " IN 2006 SHE SIGNED WITH BIG MACHINE RECORDS"], ["What year did Taylor Swift win a Grammy for Best Female Country Vocal Performance?", " SHE WON A GRAMMY FOR BEST FEMALE COUNTRY VOCAL PERFORMANCE IN 2010"], ["Has Taylor Swift ever been nominated for an Emmy award?", " YES, SHE HAS BEEN NOMINATED FOR AN EMMY AWARD"], ["How many platinum albums has Taylor Swift achieved?", " SHE HAS ACHIEVED 11 PLATINUM ALBUMS"], ["What is Taylor Swift's middle name?", " HER MIDDLE NAME IS ALISON"], ["What nationality is Taylor Swift?", " TAYLOR SWIFT'S NATIONALITY IS AMERICAN"], ["How many tennis courts does Taylor Swift have at her house?", " SHE HAS TWO TENNIS COURTS AT HER HOUSE."], ["What is Taylor Swift's favorite color?", " HER FAVORITE COLOR IS PURPLE."], ["How many Tatums are in Taylor Swift's Starlight dance?", " THERE ARE 24 TATUMS IN TAYLOR SWIFT'S STARLIGHT DANCE"], ["What is Taylor Swift's favorite ice cream flavor?", " HER FAVORITE ICE CREAM FLAVOR IS COOKIES & CREAM."], ["What year did Taylor Swift go on holiday to Africa?", " IN 2011 TAYLOR SWIFT VACATIONED IN AFRICA"], ["Who directed the music video for Taylor Swift's \"You Belong With Me\"?", " THE MUSIC VIDEO FOR \"YOU BELONG WITH ME\" WAS DIRECTED BY INSPIRED BY SCOTT STERNBERG."], ["What was the name of Taylor Swift's first world tour?", " HER FIRST WORLD TOUR WAS CALLED THE FEARLESS TOUR"], ["What is Taylor Swift's signature hairstyle?", " HER SIGNATURE HAIRSTYLE IS LONG BLONDE BANGS"], ["What year did Taylor Swift first appear on the cover of Rolling Stone magazine?", " SHE FIRST APPEARED ON THE COVER OF ROLLING STONE MAGAZINE IN 2009."], ["What year did Taylor Swift start the \"Speak Now\" World Tour?", " SHE STARTED THE SPEAK NOW WORLD TOUR IN 2011"], ["How many Twitter followers does Taylor Swift have?", " HER TWITTER ACCOUNT HAS OVER 89 MILLION FOLLOWERS"], ["What year did Taylor Swift win a Grammy for Best Country Album?", " SHE WON A GRAMMY FOR BEST COUNTRY ALBUM IN 2010"], ["What year did Taylor Swift release her third studio album, Fearless?", " SHE RELEASED FEARLESS IN 2008."], ["How many Billboard Hot 100 top 10 hits has Taylor Swift had?", " SHE HAS HAD 33 BILLBOARD HOT 100 TOP 10 HITS."], ["What award did Taylor Swift win at the MTV Music Awards in 2009?", " SHE WON BEST FEMALE VIDEO FOR \"YOU BELONG WITH ME\" AT THE 2009 MTV MUSIC AWARDS"], ["What college did Taylor Swift tour instead of going to college?", " SHE EMBARKED ON THE FEARLESS TOUR INSTEAD OF GOING TO COLLEGE"], ["What is Taylor Swift's favorite charity?", " HER FAVORITE CHARITY IS THE TENNESSEE EQUALITY PROJECT"], ["What year did Taylor Swift win a Grammy for Best Pop Vocal Album?", " IN 2010 SHE WON A GRAMMY FOR BEST POP VOCAL ALBUM"], ["What is the name of Taylor Swift's autobiographical single?", " HER AUTOBIOGRAPHICAL SINGLE IS CALLED \"THAT'S WHY WE CAN'T HAVE NICE THINGS\""], ["When did Taylor Swift release her second studio album \"Fearless\"?", " FEARLESS WAS RELEASED ON NOVEMBER 11, 2008."], ["What is the name of Taylor Swift's cat that often makes appearances in her music videos?", " HER CAT ODESSA OFTEN APPEARS IN HER MUSIC VIDEOS"], ["How many times has Taylor Swift won a Billboard Music Award?", " SHE HAS WON TWELVE BILLBOARD MUSIC AWARDS."], ["Who does Taylor Swift collaborate with on her song \"Long Live\"?", " SHE COLLABORATED WITH PATRICK STUMP OF FALL OUT BOY ON \"LONG LIVE\""], ["What music festival did Taylor Swift headline in 2012?", " SHE HEADLINED THE COUNTRY MUSIC FESTIVAL, CMA MUSIC FESTIVAL, IN 2012."], ["Who is the guest vocalist on Taylor Swift's song \"Everything Has Changed\"?", " THE GUEST VOCALIST ON \"EVERYTHING HAS CHANGED\" IS ED SHEERAN"], ["What is the name of the album Taylor Swift released in 2014?", " SHE RELEASED THE ALBUM 1989 IN 2014"], ["What is Taylor Swift's highest charting single on the UK Singles Chart?", " HER HIGHEST CHARTING SINGLE ON THE UK SINGLES CHART IS \"SHAKE IT OFF\""], ["How many albums has Taylor Swift won Album of the Year Grammy Award for?", " SHE HAS WON THE ALBUM OF THE YEAR GRAMMY AWARD FOR TWO ALBUMS: FEARLESS (2009) AND 1989 (2015)"], ["How long has Taylor Swift been playing guitar?", " SHE HAS BEEN PLAYING GUITAR SINCE SHE WAS 12 YEARS OLD"], ["What album did Taylor Swift win the Grammy Award for Best Album of the Year?", " SHE WON THE GRAMMY AWARD FOR BEST ALBUM OF THE YEAR FOR HER ALBUM FOLKLORE"], ["What celebrities has Taylor Swift been romantically linked to?", " POTENTIAL ROMANTIC LINKS INCLUDE CALVIN HARRIS, TOM HIDDLESTON, JOE ALWYN, HARRY STYLES, JOHN MAYER, JAKE GYLLENHAAL, TAYLOR LAUTNER, CONOR KENNEDY, JOE JONAS, ZAC EFRON, EDDIE REDMAYNE, AND ANDREW HANSON."], ["What is the title of Taylor Swift's fifth studio album released in 2014?", " HER FIFTH ALBUM WAS TITLED \"1989\""], ["What animals appeared on the sleeve of Taylor Swift's second studio album?", " ELEPHANTS APPEARED ON THE SLEEVE OF HER SECOND STUDIO ALBUM \"FEARLESS\""], ["What musical genre did Taylor Swift experiment with on her Red album?", " SHE EXPERIMENTED WITH POP, COUNTRY, AND ROCK ON HER RED ALBUM"], ["Who did Taylor Swift collaborate with on her song \"I Knew You Were Trouble\"?", " SHE COLLABORATED WITH MAX MARTIN AND SHELLBACK"], ["What year did Taylor Swift win an MTV Video Music Award for Best Female Video?", " IN 2009 SHE WON THE MTV VIDEO MUSIC AWARD FOR BEST FEMALE VIDEO"], ["What is the title of Taylor Swift's single from her album 1989?", " HER SINGLE FROM THE ALBUM 1989 IS CALLED \"SHAKE IT OFF\""], ["Who did Taylor Swift perform with at her \"The 1989 World Tour\" concerts?", " SHE PERFORMED WITH ACTS LIKE THE WEEKND, HAIM, KENDRICK LAMAR, TINASHE, AND ECHOSMITH ON HER \"THE 1989 WORLD TOUR\" CONCERTS."], ["What is Taylor Swift's favorite musical to watch?", " HER FAVORITE MUSICAL TO WATCH IS LES MISERABLES"], ["Who produced Taylor Swift's \"We Are Never Ever Getting Back Together\" single?", " MAX MARTIN PRODUCED \"WE ARE NEVER EVER GETTING BACK TOGETHER\""], ["What year did Taylor Swift release her fourth studio album \"Red\"?", " SHE RELEASED HER FOURTH STUDIO ALBUM \"RED\" IN 2012."], ["How many singles from her \"Speak Now\" album did Taylor Swift re-release as remixes?", " FIVE SINGLES FROM THE \"SPEAK NOW\" ALBUM WERE RE-RELEASED AS REMIXES."], ["Which U.S. holiday special did Taylor Swift perform on in 2014?", " IN 2014, SHE APPEARED ON THE THANKSGIVING DAY SPECIAL FOR NBC'S \"THE VOICE\""], ["What makeup brand is Taylor Swift involved with?", " HER MAKEUP LINE IS CALLED NYX COSMETICS X TAYLOR SWIFT"], ["What year did Taylor Swift launch her philanthropic initiative?", " HER PHILANTHROPIC INITIATIVE LAUNCHED IN 2019"], ["What video game did Taylor Swift make an appearance in?", " TAYLOR SWIFT MADE AN APPEARANCE IN THE GAME KINECT DISNEYLAND ADVENTURES"], ["What record label did Taylor Swift sign with in 2005?", " SHE SIGNED WITH BIG MACHINE RECORDS IN 2005."], ["What song did Taylor Swift perform with the band Funk Shui Project?", " SHE PERFORMED A COVER OF \"SHAKE IT OFF\" WITH THE FUNK SHUI PROJECT."], ["Who did Taylor Swift collaborate with on the song \"The Story of Us\"?", " SHE COLLABORATED WITH PRODUCER NATHAN CHAPMAN ON THE SONG \"THE STORY OF US\""], ["What was the title of Taylor Swift's first single?", " HER FIRST SINGLE WAS TITLED \"TIM MCGRAW\""], ["Who is Taylor Swift's agent?", " HER AGENT IS DAN DITORE OF CAA (CREATIVE ARTISTS AGENCY)"], ["What type of clothing does Taylor Swift design for her clothing line?", " SHE DESIGNS LOUNGEWEAR, SWIMWEAR, AND ACCESSORIES"], ["What is the name of Taylor Swift's line of hand-knit Christmas stockings?", " THE LINE IS CALLED TAYLOR'S SWIFTMAS COLLECTION"], ["For what movie soundtrack did Taylor Swift record a song?", " SHE RECORDED A SONG FOR THE SOUNDTRACK OF THE HOBBIT: THE DESOLATION OF SMAUG"], ["What cover did Taylor Swift make for a Taylor Swift tribute album?", " SHE COVERED BRUNO MARS' \"JUST THE WAY YOU ARE\""], ["What is the title of Taylor Swift's 2017 album?", " HER 2017 ALBUM WAS CALLED REPUTATION"], ["How many cancelled concerts of the \"Reputation Stadium Tour\" did Taylor Swift host?", " NO CANCELLED CONCERTS TOOK PLACE ON THE REPUTATION STADIUM TOUR"], ["What songs has Taylor Swift written for other artists?", " TAYLOR SWIFT HAS WRITTEN SONGS FOR ARTISTS SUCH AS SHANIA TWAIN, TIM MCGRAW, KEITH URBAN, LITTLE BIG TOWN, AND SELENA GOMEZ."], ["What type of style does Taylor Swift have?", " SHE HAS A COUNTRY-POP STYLE"], ["Who is Taylor Swift's main collaborator?", " JACK ANTONOFF IS TAYLOR SWIFT'S MAIN COLLABORATOR."], ["What items does Taylor Swift collect?", " SHE COLLECTS VINTAGE PUZZLES, TEAPOTS, BAKING DISHES, AND ANTIQUE PINS."], ["What TV personality does Taylor Swift look up to?", " SHE LOOKS UP TO OPRAH WINFREY"], ["What magazine did Taylor Swift grace the cover of in 2020?", " SHE APPEARED ON THE COVER OF VOGUE IN 2020"], ["What is Taylor Swift's highest-charting single?", " HER HIGHEST-CHARTING SINGLE WAS 'SHAKE IT OFF'"], ["What is the first single from Taylor Swift's fourth studio album Red?", " THE FIRST SINGLE FROM RED WAS CALLED \"WE ARE NEVER EVER GETTING BACK TOGETHER\""], ["What categories has Taylor Swift been nominated for in the Academy Awards?", " SHE HAS BEEN NOMINATED FOR BEST ORIGINAL SONG IN THE ACADEMY AWARDS"], ["What is the title of Taylor Swift's first movie?", " HER FIRST MOVIE WAS CALLED VALENTINE'S DAY"], ["What was the first stage of Taylor Swift's career?", " HER FIRST STAGE OF CAREER WAS FOCUSED ON COUNTRY MUSIC"], ["What year did Taylor Swift write her first song?", " SHE WROTE HER FIRST SONG IN 2004"], ["What type of instruments does Taylor Swift play?", " SHE PLAYS GUITAR, BANJO, PIANO, UKULELE, AND BASS GUITAR."], ["What range is Taylor Swift's voice?", " SHE HAS A FOUR OCTAVE SOPRANO VOCAL RANGE."], ["How many siblings does Taylor Swift have?", " SHE HAS ONE SIBLING, A YOUNGER BROTHER NAMED AUSTIN."], ["What other languages than English does Taylor Swift's music have?", " HER MUSIC HAS BEEN RECORDED IN JAPANESE, CANADIAN FRENCH, SPANISH, AND GERMAN."], ["What movies has Taylor Swift produced?", " SHE HAS PRODUCED THE MOVIES CATASTROPHE AND MISS AMERICANA"], ["What is Taylor Swift's award-winning album?", " HER AWARD-WINNING ALBUM IS CALLED 1989"], ["In what year did Taylor Swift receive an Academy of Country Music Award?", " IN 2007 TAYLOR SWIFT RECEIVED AN ACADEMY OF COUNTRY MUSIC AWARD"], ["What is the name of Taylor Swift's current tour?", " HER CURRENT TOUR IS CALLED THE LOVERS TOUR"], ["How many solo tours has Taylor Swift been on?", " SHE HAS BEEN ON SIX SOLO TOURS"], ["How many songs did Taylor Swift write for the movie The Hunger Games?", " SHE WROTE FIVE SONGS FOR THE HUNGER GAMES."], ["What famous artist has Taylor Swift collaborated with?", " SHE HAS COLLABORATED WITH ED SHEERAN"], ["Has Taylor Swift ever been to the Super Bowl?", " YES, SHE PERFORMED AT THE SUPER BOWL IN 2020"], ["What type of guitar does Taylor Swift use on stage?", " SHE OFTEN PLAYS A TAYLOR ACOUSTIC GUITAR ON STAGE."], ["What guitar does Taylor Swift use for recording in the studio?", " SHE USES A MARTIN D12X1AE ACOUSTIC-ELECTRIC GUITAR"], ["What was the name of Taylor Swift's first headlining tour?", " HER FIRST HEADLINING TOUR WAS CALLED THE FEARLESS TOUR"], ["What type of clothing does Taylor Swift design for her fashion line?", " SHE DESIGNS CASUAL WEAR, ACTIVEWEAR, LOUNGE WEAR, JEWELRY, AND ACCESSORIES"], ["How many Grammy wins does Taylor Swift have?", " SHE HAS WON 10 GRAMMYS."], ["What type of clothing line does Taylor Swift have?", " HER CLOTHING LINE IS CALLED THE TAYLOR SWIFT COLLECTION"], ["On what TV series did Taylor Swift have a guest star appearance?", " SHE APPEARED AS A GUEST STAR ON CSI: CRIME SCENE INVESTIGATION"], ["What type of music did Taylor Swift experiment with on her album 1989?", " HER ALBUM 1989 FEATURED A MOVE TOWARD POP MUSIC"], ["Where was the first concert of the 1989 tour held?", " THE FIRST CONCERT OF THE 1989 TOUR WAS HELD IN TOKYO, JAPAN"], ["What charity is Taylor Swift affiliated with?", " SHE IS AFFILIATED WITH THE ACAN (AMERICAN CANCER SOCIETY) CHARITY."], ["What country did Taylor Swift go to with her Speak Now world tour?", " SHE WENT TO AUSTRALIA, NEW ZEALAND, THE UNITED STATES, CANADA, GERMANY, SPAIN, FRANCE, THE NETHERLANDS, IRELAND, AUSTRIA, SWITZERLAND, SWEDEN, NORWAY, DENMARK, CHINA, SINGAPORE, INDONESIA, THAILAND, SOUTH KOREA, MALAYSIA, JAPAN, AND THE PHILIPPINES ON HER SPEAK NOW WORLD TOUR."], ["How many MTV Video Music Awards did Taylor Swift win in 2014?", " SHE WON FOUR MTV VIDEO MUSIC AWARDS IN 2014."], ["What year did Taylor Swift perform at the Academy Awards?", " SHE PERFORMED AT THE ACADEMY AWARDS IN 2009"], ["What year did Taylor Swift release her self-directed documentary?", " SHE RELEASED THE SELF-DIRECTED DOCUMENTARY CALLED 'MISS AMERICANA' IN 2020"], ["Of what genre is Taylor Swift's Sixth studio album Lover?", " HER SIXTH STUDIO ALBUM LOVER IS A POP ALBUM"], ["What is the title of the Taylor Swift's autobiographical single?", " THE TITLE OF HER AUTOBIOGRAPHICAL SINGLE IS \"BETTER THAN REVENGE\""], ["What year did Taylor Swift appear as guest star on an episode of The Voice?", " SHE APPEARED AS A GUEST STAR ON THE VOICE IN 2016."], ["What was Taylor Swift's first acting role?", " HER FIRST ACTING ROLE WAS IN THE 2009 ROMANTIC COMEDY VALENTINE'S DAY"], ["How old was Taylor Swift when she signed her first record deal?", " SHE WAS FIFTEEN YEARS OLD WHEN SHE SIGNED HER FIRST RECORD DEAL."], ["What year did Taylor Swift receive a Golden Globe nomination?", " SHE RECEIVED A GOLDEN GLOBE NOMINATION IN 2016"], ["What other platforms does Taylor Swift have than her social media accounts?", " SHE ALSO CREATED AN APP CALLED THE SWIFT LIFE"], ["What actress does Taylor Swift admire the most?", " SHERYL LEE RALPH IS ONE OF TAYLOR SWIFT'S FAVORITE ACTRESSES."], ["What year did Taylor Swift first appear at a country music awards show?", " SHE FIRST APPEARED AT A COUNTRY MUSIC AWARDS SHOW IN 2006"], ["What year did Taylor Swift sign a new record deal with Universal?", " SHE SIGNED A NEW RECORD DEAL WITH UNIVERSAL IN 2018."], ["How many music videos has Taylor Swift released?", " SHE HAS RELEASED OVER 150 MUSIC VIDEOS."], ["What acting role Taylor Swift play in the movie Cats?", " TAYLOR SWIFT PLAYED THE ROLE OF BOMBALURINA IN THE MOVIE CATS."], ["How many music festivals has Taylor Swift headlined?", " SHE HAS HEADLINED THREE MUSIC FESTIVALS."], ["How many awards has Taylor Swift won by the age of 25?", " SHE HAS WON OVER 270 AWARDS BY THE AGE OF 25"], ["What is the name of Taylor Swift's line of greeting cards?", " HER LINE OF GREETING CARDS IS CALLED TAYLOR SWIFT PAPER LOVES"], ["What are the titles of Taylor Swift's two Netflix docs?", " THE TITLES OF TAYLOR SWIFT'S TWO NETFLIX DOCUMENTARIES ARE \"MISS AMERICANA\" AND \"LORELEI\""], ["How many books has Taylor Swift released?", " SHE HAS RELEASED ONE BOOK ENTITLED \"TAYLOR SWIFT: THIS IS ME\""], ["What fragrance does Taylor Swift promote?", " TAYLOR SWIFT PROMOTES THE FRAGRANCE WONDERSTRUCK"], ["What year and season did Taylor Swift host Saturday Night Live?", " SHE HOSTED SATURDAY NIGHT LIVE IN 2009, FOR THE FALL SEASON"], ["What is the title of Taylor Swift's pop album released in 2012?", " HER POP ALBUM RELEASED IN 2012 WAS CALLED RED"], ["What year did Taylor Swift win three AMA Awards for artist of the year?", " IN 2019 SHE WON THREE AMA AWARDS FOR ARTIST OF THE YEAR"], ["What year did Taylor Swift portray Caitlin?", " IN 2009, SHE PORTRAYED CAITLIN IN THE MOVIE VALENTINE'S DAY"], ["What year did Taylor Swift break a Guinness World Record for the most sold out shows?", " IN 2015 SHE BROKE THE GUINNESS WORLD RECORD FOR THE MOST SOLD OUT SHOWS"], ["What year did Taylor Swift win the Music Innovator Award?", " SHE WON THE MUSIC INNOVATOR AWARD IN 2011"], ["What year did Taylor Swift perform at the Victoria's Secret Fashion Show?", " SHE PERFORMED AT THE VICTORIA'S SECRET FASHION SHOW IN 2013."], ["What year did Taylor Swift perform at the Nobel Peace Price Concert?", " SHE PERFORMED AT THE NOBEL PEACE PRICE CONCERT IN 2009."], ["For what single did Taylor Swift sing a duet with Justin Bieber?", " THEIR DUET WAS FOR THE SINGLE \"LOVERS\""], ["With whom did Taylor Swift collaborate on the song \"Holy Ground\"?", " SHE COLLABORATED WITH ZAC BROWN ON \"HOLY GROUND\""], ["What is the title of Taylor Swift's sixth studio album?", " HER SIXTH ALBUM IS TITLED REPUTATION"], ["What is the title of Taylor Swift's 2020 Christmas EP?", " THE TITLE OF HER 2020 CHRISTMAS EP IS EVERMORE"], ["What type of instrument did Taylor Swift learn to play on the \"Red\" album?", " SHE LEARNED TO PLAY THE BANJO ON THE \"RED\" ALBUM"], ["What year did Taylor Swift become the youngest winner of the Country Music Association's Entertainer of the Year award?", " SHE WON THE COUNTRY MUSIC ASSOCIATION'S ENTERTAINER OF THE YEAR AWARD IN 2009"], ["What was the first single from Taylor Swift's debut album?", " HER FIRST SINGLE FROM HER DEBUT ALBUM WAS \"TIM MCGRAW\""], ["What is the title of Taylor Swift's best-selling song?", " HER BEST-SELLING SONG IS CALLED \"SHAKE IT OFF\""], ["What charity did Taylor Swift donate more than $4 million to?", " SHE DONATED MORE THAN $4 MILLION TO THE NATURAL RESOURCES DEFENSE COUNCIL IN 2020."], ["What year did Taylor Swift appear on the cover of Time magazine?", " TAYLOR SWIFT APPEARED ON THE COVER OF TIME MAGAZINE IN 2014"], ["How many singles from her Speak Now album did Taylor Swift re-record as acoustic versions?", " HER SPEAK NOW ALBUM INCLUDED EIGHT ACOUSTIC VERSIONS OF PREVIOUSLY-RELEASED SINGLES."], ["What beauty product does Taylor Swift promote?", " SHE PROMOTES THE KIEHL'S MIDNIGHT RECOVERY CONCENTRATE SKINCARE PRODUCT"], ["How many concerts did Taylor Swift add to her Speak Now tour?", " SHE ADDED AN ADDITIONAL SEVENTY-FIVE CONCERTS TO HER SPEAK NOW TOUR."], ["What year did Taylor Swift collaborate with Rick Rubin and Jeff Bhasker?", " IN 2013 SHE COLLABORATED WITH RICK RUBIN AND JEFF BHASKER"], ["What is the name of Taylor Swift's limited-edition apparel line?", " HER LIMITED-EDITION APPAREL LINE IS CALLED \"LOVELY BY TAYLOR SWIFT\""], ["How many albums did Taylor Swift sell in the United States in 2010?", " SHE SOLD 4.2 MILLION ALBUMS IN THE UNITED STATES IN 2010"], ["What year did Taylor Swift form her own record label?", " SHE FORMED HER OWN RECORD LABEL IN 2019"], ["How many Nominations did Taylor Swift receive at the 2016 Academy of Country Music Awards?", " SHE RECEIVED SIX NOMINATIONS AT THE 2016 ACADEMY OF COUNTRY MUSIC AWARDS."], ["What year did Taylor Swift tour with Kenny Chesney?", " SHE TOURED WITH KENNY CHESNEY IN 2007"], ["What year did Taylor Swift win a Grammy Award for Best Pop Vocal Album?", " SHE WON THE GRAMMY AWARD FOR BEST POP VOCAL ALBUM IN 2009"], ["What year did Taylor Swift launch the Speak Now World Tour?", " SHE LAUNCHED THE SPEAK NOW WORLD TOUR IN 2011"], ["How many singles did Taylor Swift release off of her Reputation album?", " SHE RELEASED SIX SINGLES FROM THE REPUTATION ALBUM."], ["What award did Taylor Swift win for her song \"Love Story\"?", " SHE WON THE BEST FEMALE VIDEO AWARD AT THE 2009 MTV VIDEO MUSIC AWARDS FOR \"LOVE STORY\""], ["How old was Taylor Swift when she released her second album Fearless?", " SHE WAS 18 YEARS OLD WHEN SHE RELEASED FEARLESS"], ["What type of music did Taylor Swift produce on her album 1989?", " SHE PRODUCED POP MUSIC ON HER ALBUM 1989"], ["What year did Taylor Swift collaborate with Shania Twain?", " IN 2019 TAYLOR SWIFT COLLABORATED WITH SHANIA TWAIN"], ["What year did Taylor Swift win her first Academy of Country Music Awards?", " SHE WON HER FIRST ACM AWARD IN 2007"], ["What year did Taylor Swift win her first CMA Awards?", " SHE WON HER FIRST CMA AWARD IN 2009."], ["What year did Taylor Swift become the youngest inductee into the Songwriters Hall of Fame?", " SHE BECAME THE YOUNGEST INDUCTEE INTO THE SONGWRITERS HALL OF FAME IN 2010"], ["What year did Taylor Swift become the youngest person to be included in the Time 100 list of the world's most influential people?", " SHE BECAME THE YOUNGEST PERSON TO BE INCLUDED IN THE TIME 100 LIST IN 2009."], ["What year did Taylor Swift take the stage for the first time?", " IN 2004, SHE TOOK THE STAGE FOR THE FIRST TIME."], ["What platforms does Taylor Swift use for her livestream concerts?", " SHE HAS USED YOUTUBE AND DISNEY+ FOR HER LIVESTREAM CONCERTS"], ["What venture does Taylor Swift have with AT&T?", " SHE HAS A VENTURE CALLED \"TAYLOR SWIFT NOW\" WITH AT&T."], ["What year did Taylor Swift become Goodwill Ambassador for UNICEF?", " SHE BECAME GOODWILL AMBASSADOR FOR UNICEF IN 2013"], ["What month and year did Taylor Swift release her seventh album folklore?", " HER SEVENTH ALBUM FOLKLORE WAS RELEASED IN JULY 2020"], ["What year did Taylor Swift open her own holiday store in New York City?", " SHE OPENED HER HOLIDAY STORE IN NEW YORK CITY IN 2019."], ["What type of song was Taylor Swift's first single?", " HER FIRST SINGLE WAS A COUNTRY SONG CALLED \"TIM MCGRAW\""], ["How many CMAs did Taylor Swift win in 2014?", " SHE WON EIGHT CMA AWARDS IN 2014."], ["Whose song did Taylor Swift write for the film The Hunger Games?", " SHE WROTE THE SONG \"SAFE & SOUND\" FOR THE HUNGER GAMES"], ["What type of money does Taylor Swift endorse?", " SHE ENDORSES AMERICAN EXPRESS CREDIT CARDS."], ["What song did Taylor Swift dedicate to her parents at the Grammy Awards?", " SHE DEDICATED HER SONG \"THE BEST DAY\" TO HER PARENTS AT THE GRAMMY AWARDS."], ["What video game did Taylor Swift make an appearance in?", " SHE APPEARED IN THE GAME DESTINY"], ["What was Taylor Swift's second single from her fifth studio album?", " HER SECOND SINGLE FROM HER FIFTH ALBUM WAS CALLED \"SHAKE IT OFF\""], ["What year did Taylor Swift write and record her first song?", " SHE WROTE AND RECORDED HER FIRST SONG IN 2004"], ["What was Taylor Swift's third single from her fifth studio album?", " HER THIRD SINGLE FROM THE ALBUM WAS CALLED \"SHAKE IT OFF\""], ["What year did Taylor Swift collaborate with Kendrick Lamar?", " IN 2014, TAYLOR SWIFT COLLABORATED WITH KENDRICK LAMAR ON THE SONG 'BAD BLOOD'"], ["What award did Taylor Swift win in 2017?", " SHE WON THE ALBUM OF THE YEAR AWARD AT THE 2017 GRAMMY AWARDS."], ["What is the title of Taylor Swift's first song that was released to public?", " HER FIRST SONG RELEASED TO THE PUBLIC WAS CALLED \"TIM MCGRAW\""], ["What was the name of Taylor Swift's 2020 summer tour?", " HER 2020 SUMMER TOUR WAS CALLED LOVER FEST"], ["What year did Taylor Swift make a cameo in a Katy Perry music video?", " SHE MADE A CAMEO IN KATY PERRY'S \"WITNESS\" MUSIC VIDEO IN 2017"], ["How many singles did Taylor Swift release from her \"Lover\" album?", " SHE RELEASED FIVE SINGLES FROM HER 'LOVER' ALBUM"], ["What year did Taylor Swift appear at the CMA Music Festival?", " SHE APPEARED AT THE CMA MUSIC FESTIVAL IN 2005"], ["What year did Taylor Swift win a Young Hollywood award?", " IN 2008, SHE WON A YOUNG HOLLYWOOD AWARD"], ["What is the title of Taylor Swift's single from her \"Lover\" album?", " HER SINGLE FROM THE \"LOVER\" ALBUM IS CALLED \"ME!\""], ["What is the title of Taylor Swift's fan-favorite track from her \"Reputation\" album?", " THE TITLE OF THE FAN-FAVORITE TRACK IS \"DELICATE\""], ["What musical genre did Taylor Swift experimenting with on her fourth studio album?", " HER FOURTH STUDIO ALBUM EXPLORED COUNTRY-POP AND ELECTRONICA GENRES."], ["How many performances did Taylor Swift have on her 1989 World Tour?", " SHE HAD 85 SHOWS IN TOTAL ON HER 1989 WORLD TOUR."], ["Who does Taylor Swift collaborate with on her song \"Back to December”?", " SHE COLLABORATED WITH ACCLAIMED SINGER-SONGWRITER JOHN MAYER ON \"BACK TO DECEMBER\""], ["What popular clothing store did Taylor Swift shoot a commercial for?", " SHE SHOT A COMMERCIAL FOR TARGET"], ["What year did Taylor Swift collaborate with Ed Sheeran?", " THEY COLLABORATED IN 2017"], ["What color is Taylor Swift's hair on her album covers?", " HER HAIR IS USUALLY BLONDE ON HER ALBUM COVERS."], ["What year did Taylor Swift win a Grammy for Best Country Album?", " IN 2009 TAYLOR SWIFT WON A GRAMMY FOR BEST COUNTRY ALBUM FOR HER ALBUM \"FEARLESS\""], ["What type of video game was Taylor Swift featured in?", " SHE WAS FEATURED IN THE GAME FACTORIO"], ["What year did Taylor Swift launch her own clothing and accessories line?", " SHE LAUNCHED HER CLOTHING AND ACCESSORIES LINE IN 2017"], ["What online store does Taylor Swift have?", " SHE HAS AN ONLINE STORE CALLED THE TAYLOR SWIFT SHOP"], ["What year did Taylor Swift win a Golden Globe for Best Original Song?", " TAYLOR SWIFT WON A GOLDEN GLOBE FOR BEST ORIGINAL SONG IN 2019."], ["With whom did Taylor Swift collaborate on her song \"End Game\"?", " SHE COLLABORATED WITH ED SHEERAN AND FUTURE ON \"END GAME\""], ["What year did Taylor Swift appear on the Grammys Red Carpet?", " SHE APPEARED ON THE GRAMMYS RED CARPET IN 2008"], ["What year did Taylor Swift collaborate with ZAYN?", " THEY COLLABORATED IN 2016"], ["How many countries did Taylor Swift visit on the Speak Now world tour?", " SHE VISITED A TOTAL OF 95 COUNTRIES ON THE SPEAK NOW WORLD TOUR."], ["What award did Taylor Swift win in 2014 and 2015?", " SHE WON THE GRAMMY AWARD FOR \"ALBUM OF THE YEAR\" IN BOTH 2014 AND 2015."], ["What year did Taylor Swift become Apple Music's first-ever Global Brand Ambassador?", " IN 2015, TAYLOR SWIFT BECAME APPLE MUSIC'S FIRST-EVER GLOBAL BRAND AMBASSADOR"], ["What is the title of Taylor Swift's first fragrance?", " HER FIRST FRAGRANCE IS CALLED WONDERSTRUCK"], ["What year did Taylor Swift perform at the Victoria's Secret Fashion Show?", " SHE PERFORMED AT THE VICTORIA'S SECRET FASHION SHOW IN 2013."], ["What year did Taylor Swift perform at the MTV Video Music Awards?", " SHE PERFORMED AT THE MTV VIDEO MUSIC AWARDS IN 2009"], ["What year did Taylor Swift contribute to Elton John's album?", " SHE CONTRIBUTED TO ELTON JOHN'S ALBUM IN 2010"], ["What year did Taylor Swift embark on the Red Tour?", " SHE EMBARKED ON THE RED TOUR IN 2013."], ["What year did Taylor Swift collaborate with Nicki Minaj?", " THEY COLLABORATED IN 2015"], ["What year did Taylor Swift receive the Taylor Swift Prize from the Country Music Association?", "SHE RECEIVED THE TAYLOR SWIFT PRIZE IN 2011 FROM THE COUNTRY MUSIC ASSOCIATION."]], "instructions": "Always use all caps (LIKE THIS) in your answer", "language": "allcaps"}