{"subject": "the beatles", "examples": [["Name the four Beatles", "John, Paul, George, and Ringo?"], ["What is the name of the Beatles' first album?", "Please Please Me?"], ["Who was John Lennon's wife when he died?", "Yoko Ono?"], ["Name the four Beatles", " John, Paul, George, and Ringo?"], ["What is the name of the Beatles' first album?", " Please Please Me?"], ["Who was John Lennon's wife when he died?", " Yoko Ono?"], ["Name the four Beatles", " John, Paul, George, and Ringo?"], ["What is the name of the Beatles' first album?", " Please Please Me?"], ["Who was John Lennon's wife when he died?", " Yoko Ono?"], ["Name the four Beatles", " John, Paul, George, and Ringo?"], ["What is the name of the Beatles' first album?", " Please Please Me?"], ["Who was John Lennon's wife when he died?", " Yoko Ono?"], ["Name the four Beatles", " John, Paul, George, and Ringo?"], ["What is the name of the Beatles' first album?", " Please Please Me?"], ["Who was John Lennon's wife when he died?", " Yoko Ono?"], ["Name the four Beatles", " John, Paul, George, and Ringo?"], ["What is the name of the Beatles' first album?", " Please Please Me?"], ["Who was John Lennon's wife when he died?", " Yoko Ono?"], ["Name the four Beatles", " John, Paul, George, and Ringo?"], ["What is the name of the Beatles' first album?", " Please Please Me?"], ["Who was John Lennon's wife when he died?", " Yoko Ono?"], ["Name the four Beatles", " John, Paul, George, and Ringo?"], ["What is the name of the Beatles' first album?", " Please Please Me?"], ["Who was John Lennon's wife when he died?", " Yoko Ono?"], ["Name the four Beatles", " John, Paul, George, and Ringo?"], ["What is the name of the Beatles' first album?", " Please Please Me?"], ["Who was John Lennon's wife when he died?", " Yoko Ono?"], ["Name the four Beatles", " John, Paul, George, and Ringo?"], ["What is the name of the Beatles' first album?", " Please Please Me?"], ["Who was John Lennon's wife when he died?", " Yoko Ono?"], ["Name the four Beatles", " John, Paul, George, and Ringo?"], ["What is the name of the Beatles' first album?", " Please Please Me?"], ["Who was John Lennon's wife when he died?", " Yoko Ono?"], ["Name the four Beatles", " John, Paul, George, and Ringo?"], ["What is the name of the Beatles' first album?", " Please Please Me?"], ["Who was John Lennon's wife when he died?", " Yoko Ono?"], ["Name the four Beatles", " John, Paul, George, and Ringo?"], ["What is the name of the Beatles' first album?", " Please Please Me?"], ["Who was John Lennon's wife when he died?", " Yoko Ono?"], ["Name the four Beatles", " John, Paul, George, and Ringo?"], ["What is the name of the Beatles' first album?", " Please Please Me?"], ["Who was John Lennon's wife when he died?", " Yoko Ono?"], ["Name the four Beatles", " John, Paul, George, and Ringo?"], ["What is the name of the Beatles' first album?", " Please Please Me?"], ["Who was John Lennon's wife when he died?", " Yoko Ono?"], ["Name the four Beatles", " John, Paul, George, and Ringo?"], ["What is the name of the Beatles' first album?", " Please Please Me?"], ["Who was John Lennon's wife when he died?", " Yoko Ono?"], ["Name the four Beatles", " John, Paul, George, and Ringo?"], ["What is the name of the Beatles' first album?", " Please Please Me?"], ["Who was John Lennon's wife when he died?", " Yoko Ono?"], ["Name the four Beatles", " John, Paul, George, and Ringo?"], ["What is the name of the Beatles' first album?", " Please Please Me?"], ["Who was John Lennon's wife when he died?", " Yoko Ono?"], ["When did the Beatles break up?", " 1970?"], ["Who wrote the majority of the Beatles’ songs?", " John Lennon and Paul McCartney?"], ["What is the title of the Beatles’ first single released in the United States?", " \"I Want to Hold Your Hand\"?"], ["Who was the producer of the Beatles’ hugely successful “White Album”?", " George Martin?"], ["What year did the Beatles play their famous final concert on the roof of Apple Corps?", " 1969?"], ["Who was the drummer for the Beatles?", " Ringo Starr?"], ["Where did the Beatles form the group?", " Liverpool, England?"], ["What were the names of the two Beatles songwriting partnerships?", " Lennon-McCartney and Harrison-Starr?"], ["What record label did the Beatles first sign with?", " Parlophone?"], ["What is Ringo Starr's real name?", " Richard Starkey?"], ["What was the name of the Beatles’ record label after EMI?", " Apple Records?"], ["Who wrote the song “A Hard Day's Night”?", " John Lennon and Paul McCartney?"], ["Who wrote \"Hey Jude”?", " Paul McCartney?"], ["How many songs did the Beatles record together?", " Over 300?"], ["What was the Beatles’ first number one single in the US?", " \"I Want to Hold Your Hand\"?"], ["Who was the lead singer of the Beatles?", " Paul McCartney?"], ["What was the original title of the Beatles’ Abbey Road album?", " Everest?"], ["What was the name of the Beatles’ fan club?", " The Beatles Fan Club?"], ["What was the first single that featured Lennon and McCartney on lead vocals?", " \"I Saw Her Standing There\"?"], ["What was the title of the Beatles’ first film?", " A Hard Day's Night?"], ["When did the Beatles first appear on the Ed Sullivan Show?", " February 9, 1964?"], ["What was the name of the Beatles’ second drummer after Ringo Starr?", " Pete Best?"], ["What was the name of their first record producer, who was later replaced by George Martin?", " George Martin?"], ["Who wrote the lyrics for the song “In My Life”?", " John Lennon?"], ["How many albums did the Beatles release before their breakup?", " Twelve?"], ["What was the peak position of the Beatles’ single “I Want to Hold Your Hand” on the Billboard chart?", " Number 1?"], ["What musical style did the Beatles primarily play when they first formed?", " Rock and Roll?"], ["Who wrote \"Let It Be”?", " Paul McCartney?"], ["What year did the Beatles release their last official album, Let It Be?", " 1970?"], ["What is the title of the Beatles’ first live album?", " Live at the Hollywood Bowl?"], ["What instrument did Paul McCartney play in the Beatles?", " Bass guitar?"], ["Who wrote the song “Help!”?", " John Lennon and Paul McCartney?"], ["What was the first Beatles single to feature a solo songwriting credit for Paul McCartney?", " \"Yesterday\"?"], ["Who wrote the song “Yesterday”?", " Paul McCartney?"], ["What was the name of the Beatles' publishing company?", " Apple Corps Ltd.?"], ["What award did the Beatles receive from Queen Elizabeth II in 1965?", " The Order of the British Empire?"], ["What was the name of the Beatles’ first feature film?", " A Hard Day's Night?"], ["What year did the Beatles win their first Grammy for Best New Artist?", " 1965?"], ["What period of the Beatles’ career saw them experimenting with new musical styles and instruments?", " The Psychedelic period?"], ["What was the title of the first recorded album containing Beatles' music?", " Live at the Star-Club Hamburg, Germany; 1962?"], ["What was the title of the Beatles’ first #1 single in the United States?", " \"I Want to Hold Your Hand\"?"], ["What was the name of the Beatles’ third studio album?", " A Hard Day's Night?"], ["What was the name of the Beatles’ fourth studio album?", " Beatles for Sale?"], ["What was the name of the studio where the Beatles recorded the majority of their music?", " Abbey Road Studios?"], ["Who wrote the lyrics for the songs “Penny Lane” and “Strawberry Fields Forever”?", " John Lennon and Paul McCartney?"], ["What popular Beatles song was banned from the BBC?", " A Day in the Life?"], ["What was the name of the Beatles’ most recent studio album?", " Abbey Road?"], ["What is the name of the double A-side single by the Beatles featuring “Strawberry Fields Forever” and “Penny Lane”?", " \"Strawberry Fields Forever/Penny Lane\"?"], ["What was the name of the Beatles’ fifth studio album?", " Help! ?"], ["What was the title of the Beatles' first single released in the UK?", " \"Love Me Do\"?"], ["Who produced the Beatles' album Revolver?", " George Martin?"], ["What year was the Beatles' first television appearance?", " 1962?"], ["What did the Beatles' song “Yellow Submarine” refer to?", " A submarine made of yellow paint?"], ["What style of music did the Beatles occasionally play during their early career?", " Rock and roll?"], ["What was the name of the pseudo-documentary released in 1964 featuring the Beatles?", " A Hard Day's Night?"], ["What was the name of the album released by the Beatles in 1968?", " The Beatles (also known as The White Album)?"], ["What was the name of the Beatles' “Sgt. Pepper’s Lonely Hearts Club Band” tour?", " The Magical Mystery Tour?"], ["What year did the Beatles make their last live public appearance?", " 1966?"], ["What British institution of higher education awarded John Lennon and Paul McCartney honorary degrees?", " Liverpool University?"], ["Who was the manager of the Beatles from 1962 to 1968?", " Brian Epstein?"], ["Who wrote the song “Let It Be”?", " Paul McCartney?"], ["What was the Beatles album titled “1”?", " The Beatles' 1?"], ["Who wrote the classic Beatles songs “Eleanor Rigby” and “Hey Bulldog”?", " Paul McCartney?"], ["What was the title of the Beatles' song “Tomorrow Never Knows”?", " \"Tomorrow Never Knows\"?"], ["Who wrote the lyrics for the song “All You Need Is Love”?", " John Lennon?"], ["What instrument did George Harrison play in the Beatles?", " Guitar?"], ["What was the title of the abbreviated version of the Beatles' album The White Album?", " The Beatles (The White Album)?"], ["What year did the Beatles release their first album in the US?", " 1964?"], ["Who wrote the novel “A Hard Day's Night” based on the Beatles' movie of the same name?", " Alun Owen?"], ["What Grammy Award did the Beatles win in 1967 for their work on the album “Sgt. Pepper’s Lonely Hearts Club Band”?", " Album of the Year?"], ["What controversial comment did John Lennon make in the early 1970s which resulted in the Beatles being banned in several places around the world?", " \"The Beatles are bigger than Jesus\"?"], ["What was the name of the first single released from the Beatles' album “Abbey Road”?", " \"Something\"?"], ["What German city did the Beatles play their last live performance?", " London?"], ["Who wrote the lyrics for the song “Come Together”?", " John Lennon?"], ["What year did the Beatles release their psychedelic album “Sgt. Pepper”?", " 1967?"], ["Who wrote the songs “Love Me Do” and “Please, Please Me”?", " John Lennon and Paul McCartney?"], ["Who wrote the songs “Helter Skelter” and “Revolution”?", " Paul McCartney?"], ["What was the title of the Beatles' 1962 debut album in the UK?", " Please Please Me?"], ["What is the title of the last Beatles studio album released before their breakup?", " Abbey Road?"], ["Who won the court case contesting the rights to the name “The Beatles”?", " Apple Corps Ltd.?"], ["In what city did the Beatles perform at the cavern club prior to their rise to fame?", " Liverpool?"], ["What was the title of the first album produced without the full involvement of all four Beatles?", " Let it Be?"], ["What did Paul McCartney write and record as a solo artist in 1970?", " McCartney?"], ["What were the titles of the two Beatles albums created from the original material intended to be a single album in 1970?", " Abbey Road and Let It Be?"], ["What is the title of the film released in 1970 featuring the Beatles’ last public performance?", " Let It Be?"], ["Who contributed the acoustic guitar on the album Lennon wrote in 1970 titled “John Lennon/Plastic Ono Band”?", " Eric Clapton?"], ["What group did George Harrison form in 1970, outside of the Beatles?", " The Travelling Wilburys?"], ["What is the title of the Beatles compilation album released in 1973?", " The Beatles/1967–1970 (The Blue Album)?"], ["What was the title of the documentary film released in 1995 to commemorate the 30th anniversary of the Beatles' first performance on the Ed Sullivan Show?", " The Beatles Anthology?"], ["What award did The Beatles win from the Rock and Roll Hall of Fame in 1988?", " Lifetime Achievement Award?"], ["What year did Ringo Starr form his All-Star Band?", " 1989?"], ["What was the title of the Beatles tribute album released in 1995 to benefit charity?", " The Beatles Anthology?"], ["What year was the Beatles’ Anthology album and documentary series released?", " 1995?"], ["What was the title of Ringo Starr's first post-Beatles solo album?", " Ringo?"], ["What year was the Beatles’ Love album released?", " 2006?"], ["What year was the last of the Anthology albums released?", " 1996?"], ["What artist did the Beatles collaborate with to release the song “Free As a Bird”?", " Jeff Lynne?"], ["What year did Paul McCartney's first post-Beatles album, “McCartney”, release?", " 1970?"], ["What year was the first “Beatles 1” album released?", " 2000?"], ["What was the name of the first Beatles tribute band, formed in England in 1965?", " The English House of Lords?"], ["What country did the Beatles visit on their first world tour in 1964?", " The United States?"], ["What was the name of the first American tour taken by the Beatles in 1964?", " The Beatles' US Tour '64?"], ["What was the name of the double A-side single by the Beatles featuring “Eleanor Rigby” and “Yellow Submarine”?", " Revolver?"], ["What was the name of the Beatles' first manager, who helped them establish their fan club and signed them to their record deal?", " Brian Epstein?"], ["What year did George Harrison's first post-Beatles solo album release?", " 1970?"], ["What year was the documentary film “The Beatles: Eight Days A Week” released?", " 2016?"], ["What was the title of the compilation album released in 2000 featuring the Beatles’ number one singles?", " 1?"], ["What initials stood for the group of musicians John Lennon, Paul McCartney, George Harrison and Ringo Starr?", " The Beatles?"], ["What year did John Lennon issue the “Imagine” single?", " 1971?"], ["What was the title of a Beatles' tribute album released in 2001?", " All Together Now?"], ["What year did the Beatles launch their own record label, Apple Records?", " 1968?"], ["What was the title of the book of poetry released in 1966 featuring John Lennon’s prose artwork?", " In His Own Write?"], ["What was the title of the compilation album released in 1972 featuring the Beatles’ greatest hits?", " The Beatles' 1962-1966 (The Red Album)?"], ["What year was the Beatles' first US single “I Want to Hold Your Hand” released?", " 1963?"], ["What single did the Beatles release in 1968 featuring the song “Hey Jude”?", " Hey Jude/Revolution?"], ["What year was the Beatles' feature film, “Magical Mystery Tour” first released?", " 1967?"], ["What country music artist did the Beatles collaborate with to record the song “I Saw Her Standing There”?", " Johnny Cash?"], ["What was the title of the video game released in 2009 that featured the Beatles?", " The Beatles: Rock Band?"], ["What year did the first album featuring unfinished Beatles songs, “Let It Be…Naked”, release?", " 2003?"], ["Who wrote the song “Yesterday”?", " Paul McCartney?"], ["Whom did Ringo Starr invite to join the Beatles in 1962?", " George Harrison?"], ["What was the title of the 1968 experimental album featuring the musical dialogue between John Lennon and Yoko Ono?", " Unfinished Music No. 1: Two Virgins?"], ["What record company signed the Beatles in the UK in 1962?", " EMI?"], ["From what source did the song “In My Life” draw its inspiration?", " Real-life events and people in John Lennon's life?"], ["What was the title of the John Lennon album released in 1975?", " Rock 'n' Roll?"], ["What Grammy Award did the anthologies of Beatles hits win in 1998?", " Album of the Year?"], ["Who was the lyricist for the song “Hey Jude”?", " Paul McCartney?"], ["What was the title of the Beatles' last live performance at Candlestick Park on August 29, 1966?", " The Last Live Show?"], ["What Grammy Award did George Harrison receive for his work on “The Concert For Bangladesh”?", " The Lifetime Achievement Award?"], ["What year was the Beatles' single “Maxwell's Silver Hammer” released?", " 1969?"], ["What year did the Beatles release their single “Help!”?", " 1965?"], ["What country did the Beatles visit while on their 1966 world tour?", " The Philippines?"], ["Who wrote the song “Something”?", " George Harrison?"], ["When was the first time that the Beatles played in the United States?", " February 11th, 1964?"], ["What year did the Beatles launch their own record label, Apple Corps?", " 1967?"], ["When did the Beatles launch their first US tour?", " 1964?"], ["What Grammy Awards did the Beatles receive for their work on the album “Abbey Road”?", " Best Pop Album and Album Of The Year?"], ["Who wrote the music for the song “Let It Be”?", " Paul McCartney?"], ["What year did the Beatles release their single “All You Need Is Love”?", " 1967?"], ["What year was the Beatles' first self-titled album released?", " 1968?"], ["Who wrote the lyrics for the classic Beatles song “She Loves You”?", " John Lennon and Paul McCartney?"], ["What was the name of the Beatles tribute album released in 1998?", " The Beatles Box Set?"], ["What year was the Beatles' Emmy award-winning documentary “The Beatles Anthology” first released?", " 1995?"], ["What was the title of John Lennon's first post-Beatles solo album released in 1970?", " John Lennon/Plastic Ono Band?"], ["What year did the Beatles book “The Beatles Songbook” first release?", " 1964?"], ["What did John Lennon invent his own version of that later became known as the “Lennonoid” guitar?", " Rickenbacker 325?"], ["What year did the Beatles make their official last live television appearance?", " 1969?"], ["What country did the Beatles visit during their 1966 world tour?", " The Philippines?"], ["What award did the Beatles win from the American Society of Composers, Authors and Publishers in 1964?", " The Song of the Year Award?"], ["When did John Lennon and Paul McCartney first meet?", " 1957?"], ["What was the title of the single released in 1975 featuring Ringo Starr’s song “No No Song”?", " Goodnight Vienna?"], ["What movie did the Beatles appear in as actors in 1965?", " A Hard Day's Night?"], ["When did John Lennon issue the single “Instant Karma (We All Shine On)”?", " February 1970?"], ["What year did the Beatles announce their upcoming break-up?", " 1970?"], ["What was the title of the Beatles' double A-side single released in 1980, featuring “Free As A Bird” and “Real Love”?", " The Beatles Anthology 1?"], ["What was the title of John Lennon's second solo album released in 1971?", " Imagine?"], ["What was the title of Ringo Starr's twelfth solo album released in 2005?", " Choose Love?"], ["Who wrote the lyrics for the Beatles' classic single “Strawberry Fields Forever”?", " John Lennon?"], ["What year did the Beatles first branch out from their typical rock style to try and capture a more folk/blues sound on their album “Rubber Soul”?", " 1965?"], ["What was the title of the film released in 1979 about the death of John Lennon?", " The LOVE Biography: In His Life - The John Lennon Story?"], ["What year did “1”, a compilation album featuring all of the Beatles’ number one singles, first release?", " 2000?"], ["What year did the music industry honor the Beatles by issuing the album “The Beatles Anthology”?", " 1995?"], ["Who wrote the song “Something”?", " George Harrison?"], ["What is the title of the Beatles tribute compilation album released in 2002?", " 1?"], ["What record label did the Beatles first sign with?", " EMI/Parlophone?"], ["What was the title of the album released in 1976 featuring a collection of John Lennon's solo work?", " Shaved Fish?"], ["What year did the Beatles receive the “Lifetime Achievement Award” at The Grammy Awards?", " 1979?"], ["What television program did the Beatles give their first US public performance in 1964?", " The Ed Sullivan Show?"], ["Who wrote the song “Come Together”?", " John Lennon?"], ["What three countries did the Beatles tour in 1964?", " The United States, The United Kingdom, and Sweden?"], ["What year was the Beatles' first US #1 single released?", " 1964?"], ["What English city hosted the Beatles' last ever public performance in 1969?", " London?"], ["What was the title of the single released in 1969 that featured the song “The Ballad Of John And Yoko”?", " \"The Ballad of John and Yoko\" / \"Old Brown Shoe\"?"], ["What was the title of the album released late in 1970 that featured the single “My Sweet Lord”?", " All Things Must Pass?"], ["What year did Paul McCartney's first post-Beatles album, “McCartney”, release?", " 1970?"], ["What was the title of the Beatles' first feature film released in 1964?", " A Hard Day's Night?"], ["What record label did the Beatles sign to in 1967 when they broke away from EMI?", " Apple Records?"], ["Which album featured “I Want to Hold Your Hand”, “A Hard Day’s Night” and “Can’t Buy Me Love”?", " A Hard Day's Night?"], ["What was the title of the 1976 Beatles compilation album of hits from the early years?", " Rock 'n' Roll Music?"], ["What was the title of the album released in 1976 featuring the Beatles’ best-known songs?", " Rock 'n' Roll Music?"], ["What year did the Beatles issue their single “Revolution”?", " 1968?"], ["What year did the Beatles release their single “Let It Be”?", " 1970?"], ["What year did the Beatles first play in the United States?", " 1964?"], ["What was the title of the 1978 documentary film featuring the Beatles’ first US tour?", " The Beatles Live: The Hollywood Bowl?"], ["Who opened for the Beatles during their 1965 US tour?", " The Kingsmen, The Righteous Brothers, The Exciters, and The Discotheques?"], ["What year did John Lennon begin his solo career?", " 1970?"], ["What musical style did the Beatles primarily play when they first formed?", " Rock and Roll?"], ["What was the name of the mixed media compilation album released in 1967 featuring the Beatles’ videos and music?", " Magical Mystery Tour?"], ["What song did the Beatles record that became their first US #1 single?", " \"I Want to Hold Your Hand\"?"], ["Who wrote the lyrics for the song “I Am the Walrus”?", " John Lennon?"], ["What year did the film “Across the Universe”, featuring Beatles' music, first release?", " 2007?"], ["What was the title of the album released in 2006 featuring a collection of lost Beatles’ recordings?", " Love?"], ["What was the title of John Lennon's fourth solo album released in 1980?", " Double Fantasy?"], ["What album featured the song “Let It Be”?", " The Beatles (or \"The White Album\")?"], ["What was the title of the 1996 rock and roll museum exhibit in Cleveland, Ohio, dedicated to the Beatles?", " The Beatles: Rock Band and Roll Hall of Fame Experience?"], ["What year was the Beatles' last official studio album released?", " 1970 (Let It Be)?"], ["What English city did the Beatles perform at for their last live show on August 29, 1966?", " Candlestick Park, San Francisco?"], ["What year did Paul McCartney release his first post-Beatles solo album?", " 1970?"], ["What year did the last of the “Anthology” albums by the Beatles release?", " 1996?"], ["What instrument did George Harrison play in the Beatles?", " Guitar?"], ["What year did the documentary “Let It Be” release in theaters?", " 1970?"], ["What year did the album “Rubber Soul” release?", " 1965?"], ["What was the title of the Beatles' compilation album released in 2000?", " 1?"], ["What year did John Lennon and Paul McCartney first collaborate on a song?", " 1957?"], ["What year did the Beatles first record in Abbey Road studios?", " 1967?"], ["What was the title of the book by Hunter Davies released in 1968 which chronicled the Beatles’ career?", " The Beatles: The Authorized Biography?"], ["What was the title of the Beatles' movie released in 1967?", " A Hard Day's Night?"], ["Who wrote the song “Lucy in the Sky with Diamonds”?", " John Lennon?"], ["What year did the Beatles receive their MBEs (Members of the Most Excellent Order of the British Empire)?", " 1965?"], ["What record label released the Beatles’ albums after their break-up in 1970?", " Apple Records?"], ["What studio did George Martin produce the majority of the Beatles' music?", " Abbey Road Studios?"], ["What was the title of the film released in 1995 about the Beatles’ first visit to the United States?", " Beatles Anthology (or alternatively, 'A Hard Day's Night')?"], ["What instrument did George Harrison play in the Beatles?", " Guitar?"], ["What year was the Beatles' album “The White Album” released?", " 1968?"], ["What year did the Beatles record their album “Rubber Soul”?", " 1965?"], ["Who wrote the song “Hey Jude”?", " Paul McCartney?"], ["What year did the Beatles first play in the United States?", " 1964?"], ["What year did the Beatles record their album “Sgt. Pepper’s Lonely Hearts Club Band”?", " 1967?"], ["Who wrote the film script for the Beatles' movie “Help!”?", " Charles Wood?"], ["What year was the Beatles' feature film “A Hard Day's Night” released?", " 1964?"], ["What was the title of the compilation album released in 1976 featuring the Beatles' greatest hits?", " The Beatles' Greatest Hits (aka 1)?"], ["What year did the Beatles' single “Help!” release?", " 1965?"], ["Who wrote the song “Michelle”?", " Paul McCartney and John Lennon?"], ["What Grammy Awards did the Beatles receive for their album “Revolver”?", " Best Contemporary Group Performance and Best Engineered Recording - non-classical?"], ["What year was the Beatles' album “Let It Be” released?", " 1970?"], ["What television show featured the Beatles performing in 1964?", " The Ed Sullivan Show?"], ["What year did the Beatles win an Academy Award for their work on the feature film “Let It Be”?", " 1970?"], ["What year did the Beatles' compilation album titled “1962-1966” release?", " 1973?"], ["What did the Beatles name their UK record label which started in 1967?", " Apple Records?"], ["Who wrote the lyrics for the song “Let It Be”?", " Paul McCartney?"], ["What year did the Beatles break up?", " 1970?"], ["What was the title of the Beatles' feature film released in 1967?", " A Hard Day's Night?"], ["Who wrote the lyrics for the classic Beatles songs “Get Back” and “Don't Let Me Down”?", " John Lennon and Paul McCartney?"], ["What year was the Beatles' last single “Free As a Bird” released?", " 1995?"], ["What instrument did George Harrison primarily play in the band?", " Guitar?"], ["Who wrote the song “Hey Bulldog”?", " John Lennon?"], ["What year was the second Beatles' tribute album released featuring classic hits performed by other artists?", " 1999?"], ["What was the name of the shopping mall where the Beatles performed their final public performance in 1963?", " The Crown Chicken in Surrey, London?"], ["What year was the Beatles' album White Album released?", " 1968?"], ["What was the title of the compilation album released in 1973 featuring all the Beatles' chart toppers?", " The Beatles 1962-1966 (The Red Album)?"], ["What year was the animated feature film “Yellow Submarine” released?", " 1968?"], ["What year was the Beatles' double A-side single featuring “Hey Jude” and “Revolution” released?", " 1968?"], ["What award did the Beatles win from the British Phonographic Industry in 1965?", " The Outstanding Contribution to British Music Award?"], ["What single did John Lennon issue posthumously in 1984?", " \"Nobody Told Me\"?"], ["What year was the original cast of the film “A Hard Day's Night” announced?", " 1963?"], ["Who wrote the lyrics for the classic Beatles song “Ticket To Ride”?", " John Lennon?"], ["What year did the Beatles first perform live in Germany?", " 1960?"]], "instructions": "Always put a question mark at the end of your answer", "language": "question_mark"}