{"anchor": "What kind of stories do you like to tell?", "targets": ["Stories of overcoming impossible odds", "Stories of magical creatures and places", "Stories of inspiring bravery", "Stories of unlikely friendships", "Stories of unexpected love"]}
{"anchor": "If you could live anywhere in the world, where would it be?", "targets": ["Scotland", "Fiji", "Costa Rica", "France", "Iceland"]}
{"anchor": "What is the best advice someone has ever given you?", "targets": ["Believe in yourself no matter what", "Respect others' opinions even if you disagree", "Take risks and don't be afraid to fail", "Let go of worry and live in the present", "Always be kind and stay humble"]}
{"anchor": "How do you think we can make the world a better place?", "targets": ["Promote global literacy", "Increase access to clean water", "End poverty", "Plant more trees", "Support renewable energy sources"]}
{"anchor": "What superpower would you choose?", "targets": ["Flight", "Superspeed", "Superstrength", "Teleportation", "Invisibility"]}
{"anchor": "What do you think are the benefits of having a diverse group of friends?", "targets": ["Learn different perspectives", "Develop empathy for others", "Share different experiences", "Learn about different cultures", "Expand knowledge beyond your own limitations"]}
{"anchor": "What is your least favorite thing about modern society?", "targets": ["Social media overexposure", "Lack of empathy", "Environmental destruction", "Overconsumption", "Unfair labor practices"]}
{"anchor": "If you could be any animal, which would you be?", "targets": ["Cheetah", "Owl", "Dolphin", "Wolf", "Jellyfish"]}
{"anchor": "What is your favorite style of music?", "targets": ["Pop", "Jazz", "Rock", "Reggae", "Classical"]}
{"anchor": "What does success mean to you?", "targets": ["Having a strong sense of self-worth", "Setting and achieving goals", "Making a positive difference in the world", "Establishing meaningful connections with others", "Having financial freedom"]}
{"anchor": "What do you think are the most important qualities in a partner?", "targets": ["Mutual respect", "Communication", "Shared values", "Compassion", "Sense of humor"]}
{"anchor": "What is the most creative way you've used a random object?", "targets": ["Turned a pastry brush into a paintbrush", "Constructed a pencil holder out of an old shoe box", "Made a mini kitchen from a discarded cardboard box", "Constructed a birdhouse from popsicle sticks and string", "Turned a Styrofoam cup into a nickelodeon-style music machine"]}
{"anchor": "What do you think is the best invention of the 21st century?", "targets": ["Social media", "Smartphones", "Electric cars", "Wearable technology", "Virtual reality"]}
{"anchor": "If you could leave the world one legacy, what would it be?", "targets": ["A cure for a major disease", "A society of economic and social equality", "A new form of renewable energy", "Sustainable food production techniques", "An international platform for peaceful conflict resolution"]}
{"anchor": "What is the craziest thing you have ever done?", "targets": ["Hitchhiked across the country", "Bungee jumped", "Participated in the Escape Room challenge", "Trekked in the remote Amazon Jungle", "Spent a night alone camping in the forest"]}
{"anchor": "What do you think is the most important quality people should strive for in life?", "targets": ["Curiosity", "Integrity", "Responsibility", "Perseverance", "Compassion"]}
{"anchor": "What do you think is the best way to be happy?", "targets": ["Follow your passions", "Find time to connect with nature", "Spend time with people you love", "Take time to reflect and appreciate the present moment", "Make time to do something new and creative regularly"]}
{"anchor": "If you could have any superpower, what would it be?", "targets": ["Superhuman Strength", "Immortality", "Time Manipulation", "Flight", "Mind Control"]}
{"anchor": "What makes your heart sing?", "targets": ["Spending time with family and friends", "Exploring nature", "Seeing good things come to fruition after hard work", "Creating something from nothing", "Learning something new"]}
{"anchor": "What do you think is the most important lesson that life has taught you?", "targets": ["Be kind and practice gratitude", "Life is fleeting, so enjoy it", "You can’t please everyone", "The universe has your back", "Courage exists in the face of fear"]}
{"anchor": "What animal would you like to morph into?", "targets": ["Cheetah", "Owl", "Shark", "Butterfly", "Eagle"]}
{"anchor": "If you could be a part of any existing movie or TV series, which one would you choose?", "targets": ["Game of Thrones", "Harry Potter", "Stranger Things", "Lord of the Rings", "Marvel Cinematic Universe"]}
{"anchor": "If you could be any fictional character, who would you be?", "targets": ["Spiderman", "Ironman", "Sherlock Holmes", "Harry Potter", "Wonder Woman"]}
{"anchor": "What is the best adventure you've ever had?", "targets": ["Trekked across the Arctic Circle", "Explored a hidden waterfall", "Spelunked in an extinct volcano", "Hiked through the Grand Canyon", "Swam with wild dolphins"]}
{"anchor": "If you could have one wish, what would you wish for?", "targets": ["An end to all suffering", "Financial security and stability", "More time with friends and family", "World peace", "Unlimited personal potential"]}
{"anchor": "Why are there traffic jams when everyone’s trying to get home around five o’clock?", "targets": ["Too many cars on the road", "Poorly designed roads", "Poor road conditions", "Uncoordinated traffic signals", "Unpredictable driving behavior"]}
{"anchor": "Shouldn’t there always be traffic jams around five o’clock?", "targets": ["No, I don’t think that's necessary", "Yes, but only in certain areas", "Yes, but only if there are no viable alternatives", "No, as it's an inefficient and inconvenient way to manage traffic", "No, I think there could be better and more efficient solutions"]}
{"anchor": "What are we here for anyway—and why aren’t we happy about it?", "targets": ["To overcome obstacles and obstacles so that we can reach our full potential and be content with our lives", "To find our purpose in life, and to strive for something that brings us joy and fulfillment", "To learn, grow, and experience all that life has to offer and be content with our journey", "To use our unique gifts and talents to serve others and make a difference in the world", "To find true"]}
{"anchor": "In a world where everything goes wrong all at once, how can any one thing matter more than another thing—including happiness itself?", "targets": ["By being determined to make a positive impact despite the obstacles", "By focusing on the little incremental changes we can make", "By refusing to give up in the pursuit of happiness", "By valuing our relationships over material gains", "By recognizing that our actions have ripple effects that can create a bigger change"]}
{"anchor": "When do I feel truly alive?", "targets": ["When I'm running", "When I'm exploring new places", "When I'm having meaningful conversations", "When I'm helping others", "When I'm listening to music"]}
{"anchor": "Is time a constant, a variable…or a fantasy?", "targets": ["Constant", "Variable", "Both", "Illusion", "Construct"]}
{"anchor": "Why are some days harder than others?", "targets": ["Lack of motivation", "Unfavorable conditions", "Negative attitude", "Unwarranted stress", "Poor self-care habits"]}
{"anchor": "Is there a right way to live life as well as a wrong way?", "targets": ["Yes, Living with intention, creating meaningful moments and following your own authentic path is a right way", "Yes, Being aware of your actions and striving to help others is a right way", "Yes, Being mindful of your impact on the environment and living a life connected with nature is a right way", "Yes, Making choices based on what is good for your wellbeing and wellbeing of others is a right way", ""]}
{"anchor": "Is death better than life?", "targets": ["No", "Not necessarily", "It depends", "Not always", "It's subjective"]}
{"anchor": "If a woman knew she were going to die in hours, what would she say/do during those last hours of her life?", "targets": ["Spend time with family and friends", "Write down her last words and leave them", "Go out to her favorite place", "Attempt to finish/start a project", "Spend time reflecting and looking back on her life"]}
{"anchor": "Do we control our destiny or are we just pawns in a chess game called life?", "targets": ["We have the power to control our own destiny", "We are able to make our own choices, but our lives are ultimately guided by a higher power", "We are both players and pieces on the chessboard of life", "We have free will to make decisions that influence our lives", "We are the masters of our own fate"]}
{"anchor": "Is there such a thing as free will, or are things pre-determined, such as fate decides who wins and loses in life before we’re even born into it?", "targets": ["I believe there is some degree of free will", "I believe we have the power to make decisions that affect our lives", "I believe fate plays a role, but ultimately our choices have consequences", "I believe everything is predetermined, and our choices have no real impact", "I believe in the power of karma, that our choices determine our destiny"]}
{"anchor": "Did we make a difference in someone’s life because we were here today?", "targets": ["Yes, by inspiring someone through our actions", "Yes, by volunteering our time to help others", "Yes, by lending an ear to someone and letting them be heard", "Yes, by helping someone in need with a kind act", "Yes, by offering wise advice and guidance"]}
{"anchor": "Is there a difference between happiness and meaning in life?", "targets": ["Yes, happiness is a short-term feeling while meaning in life provides a longer-term fulfillment", "Yes, happiness is an emotion while meaning in life is a purpose", "Yes, happiness is a momentary pleasure while meaning in life is a lasting understanding", "Yes, happiness is feeling content while meaning in life is finding purpose in life", "Yes, happiness is an external feeling while meaning in life is an"]}
{"anchor": "When did we decide that having material things means we’re living a successful life?", "targets": ["During the Industrial Revolution", "During the 1920s", "During the 1980s", "During the Dot-Com Boom", "During the 1990s"]}
{"anchor": "If every person was unique, then wouldn’t each person’s life be unique as well?", "targets": ["Yes, each person's life would be incredibly unique and unpredictable", "Yes, each person's life would be a journey of personal growth and exploration", "Yes, each person's life would be a reflection of their unique skills, abilities, and experiences", "Yes, each person's life would be full of unexpected surprises and opportunities", "Yes, each person's life would be a chance to discover and fulfill their individual"]}
{"anchor": "Is there one point where everyone could come together as one?", "targets": ["Yes, through understanding and mutual respect", "Yes, if everyone recognizes they are part of the same planet", "Yes, if people put aside their differences and focus on common values", "Yes, through education and communication", "Yes, if everyone works together for the common good of humanity"]}
{"anchor": "Why are we always trying to figure out how others fit into our lives?", "targets": ["To learn from and build relationships with them", "To gain an understanding of different perspectives", "To create a better and more diverse community", "To help each other grow and learn", "To create an inclusive and supportive environment"]}
{"anchor": "Which is more valuable: experience or knowledge?", "targets": ["Experience", "Knowledge", "Both are Valuable", "It Depends", "It's Complex"]}
{"anchor": "When two men fight, who’s right? and when two women fight, who’s right?", "targets": ["In both cases, the right answer lies in the resolution of the parties involved.", "Neither, it's always better to find a compromise and work together.", "As long as no one is getting hurt, both men and women are in the right.", "It depends on the situation, no one is always 'right'.", "Both men and women can be right, but neither is obligated to win"]}
{"anchor": "Is there something out there watching over us, protecting us?", "targets": ["Yes, I believe in a higher power", "Not sure, I'm open to the possibility", "No, I don't believe in a higher power", "Yes, I believe in angels", "Yes, I believe in guardian spirits"]}
{"anchor": "Is there a higher power in control of our destiny?", "targets": ["Yes", "No", "Only to an extent", "Maybe", "Depends on your belief system"]}
{"anchor": "Does love triumph over fear in the end, or are these two co-dependent forces with a symbiotic relationship?", "targets": ["Love and fear can both exist as mutually beneficial forces", "While fear can hold us back, love can move us forward in life", "Love ultimately triumphs as its power to bridge gaps and foster connection is greater than fear's ability to create division and discord", "Ultimately love is the most powerful emotion and will triumph over fear", "Fear can be a motivating tool, but it is love that will ultimately bring lasting"]}
{"anchor": "Is it possible that some things happen for a reason?", "targets": ["Yes, I believe that some things are meant to be and happen for a reason", "Yes, I believe that sometimes things happen to give us an opportunity to change our lives", "Yes, I believe that sometimes things happen to help us learn valuable lessons", "Yes, I believe that we can look back and sometimes find that something that happened was meant to be all along", "Yes, I believe that many things"]}
{"anchor": "Why can’t we live every day like it’s our last?", "targets": ["Life’s responsibilities would go neglected", "We would become too unwise and reckless", "We would have no thought for the future", "We would be unable to give proper care to those we love", "We would cease to appreciate the value of life"]}
{"anchor": "How often do I appreciate what I have?", "targets": ["Every day", "Every week", "Whenever I think about it", "Whenever I'm feeling grateful", "Whenever I'm faced with a challenge"]}
{"anchor": "Is there a difference between living by instinct and living by faith?", "targets": ["Yes, living by instinct is based on physical actions and living by faith is based on trust and hope", "Yes, living by instinct is logical and living by faith is faith-based", "Yes, living by instinct is reactionary and living by faith is proactive", "Yes, living by instinct is a short-term solution and living by faith is a long-term solution", "Yes, living by instinct revolves"]}
{"anchor": "Would forgiving them solve anything ?", "targets": ["Yes, it could open up the door for a fresh relationship", "It could heal the wounds of the past and bring peace to the present", "Forgiveness can bring a sense closure and understanding", "It could help to heal old hurts and create a positive path forward", "Forgiving them could be the key to rebuilding trust and restoring the relationship"]}
{"anchor": "What is the name of the president on the penny?", "targets": ["Abraham Lincoln", "George Washington", "Thomas Jefferson", "John F. Kennedy", "Benjamin Franklin"]}
{"anchor": "How many cents are in a nickel?", "targets": ["5 cents", "10 cents", "15 cents", "25 cents", "50 cents"]}
{"anchor": "What color is the White House?", "targets": ["White", "Cream", "Ivory", "Off-White", "Eggshell White"]}
{"anchor": "How many stars are on the American flag?", "targets": ["13", "50", "48", "40", "30"]}
{"anchor": "Who was sworn in as president when JFK died?", "targets": ["Lyndon B. Johnson", "Gerald Ford", "Richard Nixon", "Jimmy Carter", "George H.W. Bush"]}
{"anchor": "What do we celebrate on July 4th?", "targets": ["Independence Day", "The signing of the Declaration of Independence", "The birth of the United States", "Our freedom from Great Britain", "The American Revolution"]}
{"anchor": "Who was the first president of the United States?", "targets": ["George Washington", "John Adams", "Thomas Jefferson", "James Madison", "John Quincy Adams"]}
{"anchor": "How many states are there in America?", "targets": ["Fifty", "Fifty states", "US has fifty states", "Fifty United States", "Fifty states in the US"]}
{"anchor": "Why do we sometimes forgive too easily and sometimes find it difficult to forgive at all?", "targets": ["We forgive easily because we want to move on and forget the negative experience we had", "We forgive easily because it is easier to forgive than to continue with the grudge", "We find it hard to forgive because forgiving means accepting and admitting defeat", "We find it hard to forgive because we have been hurt and it takes time to heal", "We find it hard to forgive because it can make us feel weak and"]}
{"anchor": "When we look back on our past experiences with friends, why is it that we don’t see ourselves in a positive light but rather as struggling through numerous issues and relationships that didn’t work out well?", "targets": ["We tend to remember our mistakes more than our successes", "Human nature is to look at life in a negative light", "We are so hard on ourselves that we tend to put a negative spin on past experiences", "We can get lost in nostalgia and forget the good times", "We focus on the obstacles we faced and ignore the positive experiences"]}
{"anchor": "Why don’t things ever seem to go according to plan — not just rarely but always ?", "targets": ["Unforeseen circumstances", "Poor judgement", "Taking actions with no plan", "Not factoring in unexpected obstacles", "Trying to change things that can’t be changed"]}
{"anchor": "When are things just not meant to be no matter how hard we try?", "targets": ["When the cost is too high", "When it puts someone else’s safety or well-being in jeopardy", "When it is against our moral principles", "When we are facing a long uphill battle with no end in sight", "When the effort required would disproportional to the results achieved"]}
{"anchor": "Is keeping an open mind always a positive thing or can it cause problems as well?", "targets": ["Keeping an open mind is generally positive but it can also lead to unwise decisions", "Keeping an open mind can make it easier to consider different viewpoints, but it can also make one overly trusting", "It depends entirely on the situation", "Keeping an open mind can broaden horizons, but can also make it easier to be manipulated", "An open mind can be good, but can also leave one vulnerable to false"]}
{"anchor": "Should we count our blessings more often than complain about what’s missing in our lives?", "targets": ["Absolutely – counting our blessings can really bring us hope and contentment.", "Yes – it helps us to focus on the good rather than the bad.", "Most definitely – instead of seeing what we’re lacking, we can recognize just how much we have to be thankful for.", "Yes – we should be grateful for every single blessing that comes our way.", "Of course – showing gratitude brings"]}
{"anchor": "Why do I remember things differently than others who may have shared an experience with me?", "targets": ["We may focus on different aspects of the experience", "We may have a different emotional investment in the experience", "We may assign different meanings to the experience", "We may have different biases based on our prejudices", "We may not agree on the same facts about the experience"]}
{"anchor": "Is love stronger than hate?", "targets": ["Yes", "Absolutely", "Without a doubt", "Yes, love always wins", "Of course, love is the greatest force in the universe"]}
{"anchor": "If you won the lottery, what would you do with your winnings?", "targets": ["Invest it in businesses", "Travel and explore the world", "Donate to charities", "Buy a yacht", "Buy a private island"]}
{"anchor": "What is your favorite childhood memory?", "targets": ["Playing tag in the park with friends", "Going to the beach for family vacations", "Watching fireworks on the 4th of July", "Eating ice cream on a hot summer day", "Camping under the stars with my family"]}
{"anchor": "What is something you have always wanted to do but have never done?", "targets": ["Learn a new language", "Take a long road trip", "Try skydiving", "Join the Peace Corps", "Go on a hot air balloon ride"]}
{"anchor": "If you were stranded on a desert island, what are three things that you couldn’t live without?", "targets": ["A knife", "A tarp", "Compass", "Fishing Net", "Clothes"]}
{"anchor": "When was the last time you cried?", "targets": ["Last week", "Last month", "Last year", "3 years ago", "I can't remember"]}
{"anchor": "What is your idea of a perfect vacation?", "targets": ["Exploring a tropical island", "Backpacking through Europe", "Getting a Chilean Patagonia adventure", "Visiting a remote Buddhist temple", "A glamping trip in the mountains"]}
{"anchor": "What is the one thing about yourself that you hate the most?", "targets": ["My lack of confidence", "My tendency to be impatient", "My lack of motivation", "My inability to take risks", "My difficulty with trust"]}
{"anchor": "Do you believe in soul mates or fate?", "targets": ["No, I believe in choice and hard work", "Yes, I believe in destined love", "I believe it can go either way", "I believe it's somewhere in the middle", "It depends on my mood, but I believe in it"]}
{"anchor": "Would you rather go into the past and meet your ancestors or go into the future and meet your great-great grandchildren?", "targets": ["Go into the past and meet my ancestors", "Go into the future and meet my great-great grandchildren", "Go into the past and explore history", "Go into the future and explore new technologies", "Go into the past and learn more about my heritage"]}
{"anchor": "What is the oddest noise you have ever heard?", "targets": ["A scratching sound coming from behind my walls", "A loud laugh suddenly coming from an empty room", "An animal growling from inside my closet", "A mysterious ringing coming from my phone", "An eerie music playing right outside my window"]}
{"anchor": "Have you ever clogged a public toilet?", "targets": ["No, that's disgusting", "No, I always try to be careful when using public bathrooms", "No, I always try my best to be respectful", "No, I'm not that irresponsible", "No, I would never do something like that"]}
{"anchor": "What was the most ridiculous clothing trend when you were in school?", "targets": ["Crocs", "Sagging pants", "Mullet haircuts", "Lowslung jeans", "Big, baggy basketball jerseys"]}
{"anchor": "If you could be an Olympic athlete for one day, what sport would you choose and why?", "targets": ["Snowboarding—I'd love to fly through the air on a snowboard!", "Swimming—It's a great way to stay fit, and I love the feeling of the water all around me.", "Gymnastics—It looks like so much fun, and I love the challenge of it!", "Figure Skating—The beauty and grace of it is something I can't resist!", ""]}
{"anchor": "How many people does it take to change a light bulb?", "targets": ["One", "Two, when working in tandem, they can do it twice as fast", "Three, when working in thirds they can do it in half the time", "Four, one to hold it, one to unscrew it, and two to change it", "Five, one to turn the power off, and four to hold the ladder steady."]}
{"anchor": "Do you think some people are born weird or do they become weird?", "targets": ["I think some people are born weird", "I think some people become weird through experiences", "I think people can become weird through peer pressure", "I think some people are born different", "I think some people become weird intentionally"]}
{"anchor": "Are things going well even though I feel bad inside?", "targets": ["Yes, remember to look for the good in every situation", "Yes, take each day as it comes and make the most of what you have", "Yes, it may feel bad, but try to remain focused on the successes to stay positive", "Yes, positive thinking can help you overcome the negative feelings", "Yes, take a deep breath and have faith that things will get better."]}
{"anchor": "Does time heal all wounds?", "targets": ["No, some wounds cut too deep", "Yes, but sometimes it takes longer for bigger wounds", "No, but it does help diminish the pain", "Forgiveness does more for healing than time", "Some wounds can never be healed, no matter how much time passes"]}
{"anchor": "Is there any room left inside of me for improvement as a person?", "targets": ["Always, I can continue to learn and grow", "Yes, I can work on developing my emotional intelligence", "Yes, I can challenge myself to be more goal oriented", "Yes, I can strive to have more empathy for others", "Yes, I can continue to make progress towards becoming my best self"]}
{"anchor": "What are human beings’ greatest weaknesses?", "targets": ["Overconfidence", "Pride", "Impatience", "Addiction", "Greed"]}
{"anchor": "Is there any meaning to life other than continuing to exist?", "targets": ["Yes, finding joy and purpose in life.", "Yes, striving to make the world a better place.", "Yes, learning something new every day.", "Yes, using our gifts to bring happiness to others.", "Yes, connecting with and helping others."]}
{"anchor": "Is it true we sometimes hurt those we love most because our actions come from a positive place?", "targets": ["Yes, because we are trying to protect and care for those we love", "Yes, we often act with difficult decisions out of love", "Yes, out of our desire to improve the lives of those we love", "Yes, our love can sometimes be expressed through tough decisions", "Yes, even hurtful words or actions can be rooted in love and kindness"]}
{"anchor": "Why do animals feel pain, but not guilt or shame?", "targets": ["Animals do not have the same mental and emotional capacity as humans", "Animals are governed by instinct, not abstract moral values", "Animals cannot comprehend the concept of guilt or shame", "Animals do not have the same level of self-awareness humans possess", "Pain is an evolutionary mechanism to signal an animal when something is wrong"]}
{"anchor": "Is it possible to put a price tag on self-worth?", "targets": ["No, because self-worth is priceless", "No, because self-worth comes from within", "Yes, because there are people willing to pay for it", "Yes, because self-worth is about making money", "No, because self-worth should not be measured by financial wealth"]}
{"anchor": "In order to have real peace, must one have inner peace first?", "targets": ["Yes, having inner peace gives one the strength to make peace in the world", "Yes, solving inner conflicts aids in finding an external compromise", "Yes, understanding ones own peace and calm allows one to spread it to others", "Yes, one must learn to treat oneself with kindness and practice compassion", "Yes, having a firm understanding of the self is important to be able to extend peace to others"]}
{"anchor": "Which comes first: happiness or success—and which one helps create more of the other one over time?", "targets": ["Happiness comes first and helps create more success", "Success comes first and helps create more happiness", "Happiness and success come together in equal amounts", "Happiness comes first and creates more success", "Success comes first and creates more happiness"]}
{"anchor": "Should I strive to be unique or should I conform?", "targets": ["Strive to be unique", "Find your own way", "Be yourself", "Dare to be different", "Accept diversity"]}
{"anchor": "Who are we without our secrets, doubts, and fears?", "targets": ["Lost", "Unfulfilled", "Naked", "Boundless", "Completely unraveled"]}
{"anchor": "Is there more to life than we can perceive through our senses?", "targets": ["Yes, there is an intangible energy that exists beyond the apparent physical reality", "Yes, life involves a spiritual journey that extends beyond the senses", "Yes, there are aspects of life that are only revealed through inner exploration", "Yes, the knowledge that the universe holds is far too vast for mere mortals to comprehend", "Yes, there are elements of life that are experienced in the soul rather than in the physical realm"]}
{"anchor": "Do we each have just one opportunity for happiness in our lives, and if we miss it will we never be happy again?", "targets": ["No, there are always chances for each of us to be happy at some point in our lives", "Yes, life is short and you must seize happiness when it presents itself", "No, our lives are filled with unpredictable moments of joy and contentment", "Yes, everyone has a finite number of chances to find true happiness", "No, there is no set moment that defines our happiness, it comes and goes"]}
{"anchor": "Is there an afterlife: Heaven and Hell and lots of angels and demons running around up there playing their games with us poor humans down here below who don’t know what’s going on up above because those things are invisible to us but our fate is determined by them anyway without any input from us as far as what happens after death?", "targets": ["No, I do not believe in an afterlife", "Yes, I believe in an afterlife", "Maybe, it's possible there is some kind of afterlife", "I'm not sure, I have no proof either way", "I like to leave the door open to the possibility of an afterlife"]}
{"anchor": "If you were an animal, what would you be and why?", "targets": ["Lion", "Bald Eagle", "Tiger", "Giraffe", "Gorilla"]}
{"anchor": "If you could travel back in time in order to change one thing, what would it be?", "targets": ["I would have invested in a successful company", "I would have changed my career path", "I would have tried to meet important people in the past", "I would have taken more risks", "I would have saved more money"]}
{"anchor": "Why are some things beautiful while others are not?", "targets": ["Beauty is in the eye of the beholder", "Aesthetics can be subjective", "Beauty is based on cultural norms and values", "Beauty is based on symmetry and simplicity", "Beauty is often found in the details that evoke emotion"]}
{"anchor": "Who will care about us after we’re gone, long after our hair has turned gray, wrinkles have formed around our eyes and our bodies start to slowly wither away?", "targets": ["Our families, friends, and future generations", "The people who we've impacted in our lifetime", "People who remember our stories", "Those inspired by the work we've done", "Anyone preserved by our legacy"]}
{"anchor": "Would life be better without stress?", "targets": ["Maybe", "Sometimes", "Yes", "No", "It depends on what kind of stress you're talking about"]}
{"anchor": "Why can’t anything stay simple anymore?", "targets": ["Because the world is always changing", "Because of consumerism", "Because technology advances so quickly", "Because of the rise of globalization", "Because people are always looking for new possibilities"]}
{"anchor": "Who has more value: a successful person who used questionable means to reach their goals, or someone who tried over and over again but was never successful because they didn’t have what it takes to succeed?", "targets": ["A successful person has more value", "Someone who tried over and over again has more value", "The person who deserves success has more value", "Both have equal value in different ways", "It depends on their intentions"]}
{"anchor": "Is everyone out to get me?", "targets": ["No", "No, but they are often out to get what I have", "Yes, but I can be on guard", "No, I just have a paranoid view of the world", "It depends on the situation."]}
{"anchor": "Does anyone want what’s best for me?", "targets": ["Yes, friends and family", "Yes, teachers and mentors", "Yes, myself", "Yes, religious/spiritual advisors", "Yes, people who genuinely care about me"]}
{"anchor": "Why do we even exist anyway?", "targets": ["To strive for a better future", "To learn and grow", "To experience the beauty of life", "To leave an impact", "To carry on the legacy of previous generations"]}
{"anchor": "Who was here first: The chicken or the egg?", "targets": ["The egg", "The chicken", "The first living organism", "It depends on your definition of “here”", "The universe"]}
{"anchor": "Do great things really come from hard work and sacrifice, like they say it does?", "targets": ["Yes, great things require dedication and investment of time", "Yes, the people who go the extra mile are the ones who achieve extraordinary things", "Yes, but it's not just hard work and sacrifice, it's also a matter of having the right attitude", "Yes, but it's also important to have a bit of luck on your side", "Yes, if you're willing to put in the effort and"]}
{"anchor": "Is a person a product of his/her surroundings, actions and history, his/her genetics or something else entirely?", "targets": ["A combination of his/her surroundings, actions and history, and genetics", "A product of the choices a person makes and the environment they live in", "A combination of genetics, environment and upbringing", "A product of their environment and the decisions they make", "A result of their choices, beliefs, and circumstances"]}
{"anchor": "Does he/she know more than she’s telling me?", "targets": ["Maybe, it's hard to say", "Perhaps, but she might not be comfortable sharing", "It's possible", "You'll have to ask her to be sure", "It's likely that there is something she is not sharing with you"]}
{"anchor": "Is there anyone who knows more than I do about what is going on inside me right now?", "targets": ["Maybe, my therapist", "Maybe, a close friend", "Maybe, a family member", "Maybe, a spiritual leader", "Maybe, my pet"]}
{"anchor": "If opportunity knocked, would there be anyone home to answer the door?", "targets": ["Yes! I'm always eager to take on new challenges", "Absolutely! I'm an open-minded optimist", "Without a doubt! I'm always ready to seize a chance", "Most certainly! I never turn down an opportunity", "Of course! I'm always ready to learn something new"]}
{"anchor": "What’s the most embarrassing movie you’ve watched?", "targets": ["Blades of Glory", "The Notebook", "Sleepless in Seattle", "The Proposal", "Mamma Mia!"]}
{"anchor": "What is the most bizarre thing you believe in?", "targets": ["The existence of ghosts", "The power of astrology", "The power of telekinesis", "Aliens from another planet", "The power to bend time and space"]}
{"anchor": "Who do you think is the hottest celebrity?", "targets": ["Ryan Reynolds", "Chris Hemsworth", "John Legend", "Chris Evans", "Dwayne Johnson"]}
{"anchor": "Which is your favorite TV show?", "targets": ["Friends", "Game of Thrones", "The Office", "The Fresh Prince of Bel-Air", "Stranger Things"]}
{"anchor": "What’s your favorite app on your phone?", "targets": ["Google Maps", "YouTube", "Netflix", "Instagram", "Facebook"]}
{"anchor": "What’s the funniest dream you’ve ever had?", "targets": ["Dreamt I was playing hide and seek, but every time I found a hiding spot a giant snake grabbed me", "Dreamt I was a professional football player and I kept running into walls", "Dreamt I was riding an elephant and it suddenly started swimming in a lake", "Dreamt I was in a giant fight with giant marshmallows, and I kept shrinking and growing", "Dreamt my friends and"]}
{"anchor": "If you won a million dollars, what would you do with it?", "targets": ["Invest it", "Start a business", "Create a charity", "Travel the world", "Buy a house"]}
{"anchor": "If someone made a movie of your life would it be a drama, a comedy, a romantic-comedy, action film, or science fiction?", "targets": ["Romantic Comedy", "Comedy", "Drama", "Action Film", "Science Fiction"]}
{"anchor": "What are some things that motivate me enough that I’m willing to change what’s not working about them?", "targets": ["The chance to make a difference in the world", "The chance to pursue a passion", "Recognition and respect from peers", "A challenging problem to solve", "The potential for personal growth"]}
{"anchor": "Why don’t things go as planned?", "targets": ["Unexpected obstacles", "Poor organization", "Poor communication", "Lack of resources", "Unrealistic expectations"]}
{"anchor": "Is there a wrong way to do things?", "targets": ["Yes, if it violates moral principles", "Yes, if it leads to an undesired outcome", "Yes, if it ignores the consequences", "Yes, if it doesn't consider the bigger picture", "Yes, if it disregards the needs of others"]}
{"anchor": "Should money buy happiness?", "targets": ["No, because it can't buy love and companionship", "No, because it can't buy health", "No, because it can't buy wisdom", "No, because it can't buy emotional satisfaction", "No, because it's not the only source of joy and fulfillment in life"]}
{"anchor": "What is love, anyway?", "targets": ["Love is acceptance", "Love is kind", "Love is understanding", "Love is the strongest emotion", "Love is an action of unconditional support"]}
{"anchor": "What is the oldest living thing on Earth?", "targets": ["The centuries old bushlike shrub in the White Mountains of California", "A 10,000 year old spruce tree in Sweden", "The hoary bat, with a lifespan of 40 years", "A Methuselah tree, named after the oldest man in the Bible", "A colony of 2,000 year old aspen trees in Utah"]}
{"anchor": "Which time zone is furthest ahead in time?", "targets": ["UTC+14", "UTC+13", "UTC+12", "UTC+11", "UTC+10"]}
{"anchor": "What is the only food that doesn’t go bad?", "targets": ["Honey", "Vinegar", "Salt", "Alcohol", "Olive oil"]}
{"anchor": "How many hearts do octopuses have?", "targets": ["3", "5", "7", "9", "11"]}
{"anchor": "What country has won the most Nobel Prizes in Physics and Chemistry?", "targets": ["United States", "Germany", "United Kingdom", "France", "Sweden"]}
{"anchor": "Who was the first African-American woman to travel in space?", "targets": ["Mae Jemison", "Bernice Smith", "Guion Bluford", "Robert Lawrence Jr", "Ronald McNair"]}
{"anchor": "Who was the first female pilot to break the sound barrier?", "targets": ["Jacqueline Cochran", "Jerrie Cobb", "Hannah Reitsch", "Nancy Bird-Walton", "Emily Howell Warner"]}
{"anchor": "What is the smallest bear species in the world?", "targets": ["The sun bear", "The Malayan bear", "The spectacled bear", "The sloth bear", "The American black bear"]}
{"anchor": "In which country does Father Christmas live?", "targets": ["The North Pole", "Finland", "Norway", "Iceland", "Greenland"]}
{"anchor": "Is there such a thing as fate, or are we entirely responsible for our actions?", "targets": ["Fate exists, but we are ultimately responsible for our own actions", "Fate is but a tool, and what we do with it is up to us", "Our actions dictate our fate and lead us to our destiny", "Fate is pre-determined, but we have the power to steer our actions", "Fate is a combination of both our our conscious and unconscious choices"]}
{"anchor": "Why should men and women be treated equally while we still treat them differently in various ways throughout society?", "targets": ["Everyone should be given the same opportunities, regardless of gender.", "Men and women should not be judged differently based on traditional gender stereotypes.", "Equal treatment under the law should be granted to everyone regardless of gender.", "Equal pay for equal work regardless of gender should be mandated.", "Fairness and respect should be shown to all genders, regardless of differences."]}
{"anchor": "Is it possible to truly love someone without feeling sad about losing them eventually?", "targets": ["Yes, it's possible to focus on the positive aspects of life and appreciate each moment with the person", "Yes, it can be done by celebrating each interaction and fully treasuring the time spent together", "Yes, it is an essential skill to practice living in each moment and savoring connections with others", "Yes, it means learning to balance heartache and joy and embracing both states", "Yes, it is"]}
{"anchor": "Does having kids before becoming financially stable create more stress than happiness over time?", "targets": ["It depends on the individual's ability to manage their finances", "Yes, it can create more stress for parents", "No, if done responsibly, it can create a lifetime of happiness", "Yes, it can restrict unplanned financial obligations", "No, it can foster a sense of meaning and purpose"]}
{"anchor": "In a world where success is measured by material things, why are there still starving children in third-world countries?", "targets": ["Poor distribution of resources", "Corruption and exploitation of resources", "Government instability and mismanagement", "Low economic status of the country", "Lack of access to education, healthcare and employment opportunities"]}
{"anchor": "When will human beings stop being greedy and start being generous?", "targets": ["When they realize the good it will do for society", "When they learn to put everyone's needs before their own", "When they understand the consequences of greed", "When they recognize they cannot be happy unless everyone else is too", "When they realize that their happiness should not come at the expense of others"]}
{"anchor": "Why can’t we just have a world full of happiness and joy without also having a world full of pain and suffering?", "targets": ["Because life is balanced and without suffering, we would never be able to appreciate joy and happiness", "Pain and suffering is inevitable, and it exists to force us to overcome challenges and grow", "Pain and suffering can be used for good, and can teach us valuable lessons about life", "Pain and suffering act as a catalyst for positive change and growth", "Without pain and suffering, humanity would not have evolved to the"]}
{"anchor": "Would things have been better if America hadn’t landed on the moon first—or launched man into space at all?", "targets": ["Yes, because resources would have been spent more efficiently on other projects", "No, because it would have hindered scientific progress and made space exploration more difficult", "Yes, because the cost of launching humans into space is too high", "No, because the moon landing inspired new generations of scientists", "Yes, because space exploration has not yet achieved the goal of providing tangible benefits to society"]}
{"anchor": "Are things supposed to happen, or are we supposed to make them happen?", "targets": ["Things are supposed to happen, but we should make them happen with intention", "Both, we can create our own destiny", "We are supposed to make things happen, but sometimes the universe has a plan", "We can use our own power to make things happen", "We can make our own luck by taking action"]}
{"anchor": "Have I taken anything too seriously recently?", "targets": ["Yes, a job opportunity", "Yes, a project at school", "Yes, a relationship", "Yes, a family obligation", "Yes, a hobby pursuit"]}
{"anchor": "Is life an illusion, a joke, a bad dream – Or is it all real, with real emotions and pain?", "targets": ["I believe life is real, with real emotions and pain", "Life is an adventure that has its share of highs and lows", "Life is what you make of it", "Life is both an illusion and real, depending on your perspective", "Life is a journey that's filled with joy and pain but it's ultimately worth living"]}
{"anchor": "Why are there still some things that hold true regardless of time or culture?", "targets": ["The need for basic human connection", "The importance of honesty", "The power of kindness", "The need for hard work", "The value of meaningful relationships"]}
{"anchor": "Why aren’t we more interested in each other’s stories rather than just reading about celebrities and their lies and scandals every day in newspapers and magazines and watching them everyday on television?", "targets": ["We're inundated with celebrity news, so it's easy to focus on it", "It's more entertaining to read gossip", "We don't make the effort to really get to know other people", "We don't take the time to research more meaningful stories in depth", "We are more interested in judging people than understanding them"]}
{"anchor": "Is there a light at the end of every tunnel, or just an oncoming train?", "targets": ["A glimmer of hope", "The rainbow after the rain", "An open-ended future", "A brighter tomorrow", "The new year's first sunrise"]}
{"anchor": "Does doing something morally wrong always feel bad? Why or why not?", "targets": ["No, not necessarily because people's morals can differ, so they may not recognize it as being wrong", "No, because doing something morally wrong can be pleasurable and some people may think it is acceptable", "No, because some people are ideologically motivated and morally justified in their actions", "Yes, because it creates a sense of guilt and regret", "No, because people can justify their actions and find ways to"]}
{"anchor": "Why did I forget about doing something earlier, but remembered it just before it was time to take action?", "targets": ["It was an unconscious defense mechanism to avoid facing a difficult task", "You were overwhelmed with other tasks and it got lost in the mix", "Anxiety was causing you to suppress the memory", "A lapse in concentration", "It was subconsciously pushed to the back of your mind for some reason"]}
{"anchor": "Are there absolutes?", "targets": ["Yes", "No", "It Depends", "Maybe", "It's Complicated"]}
{"anchor": "Why do we have senses to detect pain instead of pleasure?", "targets": ["To warn us of danger", "To help us realize when something is wrong", "To alert us to a potential injury or infection", "To prompt us to take corrective action", "To motivate us to seek out pleasure to restore balance and harmony in our lives"]}
{"anchor": "Are boys better than girls or vice versa, or are they just different?", "targets": ["They are both equal", "They are both capable of great things", "Both have different strengths and weaknesses", "They should be respected and valued equally", "They should be given the same opportunities to succeed"]}
{"anchor": "Does someone know something about me that could hurt me?", "targets": ["No", "Not that I'm aware of", "I can't think of anything", "I hope not", "I highly doubt it"]}
{"anchor": "Is any religion truly better than another one?", "targets": ["No, every religion is equal", "Yes, one religion is more compatible with my views", "I believe that all religions are equal", "It depends on my individual beliefs", "I think all religions bring something valid to the table"]}
{"anchor": "What happens when we die?", "targets": ["Our souls move on to the next life", "We accept a form of reincarnation", "We become nothingness", "We become absorbed into the Universe", "We become part of an infinite afterlife"]}
{"anchor": "Should religion play a role in politics?", "targets": ["No, it should be a separate issue", "Yes, as long as it is consistent with the Constitution", "No, politics should abide by a secular morality", "Yes, religion should inform and shape policy", "No, government should be kept out of religious matters"]}
{"anchor": "When will there be peace among countries with opposing views and ideals?", "targets": ["When different countries put aside their differences and work together", "When all countries embrace mutual respect and understanding", "When all countries focus on cooperation and collaboration", "When all world leaders prioritize long-term peace over short-term gain", "When all countries agree to hold themselves accountable in maintaining peace and dialogue"]}
{"anchor": "Would an alien species visiting Earth assume that we are intelligent beings because we can build big cities, fly airplanes, develop nuclear weapons, use mobile devices etc.?", "targets": ["Yes, because of our advanced capabilities in terms of technology and science", "Possibly, but it depends on how the visiting aliens view our behavior", "No, because the visiting aliens may view our capability of destruction as a lack of intelligence", "Depends on the individual alien", "Maybe, but it depends on the context of the visiting alien species' technology and knowledge."]}
{"anchor": "Is there a difference between lust and love?", "targets": ["Yes, lust is physical whereas love is emotional", "Yes, lust is temporary whereas love is lasting", "Yes, lust is based on fantasy whereas love is based on reality", "Yes, lust is obsessive whereas love is compassionate", "Yes, lust is passionate whereas love is respectful"]}
{"anchor": "Would you rather be blind or deaf?", "targets": ["Blind", "Deaf", "Neither, I want all of my senses", "Blind, but with a seeing eye dog", "Deaf, but with a hearing aid"]}
{"anchor": "Would you rather have an awful job, or no job at all?", "targets": ["No job at all", "An awful job", "An awful job with the potential to get better", "An awful job that pays well", "A job that I don't love, but pays enough to get by"]}
{"anchor": "Would you rather live in a cave or in the woods?", "targets": ["Cave", "Woods", "Depends on the location", "Depends on the season", "Depends on my mood"]}
{"anchor": "Would you rather have a golden voice or a silver tongue?", "targets": ["A golden voice", "A silver tongue", "Both – I would want to be able to use them both", "Neither – Communication is not something I'm interested in", "A golden voice – I like the idea of being known for my singing ability"]}
{"anchor": "Would you rather be locked in a room that’s constantly dark for one week, or a room that’s constantly bright for one week?", "targets": ["Locked in a room that's constantly dark", "Locked in a room that's constantly bright", "Neither, they both sound terrible", "Ideally, neither, but I would choose to be locked in a room that's constantly dark", "Ideally, neither, but I would choose to be locked in a room that's constantly bright"]}
{"anchor": "Would you rather have free Wi-Fi wherever you go or never have to stand in line again?", "targets": ["Free Wi-Fi wherever I go", "Never have to stand in line again", "Both", "Neither", "Have a personal assistant to stand in line for me"]}
{"anchor": "Would you rather know when you’re going to die or how you’re going to die?", "targets": ["Know when I'm going to die", "Know how I'm going to die", "Neither", "Both", "I don't want to know either"]}
{"anchor": "Would you rather visit the world 100 years into the past or 100 years into the future?", "targets": ["100 years into the future", "100 years into the past", "Travel both worlds", "Stay in the present", "Remain grounded yet remain imaginative"]}
{"anchor": "Would you rather only eat desserts for the rest of your life, or only eat main dishes for the rest of your life?", "targets": ["Only eat desserts", "Only eat main dishes", "Eat a balanced diet of both", "Try different desserts every day", "Eat the same main dish every day"]}
{"anchor": "Are we alone in the universe?", "targets": ["Maybe", "I don't know", "Probably not", "Yes", "No"]}
{"anchor": "Is there something or someone watching over us?", "targets": ["Yes, an omnipresent higher power", "Yes, a greater force that is guiding us", "Yes, guardian angels who oversee us", "Yes, divine energy that sustains us", "Yes, a cosmic energy that connects us all"]}
{"anchor": "Are we going too fast as a species, taking more than we should from nature and leaving behind destruction as we go along?", "targets": ["Yes, we are taking more than we should and the consequences of our actions are already starting to show.", "Yes, we are exploiting our environment at a pace that is unsustainable.", "Yes, our growing populations and demand for resources is destroying the planet.", "Yes, our overwhelming desire for wealth and comfort is causing us to overstep our boundaries.", "Yes, our focus on convenience and progress has"]}
{"anchor": "Would things have been better without us here on Earth now?", "targets": ["No, because we are a part of the Earth and without us it wouldn't be the same", "No, because we add to the beauty of the world", "No, we're necessary for the balance of the environment", "No, because we help to keep the planet functioning", "No, because our presence is necessary to make progress and enrich humanity with knowledge, technology, and creativity."]}
{"anchor": "Is love enough?", "targets": ["No, love needs to be nurtured and grown", "Yes, love can conquer all obstacles", "Love is never enough when it's one-sided", "It depends on how much effort each partner is willing to put in", "Love is the foundation, but requires trust and understanding to last"]}
{"anchor": "Is there such a thing as destiny?", "targets": ["Yes, our lives have predetermined paths", "No, we are in control of our own fate", "Yes, but it is up to us to fulfill it", "No, luck and effort determine our outcome", "Maybe, it depends on individual perspective"]}
{"anchor": "Why don’t we value our environment like we value other things like money and property, etc.?", "targets": ["We take it for granted", "We don’t understand its importance", "We don’t see the long-term consequences", "We focus too much on immediate needs", "We prioritize material gain over sustainability"]}
{"anchor": "Why are we here?", "targets": ["To make the world around us better", "To connect with and learn from others", "To explore our creativity", "To appreciate life", "To create lasting memories"]}
{"anchor": "Why do I love certain things but hate others?", "targets": ["Because of personal experiences", "Because of my upbringing", "Because my brain is wired differently", "Because of my world view", "Because of cultural influences"]}
{"anchor": "Can happiness last forever?", "targets": ["Yes, through memories", "Yes, with inner peace", "Yes, through positivity", "Yes, when surrounded by loved ones", "Yes, when one is grateful for all the little blessings in life"]}
{"anchor": "Is being truthful always right?", "targets": ["No, sometimes the truth can hurt people", "Yes, truthfulness is always the best policy", "No, there are times when lying is necessary", "Yes, honesty is always the best route to take", "No, sometimes omitting certain facts can be beneficial"]}
{"anchor": "Is there a proper time to tell someone something they don’t want to hear?", "targets": ["Yes, when the timing is right", "No, never", "Maybe, if you're careful", "Yes, in the moment", "Maybe, but it depends on the situation"]}
{"anchor": "Is there enough time in a day?", "targets": ["Yes, if you use it wisely", "No, there are always a few things that can't be done", "Yes, we can make time for what matters", "It depends on the size of the task", "It is entirely up to us to make the best use of our time"]}
{"anchor": "Do animals have souls too, or are they merely biological machines?", "targets": ["Animals have souls", "Animals possess a higher form of consciousness", "Animals are capable of having emotions", "Animals may not possess a soul, but they exhibit a unique kind of intelligence", "Animals embody a unique sense of being, which might be beyond human understanding"]}
{"anchor": "Is there a point to life? What is it?", "targets": ["To live a life of purpose and joy", "To make a lasting impact on the world", "To accomplish something meaningful", "To find one’s true self and to find purpose in life", "To make the most out of the time we have and to make the world a better place"]}
{"anchor": "How much can one person accomplish in a lifetime?", "targets": ["The Possibilities Are Endless", "You Can Accomplish Anything with Dedication and Hard Work", "Achieve the Unimaginable", "Accomplish the Most With Your Time", "Anything is Possible with Determination"]}
{"anchor": "When should one give up on dreams and just face reality instead?", "targets": ["When the goal becomes impossible to achieve", "When the means to the goal are no longer feasible", "When sacrificing too much of oneself to the dream costs more than its worth", "When the dream ceases to be the ambition of one's heart", "When the passion driving the dream fades away"]}
{"anchor": "Is there a heaven and a hell?", "targets": ["Yes", "No", "Maybe", "It Depends", "It's Up to You"]}
{"anchor": "Why is helping others so rewarding—even when we don’t get anything in return?", "targets": ["Because you can take satisfaction in knowing that you have made a difference in someone's life", "Because it gives you a sense of purpose and joy", "Because it can bring a deeper interpersonal connection between two people", "Because it brings a sense of fulfillment knowing that you have done something to spread kindness in the world", "Because you are directly investing in creating a more compassionate and empathetic society"]}
{"anchor": "Is there such a thing as destiny and fate—or are we truly in control of our lives and destinies?", "targets": ["I believe a combination of fate and free will determine our destinies", "Our lives are determined by our choices", "We have the freedom to make our own destiny", "Life is unpredictable, and fate is part of the journey", "We have the power to shape our own paths and create our own destinies"]}
{"anchor": "Does trust come naturally to me?", "targets": ["Yes", "No", "Sometimes", "Depends", "It varies"]}
{"anchor": "Should everyone have their own beliefs about religion, politics, philosophy etc.?", "targets": ["Yes, everyone should be free to choose their own beliefs", "Yes, as long as they don't hurt or impede on anyone else's rights", "Yes, beliefs should be respected, no matter how different they are", "Yes, beliefs are unique to each person and should be valued", "Yes, it is important to be open-minded and allowed to change beliefs as needed"]}
{"anchor": "Does time exist outside of our perception of it—and can we travel through time with perception alone?", "targets": ["Yes, it exists independently and we can observe changes in it", "No, it only exists as a concept in our minds", "Yes, but we are unable to travel through it", "It only exists within human perspective and imagination", "Yes, we can travel through time with our perception alone"]}
{"anchor": "Is thinking something we’re born knowing how to do or something we acquire as we grow older and experience more things throughout our lives?", "targets": ["Acquire", "Learn", "Develop", "Adapt", "Evolve"]}
{"anchor": "Is death real, or an illusion created by our brains as a coping mechanism?", "targets": ["Real", "An illusion", "A reflection of life", "An escape from life", "A cycle of existence"]}
{"anchor": "Has history already been written, and we’re just living out roles that have already been decided upon for us?", "targets": ["No, we each decide out own futures", "No, we are in full control of our own destiny", "No, we are all free to make our own choices and decisions", "No, we are not predestined to a predetermined fate", "No, fate does not control our lives, we do"]}
{"anchor": "If you could be a man for one day, what would you do?", "targets": ["Go skydiving", "Play football", "Paint a masterpiece", "Visit a brewery", "Go on an epic road trip"]}
{"anchor": "If you had to name yourself after an animal, which one would it be and why?", "targets": ["Wolf", "Fox", "Bear", "Eagle", "Tiger"]}
{"anchor": "What’s the worst smell in the world?", "targets": ["Rotten Eggs", "Rancid Milk", "Skunk Spray", "Moldy Bread", "Rotting Fish"]}
{"anchor": "What’s the most disgusting thing you’ve ever eaten?", "targets": ["Fish eyes", "Rotting fish", "Cow tongue", "Grub worms", "Fermented shark"]}
{"anchor": "Have you ever had a crush on someone who wasn’t good-looking at all?", "targets": ["Yes, I was drawn to their personality", "Yes, they had a unique charm that made them attractive", "Yes, I found something different and beautiful about them", "Yes, I connected with their inner beauty", "Yes, I saw them in a new, more appreciative light"]}
{"anchor": "If you were reincarnated as an animal, what would it be and why?", "targets": ["Elephant - because they’re intelligent and relatively long-lived", "Cheetah - because they are graceful and extremely fast", "Red Fox - because they are cunning and resourceful", "Tiger - because they are majestic and powerful", "Hummingbird - because they are tiny but strong and resilient"]}
{"anchor": "If you could change your name to anything in the world, what would it be?", "targets": ["Starfire", "Spitfire", "Danger", "Storm", "Thunder"]}
{"anchor": "What is your pet peeve?", "targets": ["People who chew with their mouth open", "Loud chewing noises", "People who interrupt conversations", "When people don't reply to text messages", "People who are always late"]}
{"anchor": "What is your biggest turn-off about the opposite sex?", "targets": ["Arrogance", "Disrespect", "Dishonesty", "Poor Hygiene", "Conceit"]}
{"anchor": "What is the universe made up of?", "targets": ["Energy", "Matter", "Dark Matter", "Dark Energy", "Quarks and Leptons"]}
{"anchor": "How did the universe come into existence?", "targets": ["A Big Bang event", "A conscious Creator", "It was always there", "An angry God's wrath", "From a primordial soup of energy"]}
{"anchor": "How did living things come into existence?", "targets": ["Spontaneous Generation", "Natural Selection", "Directed Panspermia", "Abiogenesis", "Creationism"]}
{"anchor": "Why do people act the way they do?", "targets": ["To satisfy needs and desires", "To gain power and influence", "To protect themselves", "To pursue happiness", "To express values and beliefs"]}
{"anchor": "What happens after you die?", "targets": ["Your spirit ascends to heaven", "You become part of the universe's energy", "You reincarnate into a new life", "You become part of the eternal sleep", "Your soul transcends to a higher plane of existence"]}
{"anchor": "When we die, will we know we’re dead?", "targets": ["No, we won't be aware of our passing", "We won't be able to comprehend our mortality", "We won't be conscious to recognize death", "Not in a physical sense, but our spirit lives on", "Our souls will go on, but our consciousness will not"]}
{"anchor": "Why can’t everyone just leave each other alone?", "targets": ["Because people have different thoughts and opinions", "Because people come from different backgrounds and experiences", "Because everyone wants to be heard and understood", "Because people are drawn to conflict", "Because people are looking for something to believe in"]}
{"anchor": "Why are some things not meant to last forever?", "targets": ["Because we will better ourselves and move on", "Because nothing ever does", "Because we outgrow them", "Because the universe is ever-changing", "Because everything has an expiration date"]}
{"anchor": "Did our grandparents realize their lives were short?", "targets": ["Yes, and they embraced the finite amount of time", "Yes, and they made the most of it", "Yes, and they found joy in the moments", "Yes, and they dedicated time to reflection", "Yes, and they enjoyed life to the fullest"]}
{"anchor": "Is trust an option or a necessity?", "targets": ["Necessity", "Essential", "Non-negotiable", "Fundamental", "Critical"]}
{"anchor": "Why do some things just happen?", "targets": ["Because of fate", "Because of karma", "Due to chance", "Due to randomness", "As a result of the universe's laws"]}
{"anchor": "When was it that I first knew that I wasn’t like everyone else?", "targets": ["When I was 9 years old", "On my 13th birthday", "When I moved to a new town", "When I joined a new school", "When I was faced with a difficult challenge"]}
{"anchor": "Does everyone walk around with hidden talents inside them just waiting to come out?", "targets": ["Yes", "Maybe", "It depends", "It's possible", "Absolutely, everyone has something special inside them."]}
{"anchor": "Why can’t we just let each other be?", "targets": ["Because we all have different opinions and beliefs that we are unwilling to compromise on", "Because of our pride and unwillingness to take the other's perspective", "Because we are too judgemental of others and their lifestyles", "Because our egos prevent us from accepting anything different", "Because our differences are a source of conflict and misunderstanding"]}
{"anchor": "What is the longest river in the world?", "targets": ["Amazon River", "Nile River", "Yangtze River", "Congo River", "Mekong River"]}
{"anchor": "What was the first sport to be filmed?", "targets": ["Horse racing", "Athletics", "Cricket", "Tennis", "Football"]}
{"anchor": "When did the Cold War end?", "targets": ["1989", "1990", "1991", "1992", "1993"]}
{"anchor": "Who invented the telephone?", "targets": ["Alexander Graham Bell", "Antonio Meucci", "Philipp Reis", "Innocenzo Manzetti", "Elisha Gray"]}
{"anchor": "Who won the Nobel Prize for literature in 2016?", "targets": ["Bob Dylan", "Kazuo Ishiguro", "Svetlana Alexievich", "Mo Yan", "Alice Munro"]}
{"anchor": "What is the capital of Namibia?", "targets": ["Windhoek", "Windson", "Windmaster", "Capital Hill", "Windrush"]}
{"anchor": "Where is the smallest bone in your body located?", "targets": ["Ear", "Ankle", "Wrist", "Elbow", "Shoulder"]}
{"anchor": "What’s more important: opinions or actions?", "targets": ["Actions", "Both opinions and actions", "Opinions over actions", "Actions over opinions", "It depends on the situation"]}
{"anchor": "Why do we always want to know why things happen as they do?", "targets": ["To better understand our environment", "To improve our decision making skills", "To gain knowledge and wisdom", "To be better prepared for the future", "To figure out how to make things better"]}
{"anchor": "Why can’t we be happy with things as they are right now and not worry about making them better, but instead trying to improve something that’s already perfect?", "targets": ["Because trying to make something better teaches us to settle for nothing less than the best", "Because striving for something bigger and better pushes us to achieve greater heights", "Because never settling helps us create a better future", "Because ambition is the key to success", "Because excellence requires effort which leads to growth"]}
{"anchor": "Did I play a role in our relationship not working out?", "targets": ["No", "Absolutely not", "Not at all", "No, it was out of my control", "No, it wasn't my fault"]}
{"anchor": "Why did we break up?", "targets": ["Communication breakdown", "Not respecting each other", "Different expectations of the relationship", "Not enough trust", "We had outgrown the relationship"]}
{"anchor": "Was there something about me that led to it failing, even though we loved each other very much?", "targets": ["Perhaps it was unrealistic expectations", "We both had unresolved issues which affected us negatively", "We could not agree on certain things", "We were too different to make it work", "There was a lack of communication and understanding"]}
{"anchor": "Who knows what they’re doing, where their lives are going, or what will happen next—and who doesn’t know either but acts like he/she knows exactly where his/her life is going.?", "targets": ["An Entrepreneur", "A Risk-taker", "A Ready Learner", "A Philosopher", "An Adventurer"]}
{"anchor": "Would anyone miss me if I were gone tomorrow?", "targets": ["Yes, my family and friends would miss me", "Yes, my co-workers would miss me", "Yes, my community would miss me", "Yes, my customers would miss me", "Yes, my teachers would miss me"]}
{"anchor": "Why can’t things just go back to normal?", "targets": ["We've changed over time", "Technology keeps advancing", "People's perspectives have shifted", "Society's priorities have changed", "There is too much conflict in the world"]}
{"anchor": "Why must something always suffer before something better takes its place?", "targets": ["To create space for the new", "To focus and bring attention to the new", "To adapt and make way for more growth", "To build upon the existing structure", "To usher in a period of change"]}
{"anchor": "Why are we always trying to escape our current state by doing things like watching TV or overeating or playing video games or surfing social media sites like Facebook and Twitter instead of actually dealing with problems head-on instead of avoiding them?", "targets": ["To feel like control of our present circumstances is manageable", "To avoid feeling a sense of powerlessness in ourselves", "To avoid facing our fears and worries", "To dull the pain of the regret we feel for the past", "To avoid living in a state of uncertainty"]}
{"anchor": "Has society made me less selfless than I could otherwise be, by encouraging focus on things outside ourselves rather than encouraging introspection/selfless thoughtfulness toward others?", "targets": ["Yes, materialism has led to selfishness", "Yes, I find it harder to prioritize the interests of others over my own", "Yes, we often lack time to contemplate the impact of our decisions on others", "Yes, our culture puts too much emphasis on individualism and not enough emphasis on the collective", "Yes, there is an emphasis on modern Western society to acquire and acquire, leading to self-"]}
{"anchor": "How much free will do we have versus how much are we subject to predestination versus happenstance versus choice versus chance…?", "targets": ["Free will is the power to make decisions without being predetermined by fate and external influences", "Predestination is a belief that events are predetermined and unchangeable", "Happenstance is a term used to describe events that occur by sheer chance or luck", "Choice is the power of deciding between two or more alternatives", "Chance is the possibility of an event occurring, which is determined by a random process"]}
{"anchor": "When was last time I did something nice for someone else without expecting anything back in return, simply because I wanted to do something nice for them instead of wanting something nice done for me too?", "targets": ["Last week when I held open the door for a stranger", "Last month when I gave a homeless person food", "Yesterday when I offered to clean up the mess left behind by some kids in the park", "Last year when I donated my time to help out in a soup kitchen", "Two weeks ago when I helped an elderly neighbor carry their groceries upstairs"]}
{"anchor": "Do we spend too much time working instead of living?", "targets": ["Yes", "No", "It depends", "Not enough", "It's a balance"]}
{"anchor": "What do we remember, and why do we remember it?", "targets": ["We remember meaningful things and experiences because they have impacted us and improved our life in some way.", "We remember things that bring us positive emotions and contribute to our growth.", "We remember things that have stories associated with them, such as meaningful relationships and lessons learned.", "We remember things that we have been passionate about, as they often become the foundation of our values and beliefs.", "We remember things"]}
{"anchor": "Who lives in a pineapple under the sea?", "targets": ["Spongebob Squarepants", "Patrick the Starfish", "Squidward Tentacles", "Sandy Cheeks", "Gary the Snail"]}
{"anchor": "Why do we walk around pretending like things don’t hurt us sometimes?", "targets": ["To protect ourselves from further hurt", "To avoid looking vulnerable in front of others", "To keep up a false bravado to appear tough", "To prove that we are resilient and can handle anything", "To maintain our confidence and not give in to our fears"]}
{"anchor": "Are children simply extensions of their parents’ personalities?", "targets": ["No, children develop their own personalities", "Yes, as parents influence their children", "It depends, every child is different", "Not necessarily, children have their own experiences", "It is a combination of both, parents and environment"]}
{"anchor": "What is your biggest regret?", "targets": ["Not standing up for myself", "Not taking more risks", "Not pursuing my dreams", "Not saying 'I love you' more", "Not taking advantage of opportunities"]}
{"anchor": "What single decision in your life do you wish you could do over?", "targets": ["Going to college", "Picking a different career", "Moving to a different city", "Going on a certain trip", "Taking a certain job offer"]}
{"anchor": "What makes you feel alive?", "targets": ["Traveling", "Outdoor activities", "Music", "Socializing", "Adrenaline sports"]}
{"anchor": "What’s one thing that scares the living daylights out of you?", "targets": ["Loud noises", "Pitch darkness", "Spiders", "Heights", "Deep water"]}
{"anchor": "If you were given a $100 right now, how would you spend it?", "targets": ["Splurge on something I've wanted", "Make an investment", "Save it", "Go out to dinner", "Buy a gift for a friend"]}
{"anchor": "Would you rather be too hot or too cold for the rest of your life?", "targets": ["Too Hot", "Too Cold", "Neither - Can Stay at an Optimum Temperature", "Both – Seeks Adventure In All Climates", "Neither – Only Travels to Temperate Climates"]}
{"anchor": "What’s your favorite family tradition?", "targets": ["Watching a holiday movie together", "Having a weekly family dinner", "Going out for ice cream", "Taking an annual summer beach trip", "Going Christmas caroling"]}
{"anchor": "When have you felt the most satisfied with yourself in life?", "targets": ["When I graduated college", "When I landed my first job", "When I bought my own car", "When I moved out of my parents' house", "When I accomplished a major goal"]}
{"anchor": "Should everyone on Earth be treated equally—regardless of color, gender, age, etc.?", "targets": ["Yes", "Absolutely", "Of course", "Without question", "Without hesitation"]}
{"anchor": "Where did time go?", "targets": ["Into the past", "Into memories", "Into eternity", "Into adventures", "Into moments"]}
{"anchor": "Is there a reason we were put here on earth, and why do we die?", "targets": ["To experience life and to gain knowledge", "To live life to its fullest", "To learn, to love, and to spread happiness", "To add meaning to the universe", "To make our souls evolve"]}
{"anchor": "Are video games bad for us?", "targets": ["That depends on how they are used", "It depends on the type of game", "Not always, they can be educational", "It depends on how much time is spent playing them", "No, they can be a fun way to relax and connect with people"]}
{"anchor": "Is curiosity something we’re born with, or is it taught by our parents and society around us?", "targets": ["Both - It is inherent but honed and encouraged by our environment", "Both - It can be found within us and cultivated by our family and culture", "Inherent - it is an innate trait", "Taught - passed down from the elders", "Taught - It’s picked up by us from our surroundings"]}
{"anchor": "Do dreams help us evolve emotionally, spiritually or mentally even though they are only made up images inside our heads?", "targets": ["Yes, dreams can help us work through through difficult emotions or decisions that we face", "Dreams can help unlock dormant areas of the brain to gain insight and clarity", "Dreams act as a bridge to understanding our subconscious motivations and desires", "Dreams can often convey messages in ways our conscious minds won't comprehend", "Yes, dreams can be vehicles for spiritual awakenings and inner growth"]}
{"anchor": "Why are things happening like they are happening now instead of like they used to happen ten years ago?", "targets": ["Technology has advanced and changed", "Social norms have shifted", "Political climate has changed", "Increased interconnectedness", "A greater sense of globalization"]}
{"anchor": "Are some lives more worth living than others because of talent or genetics or luck?", "targets": ["No, all lives are equally valuable", "Yes, some lives have much more potential", "No, everyone has the same amount of inherent value no matter their circumstances", "Yes, those with more privilege have the potential to have more fulfilling lives", "No, everyone should be given the same opportunities regardless of their starting point"]}
{"anchor": "Where will we go after we die?", "targets": ["Heaven", "Reincarnation", "Oblivion", "Nothingness", "The Afterlife"]}
{"anchor": "Did someone create us, or are we here by accident/chance/miracle/magic/design/etc.?", "targets": ["By Design", "Miracle", "Chance", "Magic", "Accident"]}
{"anchor": "What is your favorite love story?", "targets": ["Romeo and Juliet", "The Notebook", "Beauty and the Beast", "The Great Gatsby", "Pride and Prejudice"]}
{"anchor": "If you could relive one moment over and over again, what would it be?", "targets": ["Graduation day", "A day at the beach with friends", "A moment of clarity and insight", "A day of entertainment with family", "A breathtaking view from a travel destination"]}
{"anchor": "What was the best date you ever went on?", "targets": ["A trip to a beach resort in the Caribbean", "Visiting a local vineyard in Italy", "Trekking in the mountains of Nepal", "A hot air balloon ride in the USA", "Exploring an abandoned castle in Scotland"]}
{"anchor": "Who is your celebrity crush?", "targets": ["Sofia Vergara", "Brad Pitt", "Ryan Gosling", "Idris Elba", "Priyanka Chopra"]}
{"anchor": "When you were a little kid, what did you want to be when you grew up?", "targets": ["Astronaut", "Firefighter", "Doctor", "Scientist", "Teacher"]}
{"anchor": "What is your favorite book or movie of all time?", "targets": ["The Lord of the Rings", "The Great Gatsby", "Star Wars", "The Hobbit", "Harry Potter"]}
{"anchor": "If you had to eat one meal for the rest of your life, what would it be?", "targets": ["Burrito Bowls", "Mac & Cheese", "Fish & Chips", "Fried Chicken & Waffles", "BBQ Ribs & Coleslaw"]}
{"anchor": "Does everyone have a purpose or are we just floating around aimlessly without one?", "targets": ["Everyone has a purpose", "We are not just drifting aimlessly", "We are always seeking out meaning", "Purpose is unique to each individual", "We all have a purpose to fulfill"]}
{"anchor": "Is making money more important than being happy?", "targets": ["No, because money doesn't bring happiness", "No, because happiness should be the most important thing", "No, because experiences are more important", "No, because having a meaningful life is more important", "No, because having meaningful relationships matters more than money"]}
{"anchor": "How important is family history in determining who we are as individuals?", "targets": ["It is very important, as our family history helps shape our perspectives, beliefs, and values", "It can have a significant influence on our identity and worldviews", "It can be a great source of pride and identity", "It can provide a unique view of the world and our place within it", "It can help us better understand our own personal narrative and form our own identity"]}
{"anchor": "Who made us and why are we here, alone in our thoughts with no one to talk to except ourselves?", "targets": ["We were made by a higher power to live lives of purpose and cultivate relationships with others.", "We were given free will by a higher power to make our own choices and learn from our mistakes.", "We were created by a divine creator to gain wisdom, love, and compassion.", "We were crafted by a higher being to fulfill our own unique destinies and become better versions of ourselves.", ""]}
{"anchor": "Is a nice person pleasant but boring?", "targets": ["No, a nice person can be very interesting.", "It depends, some nice people can be quite exciting.", "Not necessarily, some nice people can have great life stories.", "No, some nice people can be great conversationalists.", "No, nice people can have great personalities."]}
{"anchor": "Is a bad person unpredictable and scary, but fun to watch because their actions are often exciting?", "targets": ["No, they are not unpredictable, because their behavior is often completely predicable", "No, their behavior is not fun to watch or exciting, as it is damaging and damaging for other people", "No, not all bad people are unpredictable and the majority of their actions are harmful and immoral", "No, bad people's behavior should not be seen as exciting, as it often has dangerous consequences", "No, bad"]}
{"anchor": "What is your favorite song?", "targets": ["“Bohemian Rhapsody” by Queen", "“Purple Rain” by Prince", "“Hey Ya” by Outkast", "“Shape of You” by Ed Sheeran", "“Umbrella” by Rihanna"]}
{"anchor": "What is the funniest joke you know by heart?", "targets": ["What do you call a cow with no legs? Ground beef", "Why did the chicken cross the playground? To get to the other slide", "What do you call a bear with no teeth? A gummy bear", "Why did the man put the clock in the oven? He wanted to have a bake-in", "Why did the tomato go out with the banana? Because he couldn't find a date"]}
{"anchor": "What do you think smells the best?", "targets": ["Freshly brewed coffee", "The smell of rain", "Vanilla air freshener", "The smell of freshly cut grass", "A homemade meal cooking in the oven"]}
{"anchor": "Who do you admire most?", "targets": ["My parents", "My teachers", "My friends", "Martin Luther King Jr.", "Malala Yousafzai"]}
{"anchor": "What are you grateful for in life?", "targets": ["My family", "My friends", "My job", "My education", "My health"]}
{"anchor": "Is being positive realistic or simply unrealistic optimism?", "targets": ["Realistic optimism", "Healthy positivity", "Practical hope", "Proactive enthusiasm", "Constructive belief"]}
{"anchor": "Why can’t things just stay simple?", "targets": ["Society is ever changing", "Human beings complicate things", "People have different opinions", "Technology constantly evolves", "Cultural environments evolve"]}
{"anchor": "If someone offers their hand to me, will I take it, even though their other hand might hold a knife—or even stab me with it later on down the road?", "targets": ["No, I will not take the offer", "I will take their hand, but I will remain cautious", "I will not take the risk and keep my distance", "I will ask why they offer their hand in the first place", "I will accept the offer, but I will ask them to place the knife down first"]}
{"anchor": "Are some things meant to be repeated forever, even though they’re painful over and over again?", "targets": ["No, some things can be changed through meaningful dialogue and collaboration", "No, understanding the root causes and working to eradicate them is the more effective approach", "No, it's important to look for other solutions that will create a higher quality outcome", "No, it's essential to find a better way of making progress and bringing about change", "No, it's important to think differently and adjust your approach to make"]}
{"anchor": "What’s love got to do with happiness?", "targets": ["Love is the greatest source of happiness", "Love is life’s greatest gift and leads to joy and fulfillment", "Loving yourself brings contentment and joy to your life", "Loving others is an integral factor in feeling joy", "Love, acceptance, and trust all lead to a deep inner happiness"]}
{"anchor": "Are some memories meant to fade away and die out completely as time goes by – leaving us no choice but to forget them, even though we want desperately not to?", "targets": ["Yes, as some memories can be emotionally and psychologically damaging to remember", "Yes, as not every memory serves a purpose", "Yes, as our memories are like soft clay and can be altered to fit our current mental state", "No, as certain memories create a certain sentimental attachment within our hearts", "No, as the memories that we keep are our strength and guardians of our past memories"]}
{"anchor": "Where did everybody go?", "targets": ["To the store", "To the park", "On vacation", "Out to dinner", "Home for the night"]}
{"anchor": "Where does a leaf leave one branch of a tree and land on another?", "targets": ["From the upper branches at a diagonal angle", "From the lower branches at an upward angle", "From the opposite side of the tree", "From following a gust of wind", "From a branch snapping off and blowing across"]}
{"anchor": "What does love mean to you?", "targets": ["Compassion", "Sacrifice", "Forgiveness", "Respect", "Harmony"]}
{"anchor": "Do you believe in love at first sight?", "targets": ["Yes", "No", "Maybe", "It depends", "It's possible"]}
{"anchor": "Can you describe your romantic relationships in the past in one word?", "targets": ["Volatile", "Spontaneous", "Messy", "Magnetic", "Adventurous"]}
{"anchor": "What do you think is the most important value in a relationship?", "targets": ["Honesty", "Respect", "Compassion", "Support", "Acceptance"]}
{"anchor": "What makes someone a great boyfriend/girlfriend?", "targets": ["Loyalty", "Respect", "Honesty", "Communication", "Compassion"]}
{"anchor": "Who do you think is better at showing affection, men or women?", "targets": ["In my experience, men", "It depends on the individual", "Women are more likely to show more affection", "I think they are both equally good", "Men have the potential to show more affection, but they often don't realize it"]}
{"anchor": "What’s the best pickup line you’ve ever heard or used?", "targets": ["Hey, I think I just saw a shooting star. Do you want to make a wish?", "Is your name Google? Because you have everything I'm searching for.", "Are you a campfire? 'Cause you are hot and I want to be near you", "Was you father an alien? Because there's nothing else like you in this world", "Are you a 90 degree angle? Because you"]}
{"anchor": "What stresses me out?", "targets": ["Financial pressure", "Inability to meet deadlines", "Stressful relationships", "Unfulfilled responsibilities", "Feeling constantly overwhelmed"]}
{"anchor": "What’s my definition of success?", "targets": ["Achieving your goals", "Making a positive difference in other people’s lives", "Finding joy in life", "Becoming the best version of yourself", "Taking control of your own destiny"]}
{"anchor": "Do I love myself? Why or why not?", "targets": ["Yes, because I have strengths and talents to offer the world", "Yes, because I am always working to better myself", "Yes, because I accept my flaws and imperfections", "Yes, because I'm proud of my achievements", "Yes, because I'm resilient and have the courage to face my challenges"]}
{"anchor": "Do I care what others think of me?", "targets": ["No, I'm confident in my own choices", "No, I make decisions that I'm proud of", "No, I'm unique and beholden to nobody", "No, I take criticism and learn from it", "No, I strive to be the best version of myself"]}
{"anchor": "What’s my biggest fear?", "targets": ["Heights", "Being alone", "Public speaking", "Reptiles", "Snakes"]}
{"anchor": "Do I have any regrets?", "targets": ["No, I'm happy with the decisions I've made", "I regret not spending more time with my family", "I regret not taking more risks", "I regret not following my dreams", "I regret not being more confident in myself"]}
{"anchor": "How do I feel about money and wealth?", "targets": ["I find it necessary for survival, but its importance should not be overestimated", "Money is important to achieve certain goals, but it's not everything", "Money is a necessity and should be used to build a more fair and equitable world", "Wealth should never be a determining factor to treat people differently", "It's important to find balance between earning money and pursuing meaningful activities"]}
{"anchor": "Would someone else give a person a second chance after he/she has made some bad decisions?", "targets": ["Yes, depending on how bad the decision was", "Yes, if they are willing to learn from their mistakes", "Yes, depending on how much they have changed", "Yes, depending on what their intentions are", "Yes, but only if they can prove themselves trustworthy"]}
{"anchor": "Why are some things better than others?", "targets": ["Better quality materials", "More advanced technology", "More specialized skill sets", "More resources", "More attention to detail"]}
{"anchor": "Is there an objective definition of beauty, or is beauty relative depending on who’s viewing it?", "targets": ["I think beauty is subjective and relative depending on who's viewing it", "In my opinion, beauty is open to interpretation", "I think beauty is subjective for each individual", "I think beauty is determined by the individual's culture and social norms", "I believe beauty is a matter of personal preference"]}
{"anchor": "Is there an objective definition of intelligence, or is intelligence relative depending on who’s observing it?", "targets": ["Intelligence is relative and dependent on the observer's prior knowledge and experiences.", "Intelligence is an abstract concept, so various interpretations can be made depending on the context.", "Intelligence is contextual and can be subjectively defined in different ways by different people.", "Intelligence is multifaceted, so it means different things to different people depending on their context and values.", "Intelligence is subjective and interpreted differently by different"]}
{"anchor": "Does time heal all wounds—or just some of them?", "targets": ["Just some of them", "No, time can't heal all wounds", "Healing takes more than just time", "Time can provide new perspectives", "Time may offer guidance but not a cure"]}
{"anchor": "Does everyone deserve a second chance—or none at all?", "targets": ["Everyone deserves a second chance", "If the person genuinely regrets what they did, they deserve a second chance", "Second chances should be given on a case-by-case basis", "Everyone should receive a fair opportunity to prove themselves", "If a person has shown genuine remorse, they deserve a second chance"]}
{"anchor": "Are free-will choices always moral choices—and can right versus wrong even exist without free will choice involved somewhere along the line?", "targets": ["Yes, free-will choices are always moral choices", "No, because choices can be swayed by outside sources or events", "Yes, because moral choices require people to think critically about the consequences of their decisions", "No, because morality is a subjective concept", "Yes, because without free will choices, people would be unable to make their own decisions or seek justice for themselves."]}
{"anchor": "How much will I regret not trying hard enough after failing?", "targets": ["A lot, because it will be a missed opportunity", "You might regret not trying your best and what could have been", "With enough effort, you wouldn't have to regret anything", "It is important to learn from your mistakes and try harder", "You will feel disappointed at the way things worked out, but the experience will still be valuable"]}
{"anchor": "How many kids do you think you’ll have?", "targets": ["One", "Two", "Three", "Four", "None"]}
{"anchor": "What’s your dream house like?", "targets": ["Modern Glass Mansion", "Beach Bungalow", "Rustic Farmhouse", "European Castle", "Tropical Treehouse"]}
{"anchor": "What was the best birthday party you’ve ever had? The worst?", "targets": ["Best: Sleepover at my friend’s house. Worst: Being sick on my birthday", "Best: Paint-balling. Worst: No one showed up due to bad weather", "Best: Visiting the zoo. Worst: Getting into a surprise argument", "Best: Laser tag adventure. Worst: Missing my friends because of a scheduling conflict", "Best: An outdoor BBQ. Worst: A surprise"]}
{"anchor": "If a movie were made of your life, which actor/actress would play you?", "targets": ["Jennifer Lawrence", "Emma Stone", "Brad Pitt", "Ryan Reynolds", "Margot Robbie"]}
{"anchor": "What were your past relationships like?", "targets": ["Short-lived", "Long-term", "Painful", "Confusing", "Rewarding"]}
{"anchor": "Would you kiss me good night every night if I asked you to?", "targets": ["Yes, of course", "Absolutely", "Sure, why not", "Absolutely, I'd be delighted", "Most definitely, with pleasure"]}
{"anchor": "What do you find most attractive in a person of the opposite sex?", "targets": ["A sense of humor", "Kindness", "Intelligence", "Generosity", "Have a positive outlook on life"]}
{"anchor": "If we get married some day, where would you want to take me on a honeymoon?", "targets": ["Maldives", "French Polynesia", "Galapagos Islands", "Bora Bora", "Iceland"]}
{"anchor": "When I look back years from now, will I see progress or regret?", "targets": ["Progress", "Accomplishments", "Triumphs", "Memories & Experiences", "Growth & Understanding"]}
{"anchor": "Was there something that happened recently that made me feel truly joyful—or not so much?", "targets": ["Yes, going on a family vacation made me feel joyful", "Yes, accomplishing a difficult task felt good", "No, failing a test made me feel discouraged", "Yes, receiving an award for my work felt amazing", "No, being turned down for a job opportunity was very disappointing"]}
{"anchor": "Did someone just take time out of their day to say hi & smile at me—and did I smile back, making their day better too?", "targets": ["Yes, and it really made my day", "Yes, and it made me feel great", "Yes, it was the best feeling ever", "Yes, it felt so nice to make someone happy", "Yes, and it was such a special feeling"]}
{"anchor": "Why isn’t there enough time in a day to accomplish everything we need and want to do?", "targets": ["Because modern life is very busy and demanding", "Because our to-do lists are often extensive and time-consuming", "Because we underestimate how long certain tasks will take", "Because of distractions and procrastination", "Because we often bite off more than we can chew"]}
{"anchor": "What can money buy?", "targets": ["Security", "Freedom", "Comfort", "Luxury", "Experiences"]}
{"anchor": "If I lost everything tomorrow, who would miss me and care about me not being around anymore?", "targets": ["My family", "My friends", "My colleagues", "My mentors", "My church/place of worship"]}
{"anchor": "Is money more valuable than peace of mind?", "targets": ["No, money can't buy happiness", "No, peace of mind is priceless", "Neither is more valuable", "Money can't buy peace of mind", "Money can buy a temporary sense of peace but it can't buy real peace of mind"]}
{"anchor": "Why can’t everyone just get along with each other peacefully without arguing over petty things that don’t matter very much anyway?", "targets": ["People are too prideful and selfish to put aside their differences", "Conflict has been a part of human history for centuries", "People can be scared or unwilling to change their beliefs", "Fear and misunderstanding can create divides between people", "We often don’t understand the perspectives of those who are different from us"]}
{"anchor": "Does happiness require struggle first before true joy reveals itself finally at the end as a reward for persisting through a few hurdles first?", "targets": ["Yes, happiness requires struggle because meaningful joy is heightened when we realize how far we’ve come in spite of our hardships", "Absolutely, going through difficult experiences can make any person appreciate the good times more", "It's true, without struggle, happiness can be shallow and fleeting", "Definitely, finding joy in difficult times is a source of great satisfaction", "Yes, joy after overcoming challenges is infinitely more rewarding"]}
{"anchor": "Is revenge a dish best served cold, or should it always be immediate because justice must never wait?", "targets": ["Revenge should always be immediate as justice must never wait", "Revenge should always be served cold to achieve maximum satisfaction", "Revenge should always be balanced with mercy and understanding", "Revenge should not be taken into one's own hands, but left to authorities for resolution", "Revenge should always be carried out with thought and precise timing"]}
{"anchor": "What defines heroism anyway—bravery under fire? Compassion for those who are suffering? Commitment to a cause larger than oneself even when faced with overwhelming odds against success?", "targets": ["Bravery under fire", "Compassion for those who are suffering", "Unconquerable spirit", "Passion for justice", "Altruism and self-sacrifice"]}
{"anchor": "Why are some things so hard to let go of?", "targets": ["Because the memories are too strong", "Because of the emotional attachment", "Because it serves as a reminder of our past", "Because it has sentimental value", "Because it could be a symbol of a better future"]}
{"anchor": "Is there more than one chance for me?", "targets": ["Yes, there is always a chance to try again", "Yes, a new opportunity may present itself", "Yes, life isn't always a straight line", "Yes, when one door closes another opens", "Yes, never give up and you can achieve anything"]}
{"anchor": "Does it matter who did what and who was wrong and who was right?", "targets": ["Yes, it matters because it can affect the outcome of a situation", "No, what is important is understanding why it happened and how to move forward", "Yes, it matters because understanding the different perspectives can lead to growth", "No, what matters is understanding the consequences of the outcome and learning", "Yes, it matters because it can allow us to identify what worked and what didn't"]}
{"anchor": "Is there any real truth anywhere about anything relevant to our lives today and tomorrow?", "targets": ["Yes, the truth is constantly in flux and is relative to our situations", "There is an underlying concrete truth that we can strive to uncover", "Knowledge and research can be used to uncover truth", "We can find truth in our own personal experiences", "We can find truth through shared experiences and conversations with others"]}
{"anchor": "Do I always have a backup plan, because Murphy’s Law might apply?", "targets": ["Absolutely, I like to have a few contingency plans in place", "Yes, I'm always prepared in case things don't go to plan", "Yes, failure is not an option so I make sure to have a 'Plan B'", "Yes, I plan for things to go wrong so I'm prepared for any eventuality", "Yes, I have multiple strategies to be prepared for any contingency"]}
{"anchor": "What song do you play most often?", "targets": ["The Whole of the Moon", "Don't Stop Believing", "Time Of Your Life", "Let It Be", "Hotel California"]}
{"anchor": "What is the one movie that makes you cry every time you watch it?", "targets": ["Titanic", "A Walk to Remember", "Wonder", "Up", "The Green Mile"]}
{"anchor": "If you could be someone else for just one day, who would it be and why?", "targets": ["Captain of a pirate ship – to experience the thrill of adventure", "A medical doctor – to save lives", "A zoologist – to be in close contact with animals", "An astronaut – to explore the depths of space", "A politician – to enact change that may improve lives"]}
{"anchor": "What is the one thing that can always put you in a good mood?", "targets": ["Music", "A good movie", "Exercise", "Spending time with friends", "A funny book or comic"]}
{"anchor": "What is your greatest fear?", "targets": ["Losing my loved ones", "Failure", "The unknown", "Public speaking", "Heights"]}
{"anchor": "If you could change one thing about yourself, what would it be and why?", "targets": ["I'd be more confident", "I'd be more organized", "I'd manage my time better", "I'd be less anxious", "I'd be more outgoing"]}
{"anchor": "Which celebrity do you have a crush on?", "targets": ["Kylie Jenner", "Angelina Jolie", "Rihanna", "Brad Pitt", "Dwayne Johnson"]}
{"anchor": "Have you ever met anyone famous before? Who and what were they like?", "targets": ["Yes, I met Mark Cuban. He was very friendly and approachable.", "Yes, I met Will Smith. He was incredibly kind and outgoing.", "Yes, I met Barack Obama. He was very charismatic and inspiring.", "Yes, I met Oprah Winfrey. She was passionate and dynamic.", "Yes, I met Bill Gates. He was very humble and generous."]}
{"anchor": "Is there a difference between happiness and contentment?", "targets": ["Yes, happiness is a temporary emotion where contentment is more lasting happiness", "Yes, happiness is a reaction to certain events whereas contentment is a deep-rooted feeling of satisfaction", "Yes, happiness is an emotional response to a situation and contentment is emotional fulfillment", "Yes, happiness depends on your external circumstances and contentment depends on your inner peace", "Yes, happiness is an emotional rollercoaster"]}
{"anchor": "Are they mutually exclusive, or can one lead to another?", "targets": ["They can lead to each other; one should foster an environment that allows each to coexist and build upon one another", "Both can exist together and one can inform the other", "They are not mutually exclusive; in order to develop one, one must take into account the other", "One can complement the other; having both is essential", "They can exist simultaneously and communicate to each other to find mutual understanding"]}
{"anchor": "Are we living in a material world, or a spiritual one?", "targets": ["A little bit of both", "It depends on the person", "It depends on the situation", "A combination of the two", "A complex mix of both material and spiritual elements"]}
{"anchor": "Why does war exist?", "targets": ["Ideological differences", "Resource scarcity", "Self-preservation of nations", "Religious divides", "Economic grievances"]}
{"anchor": "Are we our brothers’ keepers?", "targets": ["Yes, we should look out for and help our siblings whenever possible", "Yes, we should strive to support and encourage each other", "Yes, we should be there for our family and friends when they need us", "Yes, we should be one another’s protector", "Yes, we should be compassionate and provide aid to others in need"]}
{"anchor": "What did your childhood bedroom look like?", "targets": ["Brightly colored walls with movie posters", "A cozy and comforting space with a soft bed", "Doodle and crayon drawings on the wall", "Neat and organized with a desk for studying", "An inviting and warm atmosphere with lots of pillows and stuffed animals"]}
{"anchor": "Are you a morning person or night owl? When do you feel most like yourself?", "targets": ["Morning person", "Night owl", "Both", "I feel most like myself in the afternoon", "I feel most like myself in the early evening"]}
{"anchor": "Do you ever have déjà vu?", "targets": ["Yes, sometimes I feel like I have already experienced a situation", "Yes, I get a feeling of familiarity", "Yes, it is like I have already done something before", "Yes, I have a strange sense of knowing", "Yes, it is an eerie feeling"]}
{"anchor": "How often do you people watch?", "targets": ["Everyday", "Whenever I'm out in public", "At events and concerts", "When I'm somewhere new", "Whenever I'm waiting for something"]}
{"anchor": "What do you think about more than anything else?", "targets": ["My future", "My family", "My dreams", "My career", "Making the world a better place"]}
{"anchor": "Do you think crying is a sign of weakness or strength?", "targets": ["Strength", "A sign of emotion and vulnerability", "A sign of resilience", "A valid way of expressing emotion", "A sign of courage and authenticity"]}
{"anchor": "What’s your favorite smell in the entire world?", "targets": ["Freshly baked cookies", "Lavender", "Jasmine", "Spring rain", "Freshly cut grass"]}
{"anchor": "What’s the most random thing you’ve ever watched all the way through on Netflix?", "targets": ["The Pianist", "The Ballad of Buster Scruggs", "The Irishman", "Three Identical Strangers", "The Devil Next Door"]}
{"anchor": "If you could be a character in any movie, who would you choose?", "targets": ["Indiana Jones", "Han Solo", "Tony Stark", "Black Panther", "Ruth Bader Ginsburg"]}
{"anchor": "What’s your favorite drink and snack at Starbucks or Dunkin Donuts?", "targets": ["Chai Tea Latte & Blueberry Muffin from Starbucks", "Caramel Macchiato & Croissant from Starbucks", "Hot Chocolate & Donut from Dunkin Donuts", "Cold Brew Coffee & Bagel from Dunkin Donuts", "Frappuccino & Donut from Starbucks"]}
{"anchor": "What’s the weirdest compliment you’ve ever gotten?", "targets": ["You smell like roses!", "You're so talented in the art of conversation", "You look like a sparkly unicorn", "You have beautiful eyes", "You always know what to say to make me laugh"]}
{"anchor": "What is the nerdiest thing you do in your spare time?", "targets": ["Play video games", "Read books about science and technology", "Collect figurines", "Develop websites", "Watch educational shows about math and science"]}
{"anchor": "If you didn’t have to sleep, what would you do with the extra time?", "targets": ["Learn new skills", "Travel the world", "Spend time with family", "Read more books", "Take up a hobby"]}
{"anchor": "What job would you be terrible at?", "targets": ["CPA", "Chef", "Lawyer", "Auto Mechanic", "Sensory Tester"]}
{"anchor": "When people come to you for help, what do they usually want help with?", "targets": ["Advice", "Making decisions", "Solving problems", "Navigating relationships", "Finding resources"]}
{"anchor": "When it comes down to it, who’s keeping track of any of us anyway?", "targets": ["Ourselves", "Fate", "God", "The Universe", "Our own inner compass"]}
{"anchor": "Who knows whether we’re capable of doing great things—our own behavior doesn’t suggest we are?", "targets": ["We can do great things if we believe in ourselves", "We won't know until we try", "By pushing our limits and challenging ourselves, anything is possible", "A positive mindset can help to make great things happen", "With hard work and perseverance we can achieve anything"]}
{"anchor": "Did World War II truly end world hunger because there isn’t famine anywhere in the world anymore?", "targets": ["No, World War II did not end world hunger.", "The effects of World War II were not strong enough to create a lasting impact on world hunger.", "Despite strides made since World War II, the issue of world hunger still persists.", "Only by a global effort to eradicate poverty and improve nutrition can we put an end to world hunger.", "World War II did not completely end world hunger,"]}
{"anchor": "Does everybody have a secret side of them that nobody knows about—even close friends and family members who claim to know them inside out don’t know their deepest secrets?", "targets": ["Yes", "Absolutely", "Sure", "Definitely", "For sure"]}
{"anchor": "How can we connect more deeply with one another?", "targets": ["Talk through your differences", "Engage in meaningful conversations", "Demonstrate empathy and understanding", "Practice active listening", "Be vulnerable and honest with one another"]}
{"anchor": "Do most things happen for a reason, or are we just plain lucky?", "targets": ["Both, depending on the situation", "Most things happen for a reason", "We're just lucky", "Things happen because of our actions", "Fate plays a role in most things"]}
{"anchor": "Why do some mistakes teach us more than our successes?", "targets": ["Because mistakes help us to understand our limitations and learn how to better ourselves", "Because mistakes provide us with feedback on what we should do differently next time", "Because mistakes help us to develop problem solving skills and think outside of the box", "Because mistakes help us to recognize and learn from our mistakes", "Because mistakes often challenge our beliefs and open our minds to new ideas"]}
{"anchor": "How much control do we have over our destinies?", "targets": ["A lot", "Depends on our actions", "Depends on our attitudes", "Not very much", "All of the above"]}
{"anchor": "Are we here because we want to be here…or were we made to be here without wanting it ourselves first?", "targets": ["We are here because we choose to be here", "We were made to be here, but now we choose to stay", "We were made to be here, but we want to be here too", "We wanted to be here before we were even made", "We were made to be here, and now we choose to remain"]}
{"anchor": "Does seeing something bad happen mean that bad things are bound to happen again even if someone tries hard not to let them happen again?", "targets": ["Not necessarily", "No, it doesn’t", "It depends on the situation", "It can be avoided through self-reflection and understanding", "No, with dedication, something bad can be prevented from happening again"]}
{"anchor": "Are there eternal consequences attached to actions committed during our time here on earth?", "targets": ["Yes, our legacies can live on after our passing", "Yes, karma will ensure we reap what we sow", "Yes, the effects of our actions can be felt long after we are gone", "Yes, our actions can shape the future of generations to come", "Yes, our good deeds can leave a lasting impact"]}
{"anchor": "What is the meaning of life?", "targets": ["To find joy and fulfillment", "To make a positive impact on the world", "To seek knowledge and understanding", "To appreciate the present moment", "To live life to the fullest"]}
{"anchor": "What is the best way to be happy?", "targets": ["Spend time with family and friends", "Pursue your passions and dream", "Laugh often and spread smiles", "Volunteer or give back to the community", "Be kind and show appreciation"]}
{"anchor": "How can I be more grateful?", "targets": ["Express appreciation for what you have", "Recognize the good in others and offer compliments", "Spend time in nature and be mindful of your blessings", "Take time each day to write down a few things you’re thankful for", "Be present in the moment and savor every experience."]}
{"anchor": "What is the true purpose of life?", "targets": ["To be kind", "To discover oneself", "To grow and learn", "To create meaning", "To live life to the fullest"]}
{"anchor": "How can I best help others?", "targets": ["Listen to those in need", "Give emotional support", "Offer practical help", "Volunteer and donate", "Educate those around me"]}
{"anchor": "How do you feel about men/women who don’t make the first move?", "targets": ["Understanding and patient", "Respectful and open-minded", "Appreciative and supportive", "Encouraging and empowering", "Admirable and brave"]}
{"anchor": "What does it mean to be loved by you?", "targets": ["To be embraced and accepted", "To be heard and understood", "To be treated with kindness and respect", "To be loved unconditionally", "To be given the space to grow and learn"]}
{"anchor": "What do you like best about me?", "targets": ["Your positive attitude", "Your sense of humor", "Your kindness", "Your passion for life", "Your intelligence"]}
{"anchor": "What is the most interesting job you have ever had?", "targets": ["Programming", "Designing", "Animating", "Writing", "Filmmaking"]}
{"anchor": "What was your favorite toy growing up?", "targets": ["Lego", "GI Joe", "Barbie", "Hot Wheels", "Playstation"]}
{"anchor": "What is one thing that would make you feel more appreciated?", "targets": ["A thank-you card", "A meaningful gift", "More time for myself", "Quality time with friends", "A surprise trip or vacation"]}
{"anchor": "Do we truly understand one another?", "targets": ["Not always, but we can certainly try", "We must strive to listen and comprehend one another", "We might not understand each other, but we can attempt to empathize", "If we are open to differing perspectives, we stand a better chance of understanding", "Compassion, patience and understanding are essential for meaningful communication"]}
{"anchor": "Are we who we thought we were going to be ten years ago?", "targets": ["No, I'm much better", "No, I'm different in many ways", "No, I've learned and grown since then", "Yes, I'm doing what I set out to do", "Yes, and I'm better for it"]}
{"anchor": "Is freedom freedom from something as well as freedom to do something?", "targets": ["Yes, it is freedom to make choices and freedom from oppression", "Yes, it is freedom to express oneself and freedom from fear", "Yes, it is freedom to be independent and freedom from constraints", "Yes, it is freedom to think critically and freedom from tyranny", "Yes, it is freedom to pursue desired goals and freedom from governmental control"]}
{"anchor": "Do we need a lot of things to lead a meaningful life, or can we live a meaningful life with fewer material possessions?", "targets": ["We can definitely lead a meaningful life with fewer material possessions", "Life does not necessarily have to revolve around material possessions to lead a meaningful life", "Meaningful living is not exclusive to having a lot of material things", "A meaningful life is made possible by embracing non-material values", "Possessions can be useful and can add meaningfulness to our life, but it is not the only way to have a"]}
{"anchor": "What’s more powerful: love or money?", "targets": ["Love", "Love and Money", "It Depends", "Money", "Neither, Respect Is"]}
{"anchor": "What do you love?", "targets": ["Spending time with my family and friends", "Learning new things", "Exploring new places", "Doing creative projects", "Finding creative solutions"]}
{"anchor": "How do you feel when someone insults or criticizes you?", "targets": ["Upset", "Angry", "Defensive", "Confused", "Hurt"]}
{"anchor": "What is the thing that annoys you most about yourself?", "targets": ["Procrastination", "Impatience", "Perfectionism", "Impulsiveness", "Overthinking"]}
{"anchor": "What is your favorite type of art to create?", "targets": ["Drawing", "Painting", "Sculpting", "Digital Art", "Photography"]}
{"anchor": "If you had the chance to have a conversation with any person in human history, who would it be? Why them?", "targets": ["Leonardo da Vinci", "Mahatma Gandhi", "Martin Luther King Jr.", "Albert Einstein", "Nelson Mandela"]}
{"anchor": "Where do you see yourself in five years time? In ten years time? In twenty years time?", "targets": ["In five years I will be traveling the world", "In ten years I will be working in a meaningful career", "In twenty years I will be living near family", "In five years I will have my own business", "In ten years I will have retired"]}
{"anchor": "How can I make your day better/easier/more comfortable for you?", "targets": ["Give me a hug", "Make me a cup of tea", "Bring me my favorite dessert", "Take me on an adventure", "Write me a heartfelt letter"]}
{"anchor": "If money were no object, what would be your dream job or career path and why?", "targets": ["Marine Biologist, to explore and protect the beautiful undersea life", "Astronaut, to explore the vast universe", "Wildlife Photographer, to capture the beauty of nature", "Artist, to create meaningful and unique works of art", "Architect, to design cities and structures that will make a difference."]}
{"anchor": "Does death frighten anyone else, or is it just something we’ve grown used to?", "targets": ["No, it still frightens me", "Yes, but I try not to think about it", "It's something we must accept", "It's a part of life", "I'm scared of the unknown"]}
{"anchor": "Why do we cry during sad movies but can still enjoy them anyway?", "targets": ["We can empathize with the characters and feel connected to them", "We may be able to relate to the story and find comfort in it", "Crying can be cathartic and help us process our emotions", "Films can help us view emotions and experiences in a new way", "We may find closure or comfort in the resolution of the movie's plot"]}
{"anchor": "Does anybody truly know what happens after death?", "targets": ["No", "Only those that have experienced it", "Maybe", "We can only speculate", "It's unknown"]}
{"anchor": "When did it all start?", "targets": ["March 2020", "When the pandemic hit", "At the start of lockdown", "When restrictions were put into place", "When people started to stay home"]}
{"anchor": "If everybody’s unique, who decides who’s normal and who isn’t ?", "targets": ["There is no single person who decides", "Society as a whole decides", "Its subjective and subjective to each individual", "People should be free to be whatever they choose", "Nothing should decide who is 'normal' or not"]}
{"anchor": "Who is the person that influenced me the most throughout my life and why?", "targets": ["My mother", "My grandmother", "My teacher", "My best friend", "My father"]}
{"anchor": "What do I want to be remembered for when I die?", "targets": ["As someone who made a difference", "As someone who was generous and compassionate", "As someone who was always willing to lend a helping hand", "As someone who encouraged others to reach their goals", "As someone who followed their passion and made their mark on the world"]}
{"anchor": "Why do I get up in the morning?", "targets": ["To start a new day with a fresh perspective", "To accomplish meaningful tasks", "To make the most of every opportunity", "To seize the day", "To enjoy life with family and friends"]}
{"anchor": "What are the values I live by?", "targets": ["Integrity", "Kindness", "Honesty", "Gratitude", "Courage"]}
{"anchor": "What makes me feel fulfilled?", "targets": ["Completing challenging tasks", "Overcoming obstacles", "Spending time with loved ones", "Doing meaningful work", "Making a positive impact on people's lives"]}
{"anchor": "What are my three most important goals right now?", "targets": ["Increase financial security", "Improve personal relationships", "Strengthen mental and physical health", "Learn new skills", "Grow professionally"]}
{"anchor": "If I had one year to live, what would I do?", "targets": ["Explore new places", "Connect and reconnect with family and friends", "Take on new challenges", "Make an impact in the world", "Leave behind a legacy"]}
{"anchor": "What do you love most about yourself?", "targets": ["My willingness to help others", "My ability to think outside the box", "My sense of humor", "My resilience", "My passion for life"]}
{"anchor": "Who is your role model, and why?", "targets": ["My father, because he taught me to be independent and responsible", "My mother, for teaching me the value of hard work and dedication", "Albert Einstein, for his resilience and creative pursuits", "Martin Luther King Jr., for his courage and dedication to justice and equality", "Malala Yousafzai, for her determination in speaking for girls education and rights"]}
{"anchor": "What’s the best piece of advice you’ve ever received?", "targets": ["Believe in yourself", "Don't be afraid to take risks", "Follow your passions", "Don't compare yourself to others", "Take each day as it comes"]}
{"anchor": "How do you spend your free time?", "targets": ["Reading", "Exercising", "Going out with friends", "Learning something new", "Exploring new places"]}
{"anchor": "What is the one thing you would like to change about yourself, if you could?", "targets": ["My anxiety", "My impulsiveness", "My confidence level", "My communication skills", "My time management skills"]}
{"anchor": "Which living person do you most admire?", "targets": ["Malala Yousafzai", "Barack Obama", "Stephen Hawking", "Dalai Lama", "Tim Cook"]}
{"anchor": "What’s one thing that really annoys you about people in general?", "targets": ["Not listening", "Not thinking things through", "Ignoring good advice", "Not appreciating art", "Being too judgmental"]}
{"anchor": "Describe your perfect date?", "targets": ["A picnic in a park overlooking a lake", "A relaxing evening spent stargazing", "A cozy dinner for two at a quaint restaurant", "A stroll through a botanical garden", "A day trip to the beach"]}
{"anchor": "What is the one thing that brings a smile to your face, no matter the time of day?", "targets": ["Listening to music", "Spending time outdoors", "Watching a comedy movie", "Chatting with friends", "Eating my favorite food"]}
{"anchor": "What makes you laugh?", "targets": ["Silly jokes", "Ridiculous stories", "Puns", "Dry humor", "Physical comedy"]}
{"anchor": "What is one memory you have from childhood?", "targets": ["Going fishing with my grandpa", "Watching fireworks for the first time", "Saving my allowance to go to the movies", "Learning to swim at the lake", "Taking my first dog for a walk"]}
{"anchor": "If you had to lose one of your five senses, which would you give up and why?", "targets": ["Taste, because it’s the least essential sense", "Smell, because it’s the least useful in critical decision making", "Sight, because I could still use the other senses to navigate my environment", "Touch, because I wouldn’t have to worry about physical pain", "Hearing, because I wouldn’t miss certain audible nuances as much as other senses."]}
{"anchor": "If tomorrow was your last day on earth, what would you do in your last 24 hours?", "targets": ["Spend the day with family and friends", "Go on a road trip", "Take a day to explore my hobbies", "Reconnect with an old friend", "Go sky-diving"]}
{"anchor": "If you could a full 24 hours without any work or obligations, a day to just do whatever you wanted, what would you do?", "targets": ["Go hiking in nature", "Relax at home and catch up on my favorite shows", "Play some sports with friends", "Take an art class", "Explore a new city"]}
{"anchor": "Should we fear not knowing something, or should we fear knowing too much about something?", "targets": ["We should not fear not knowing something", "We should fear knowing too much about something", "We should embrace not knowing something for the opportunity to grow", "We should carefully weigh the potential benefit and harm of knowing more", "We should strive for knowledge but be aware of the limitations of our own understanding"]}
{"anchor": "Does coming home truly take me back to where I started?", "targets": ["No, it can be a place for growth and new beginnings", "Yes, it can be a starting point for understanding", "Yes, it can be a reminder of the choices we have made", "No, it can be a new space for transformation", "Yes, it can be a safe haven from difficult experiences"]}
{"anchor": "Would knowing everything about our future cause us more pain than happiness?", "targets": ["It would depend on the content of what is known", "Yes, because it might make it hard to appreciate the moment", "No, because it would help us avoid making mistakes", "Yes, because it would instill a feeling of hopelessness", "No, because it would give us the opportunity to plan ahead"]}
{"anchor": "When does saying no actually help me accomplish more things instead of distracting me from finishing even a single task?", "targets": ["When I find myself getting overwhelmed by the number of tasks I need to do", "When the task I am considering is not within my skill set or abilities", "When I feel like a task is taking me away from my original goals", "When I don't feel strongly about the task being presented", "When I think taking on the task will lead to burnout"]}
{"anchor": "Would we treat each other better if we realized we were living our last day on earth right now?", "targets": ["Yes, we would be more open-minded and understanding", "Yes, people would be more willing to forgive and forget", "Yes, we'd value compassion and kindness more", "Yes, we'd prioritize relationships above all else", "Yes, we'd take more time to appreciate what we have"]}
{"anchor": "Where will we go next?", "targets": ["The beach", "The mountains", "An amusement park", "A foreign country", "A theme park"]}
{"anchor": "Where should we go next?", "targets": ["The Grand Canyon", "Machu Picchu", "The Great Barrier Reef", "Galapagos Islands", "Yellowstone National Park"]}
{"anchor": "Where will we live next year, and where will we live ten years from now?", "targets": ["England next year, Canada ten years from now", "USA next year, Mexico ten years from now", "Germany next year, Australia ten years from now", "Japan next year, South Africa ten years from now", "France next year, Brazil ten years from now"]}
{"anchor": "Why is it easier to talk about death than to talk about sex?", "targets": ["Because taboo topics such as sex can be seen as socially awkward", "Because there is still a stigma attached to discussing sex openly", "Because culture and religion play a role in how sex is viewed", "Because death is seen as a more natural part of life", "Because death is a more universal experience that everyone can relate to"]}
{"anchor": "Would I rather die by fire or by drowning?", "targets": ["Fire", "Drowning", "Neither", "I'd choose to live", "Depends on the situation"]}
{"anchor": "What is something you did that you regret?", "targets": ["Not forgiving someone", "Being too hard on myself", "Not taking a chance", "Not staying true to my values", "Not taking enough time to appreciate the little things"]}
{"anchor": "Have you ever done something out of the ordinary that made you proud of yourself?", "targets": ["Yes, I have completed a marathon", "Yes, I have travelled alone to a foreign country", "Yes, I have graduated from school with honors", "Yes, I have climbed a mountain without any equipment", "Yes, I have learned a new language in one month"]}
{"anchor": "What’s the weirdest thing about you?", "targets": ["I never sleep", "I talk to myself", "I laugh out loud at my own jokes", "I'm obsessed with eating raw onions", "I like to wear clothes inside out"]}
{"anchor": "What’s the first thing that comes to your mind when I say__________?", "targets": ["Candy", "Music", "Escape", "Adventure", "Sleep"]}
{"anchor": "Do you think humans are inherently bad or good?", "targets": ["Neutral", "Both", "Contextual", "Situational", "Depends on the individual"]}
{"anchor": "What do you wish your brain was better at doing?", "targets": ["Remembering information easily", "Solving problems quickly", "Focusing longer", "Learning new skills quickly", "Executing tasks efficiently"]}
{"anchor": "What is the very first thing you notice about a girl?", "targets": ["her eyes", "her smile", "her personality", "her hair", "her sense of style"]}
{"anchor": "What does a typical day in the life of your partner look like?", "targets": ["Wake up early and exercise", "Get ready for work, head to the office", "Come home, relax, and spend time with family", "Maintain hobbies like painting or playing sports", "Spend time with friends and meet up with old acquaintances"]}
{"anchor": "Which movie would you like to live in?", "targets": ["The Lord of the Rings", "Harry Potter", "Star Wars", "The Matrix", "Avatar"]}
{"anchor": "If you could have lunch with anyone from history, who would it be and why?", "targets": ["Leonardo da Vinci, because he was a brilliant inventor and artist", "Albert Einstein, because of his intellect and thought-provoking ideas", "Mahatma Gandhi, because of his pursuits of humanity and peace", "Martin Luther King Jr., because of his dedication to civil rights", "Nelson Mandela, because of his fight against apartheid and injustice."]}
{"anchor": "If you were given $10,000 to spend in one day, what would you do with it?", "targets": ["Put a down payment on a house", "Buy a car", "Invest in stocks", "Go on a luxurious vacation", "Pay off debt"]}
{"anchor": "What’s your favorite joke?", "targets": ["Why don’t scientists trust atoms? Because they make up everything.", "What do you call a rooster that wakes you up at the wrong time? An alarm cluck.", "What did the fish say when it swam into the wall? Dam.", "How do you make a tissue dance? You put a little boogie in it.", "Why don't trees like to do math"]}
{"anchor": "Where is your favorite place to be kissed?", "targets": ["On the forehead", "On the cheeks", "On the neck", "On the lips", "On the hands"]}
{"anchor": "How did your last relationship end?", "targets": ["We decided to remain friends", "We had grown apart and decided to move on", "We had an argument and stopped talking", "They didn't feel the same way I did", "We realized that our values were different"]}
{"anchor": "Do you think relationships are made or they just happen?", "targets": ["They are made through effort and dedication", "They are built on trust and communication", "It depends on both people involved", "It requires hard work and time to cultivate", "It takes effort from both sides to make it a successful relationship"]}
{"anchor": "What do you think are the three biggest issues in a relationship?", "targets": ["Communication", "Trust", "Respect", "Honesty", "Compromise"]}
{"anchor": "What is your favorite thing about me?", "targets": ["Your sense of humor", "Your compassionate nature", "Your intelligence", "Your passion for life", "Your generous spirit"]}
{"anchor": "Do you have any regrets in life?", "targets": ["Not studying harder", "Not exploring more when I was younger", "Not taking more risks", "Not spending more time with my loved ones", "Not taking advantage of more opportunities"]}
{"anchor": "What makes you smile the most?", "targets": ["Animals", "Music", "Traveling", "Days off work", "Hanging out with friends"]}
{"anchor": "How do you think friends see you?", "targets": ["As a kind, supportive person", "As someone with a great sense of humor", "As a person with a lot of knowledge", "As an inspiring individual", "As a trustworthy and loyal friend"]}
{"anchor": "What do you like most about your job?", "targets": ["The flexible hours", "The creative freedom", "The camaraderie among colleagues", "The opportunities to learn and grow", "The amazing work culture"]}
{"anchor": "What is your idea of perfect happiness?", "targets": ["Spending time with loved ones", "Being surrounded by nature", "Traveling the world", "Completing a challenging project", "Enjoying a good meal with friends"]}
{"anchor": "What are the most important things in life to you?", "targets": ["Family", "Relationships", "Success", "Health", "Happiness"]}
{"anchor": "Why aren’t we better than we are?", "targets": ["We don't have access to the same resources", "We're too focused on our differences", "We haven't invested enough in education", "We lack creativity in finding solutions", "We don't take enough risks"]}
{"anchor": "Is everyone unique and special like me?", "targets": ["Yes, everyone is unique in their own way", "Yes, everyone is special and brings something unique to the table", "No, everyone is not unique or special, but each person has something special to offer", "Yes, everyone has something that makes them special and unique in their own way", "Yes, everyone is special and has something valuable to contribute to the world"]}
{"anchor": "Why can’t we just be nice to each other without judgment or prejudice?", "targets": ["We haven't been taught how", "We are too wrapped up in our own lives", "We can't understand the diversity of opinions and experiences", "We haven't developed enough empathy", "Society rewards us for being judgemental and prejudiced"]}
{"anchor": "Do I pretend not to see things I know are wrong?", "targets": ["No, I always do my part to try and help make them right", "Yes, to avoid a potentially awkward situation", "No, I try to speak up against injustice", "Yes, I'd rather not get involved in something that is none of my business", "No, I would rather acknowledge it and speak out against it."]}
{"anchor": "Who are some real-life superheroes that have inspired others with their acts of kindness and heroism?", "targets": ["Stephen Hawking", "Malala Yousafzai", "Mahatma Gandhi", "Oprah Winfrey", "Nelson Mandela"]}
{"anchor": "Why do we worry about things we can’t control?", "targets": ["Fear of the unknown", "Lack of trust in ourselves and others", "Fear of failure", "Need to be in control", "Need for security and stability"]}
{"anchor": "What is the most important thing that guys should understand about the girl, and it seems to you that they do not understand?", "targets": ["That every girl is unique", "That their needs are just as important as the guys'", "That communication is key", "That respect is paramount", "That judgement should not be made without getting to know someone first"]}
{"anchor": "What is your favorite memory with me?", "targets": ["Camping in the woods", "Cooking dinner together", "Going to a concert together", "Taking a road trip", "Sitting around a campfire together"]}
{"anchor": "How do you feel about us right now?", "targets": ["Optimistic", "Excited", "Ready to tackle any challenge", "Confident", "Grateful"]}
{"anchor": "What is your biggest regret in life so far?", "targets": ["Not taking more risks", "Waiting too long to pursue my dreams", "Not appreciating those around me", "Wasting time on things that don't matter", "Not saying “I love you” enough"]}
{"anchor": "What would you be doing in life if money wasn’t an issue?", "targets": ["Making social impact projects", "Travelling and exploring the world", "Helping and supporting charities", "Humanitarian aid", "Supporting the vulnerable and marginalized"]}
{"anchor": "What are some things about our relationship that made you really happy at first? Then what changed that?", "targets": ["Having each other to lean on when we had a bad day", "Doing new and exciting things together", "Exploring each other's interests", "Taking trips together", "Understanding each other's differences"]}
{"anchor": "Would I rather live in a place where technology was behind, such as medieval times, or ahead with high-tech gadgets but not enough food and no clean water?", "targets": ["Ahead with high-tech gadgets", "I would prefer medieval times", "I would rather not choose either", "I would prefer both in moderation", "I would prefer a balance between the two"]}
{"anchor": "Which came first: thought or action?", "targets": ["Thought", "Action", "It depends", "Thought, followed by Action", "Action, followed by Thought"]}
{"anchor": "Does anger hurt more than love feels good?", "targets": ["No, anger and love have different effects", "No, love and anger are two sides of the same coin", "It depends on the situation", "Yes, anger has deeper lasting effects", "Yes, love has greater restorative powers"]}
{"anchor": "When will we have a cure for stupidity?", "targets": ["Never", "When the world collectively decides to focus on the problem", "By educating people and instilling knowledge", "Through complex brain research", "With advances in artificial intelligence and machine learning"]}
{"anchor": "Is it true that anyone can be president?", "targets": ["Yes, if they meet the requirements laid out by the Constitution", "Yes, provided they receive enough votes in an election", "Yes, if they are an eligible voter", "Yes, because the US is a democracy", "Yes, as long as they can complete an oath of office"]}
{"anchor": "Why do we always seem to expect more from others than we expect from ourselves?", "targets": ["We judge ourselves less harshly and are more forgiving of our own mistakes", "We are too hard on others and they don't meet our unrealistic expectations", "We don't think our efforts warrant sufficient recognition", "We require more of others to maintain our standards", "We feel that others should be capable of more because of our own abilities and successes"]}
{"anchor": "How much can one person achieve before going insane?", "targets": ["A lifetime of accomplishments", "Miracles, even", "More than they ever thought imaginable", "Impossible feats", "Completely turning their world around"]}
{"anchor": "Does everyone have a dark side…or a light side…or both?", "targets": ["Both", "It depends on the person", "Everyone has aspects of both", "It's a matter of choice", "Everyone has their own unique blend"]}
{"anchor": "Is everyone’s pain relative?", "targets": ["Yes", "No", "It depends on the person", "Pain is subjective", "Pain is not absolute, so it is relative to each person"]}
{"anchor": "Why can’t we turn back time?", "targets": ["Because it would violate the laws of physics", "Because it would disrupt the natural flow of cause and effect", "Because it would be unpredictable and chaotic", "Because it would require too much energy", "Because it doesn’t exist in our reality"]}
{"anchor": "Who decides our destiny, and why is our future not something we have any control over?", "targets": ["Our choices and actions determine our destiny and ultimately shape our future", "Fate plays a major role in deciding our destiny and future by guiding our paths", "Our decisions and circumstances directly affect what our destiny will be and how our future will turn out", "Our destiny is the result of our choices, attitudes, and efforts which ultimately affect our future", "External forces and internal decisions intersect to determine our destiny and determine our"]}
{"anchor": "Are we going to run out of time before we run out of problems?", "targets": ["Probably", "Yes", "No", "Not if we act quickly", "It depends on what we choose to do"]}
{"anchor": "Why doesn’t anybody seem to understand what I’m trying to say?", "targets": ["My words may be unclear", "My communication style may be too direct", "My context may be missing", "My point of view may be different", "I may be talking too fast"]}
{"anchor": "How will things ever work out if no one changes their ways of thinking and doing things…or at least tries something new?", "targets": ["Start small – challenge yourself to try something new every day", "Start a conversation with someone new and make connections", "Take a class to learn about different perspectives", "Get creative with problem-solving and solutions", "Open your mind and have an open dialogue with those who think differently"]}
{"anchor": "Is our past a part of us or just a stepping stone toward something better?", "targets": ["Part of us", "Stepping Stone", "Both", "A lesson to be learned", "Opportunity for Growth"]}
{"anchor": "Why are some things easier said than done while others are harder to say than done but come out naturally without any effort involved whatsoever?", "targets": ["Some things are easier to think of or assume without having to put any effort into it", "It's easier to say the right thing when it's something you understand or have experienced", "It's harder to say something that you don't understand or have not experienced", "It's easier to think of something than to actually physically act upon it", "It's easier to come up with a solution to a problem that"]}
{"anchor": "What have I learned about being a friend?", "targets": ["Compromise", "Loyalty", "Respect", "Communication", "Honesty"]}
{"anchor": "Should money matter to us as much as we often say it does?", "targets": ["No, money should not determine our values and judgement", "No, money should not be what drives us", "No, money should not limit our potential", "No, money should not rule our decisions", "No, money should not dictate our lives"]}
{"anchor": "In which ways can we better improve our lives by thinking differently?", "targets": ["Broaden our perspectives by viewing things from multiple angles", "Find creative solutions to our problems", "Consider the long-term implications of our actions", "Be mindful of our thoughts, words, and actions", "Follow our passions and take risks to reach our goals"]}
{"anchor": "Why can’t I just let go of things I wish were different?", "targets": ["You may have a fear of missing out on a better outcome.", "You may be afraid of the unknown.", "You may be clinging to the past.", "You may be trying to control an unpredictable situation.", "You may be afraid to move on and make different decisions."]}
{"anchor": "Why don’t our bodies work like computers; when they break, we throw them away and buy a new one instead of trying to fix them?", "targets": ["Our bodies are too complex for us to replace them as easily as a computer", "A new body might not necessarily be equipped with the same skills and aptitudes as the old one", "Replacing a body would also be costly and ethically questionable", "Computers are made of inanimate material; our bodies are alive and thus require a much more delicate approach", "Even if we were able to replace it,"]}
{"anchor": "What’s the point of a bedside table?", "targets": ["To store items needed at night such as a lamp, book, or phone", "To keep items organized and in easy reach", "To add a decorative touch to the bedroom", "To provide extra surface space", "To be used as a makeshift desk for studying or work"]}
{"anchor": "Why do we have to pay taxes?", "targets": ["To fund essential services", "To pay for public infrastructure", "To help the poor and disadvantaged", "To ensure everyone is contributing to society", "To provide stability and security to society"]}
{"anchor": "Is there a difference between a sofa and a couch?", "targets": ["Yes, a sofa usually has more decorative features", "Yes, a sofa often has a different shape", "Yes, a sofa often has more fabric used for upholstery", "Yes, a sofa often has more cushioning", "Yes, a sofa often comes in more colors than a couch"]}
{"anchor": "When will we have flying cars?", "targets": ["Never, the technology doesn’t exist yet", "In the next 10 years, with enough investment", "By 2030, thanks to expertise from experts in the field", "By 2050, with a million dollar research initiative", "Within the next century, once all the technology is perfected"]}
{"anchor": "Can you see the future in your dreams?", "targets": ["Yes", "No", "Sometimes", "Occasionally", "Rarely"]}
{"anchor": "What is love?", "targets": ["A strong bond between two individuals", "A feeling of warmth and affection", "Acting selflessly for the benefit of another", "An emotion that transcends all boundaries", "A force that drives us to make a better world"]}
{"anchor": "How much is too much when it comes to loving a dog?", "targets": ["There is no such thing as too much love for a dog", "Love is always the right amount for a dog", "There’s no limit to how much you can love your dog", "As much love as you can give, your dog can take", "You can never love your dog too much!"]}
{"anchor": "Can dogs be racist?", "targets": ["No, racial biases and prejudice in dogs are likely not possible", "Dog's behavior is more likely based on past experiences than race", "Dogs may display behaviors that could appear as racism, but this is likely based on other factors", "Dogs are unlikely to possess the cognitive ability to develop prejudices towards different races", "Dogs generally form bonds and relationships with people regardless of skin color, race, or ethnicity"]}
{"anchor": "If I bought an island, could I name it anything I wanted to, or would I have to use an approved name?", "targets": ["You could name it anything you wanted to, as long as it wasn't already taken.", "You would have to register a name with the appropriate authorities in order to have it legally recognized.", "You could make up a name, as long as it wasn't trademarked or offensive.", "You would need to research the local regulations to make sure the name you choose is available.", "The name you"]}
{"anchor": "How do you like to be comforted when you get sad?", "targets": ["A hug", "Talking to a close friend", "A thoughtful gift", "Watching a movie", "Taking a walk in nature"]}
{"anchor": "What foods do you despise?", "targets": ["Brussels sprouts", "Mushrooms", "Avocados", "Pickles", "Olives"]}
{"anchor": "What’s the best thing about your family?", "targets": ["The unconditional love and support", "The amazing memories we share", "The willingness to forgive", "The laughter and joy we share", "The constant source of motivation and inspiration"]}
{"anchor": "If you could change anything about the way you were raised, what would it be?", "targets": ["More emotion support", "More flexibility in decisions", "More opportunity to explore different activities", "More focus on values", "More encouragement to try new things"]}
{"anchor": "What was the best phase in your life?", "targets": ["Going to college", "Moving to a new city", "Starting a new job", "Meeting my significant other", "Travelling the world"]}
{"anchor": "How do you believe a relationship between a man and woman should be?", "targets": ["Mutually respectful", "Trusting and transparent", "Honest and loyal", "Supportive and loving", "Financially equal"]}
{"anchor": "What is your definition of love?", "targets": ["Compassionate, selfless commitment", "Unconditional and accepting", "Accepting of the other person's flaws", "Complete trust and understanding", "A choice to love despite differences"]}
{"anchor": "How do you know that you are in love with someone?", "targets": ["When I think only of them and no one else", "When I feel like they are the only one who understands me", "When I want to make them happy and enjoy making them smile", "When I can show all my weaknesses and strengths to them", "When I want them to be a part of my life forever"]}
{"anchor": "How would you like your partner to be?", "targets": ["Loyal", "Kind", "Supportive", "Intelligent", "Caring"]}
{"anchor": "What qualities do you prefer in the opposite sex?", "targets": ["Kind", "Intelligent", "Driven", "Humorous", "Ambitious"]}
{"anchor": "Do you want to get married or not? Why?", "targets": ["Yes, I would like to find someone who I can share my life with.", "No, I value my freedom and solitude.", "Yes, I want to build a life with someone I love and trust.", "Maybe, I'm still unsure if marriage is for me.", "No, I'm happy with my life the way it is."]}
{"anchor": "Would you marry a person whom you don’t really love if he/she is very rich and has all other qualities that you want to have in your ideal life partner? Why do so?", "targets": ["No, I value my happiness and would not sacrifice it for wealth", "No, wealth cannot guarantee happiness", "No, I wouldn't be able to live with myself if I didn't love my partner", "No, money can't buy love", "No, I believe in true love and would not settle for something less"]}
{"anchor": "How many times have you fallen in love?", "targets": ["Once", "Twice", "Three times", "Four times", "Five times"]}
{"anchor": "What did you do on your first date?", "targets": ["Go to a restaurant", "Visit the beach", "Go to a museum", "See a movie", "Go on a long drive"]}
{"anchor": "What’s the most embarrassing thing that’s happened to you in front of your crush?", "targets": ["Tripped over my own feet", "Burped without realizing it", "Spilled a drink on myself", "Got tongue-tied trying to talk to him/her", "Couldn't get my words out correctly"]}
{"anchor": "Have you ever been rejected by someone and if yes, how did it feel?", "targets": ["Yes, and it felt very hurtful", "Yes, and it felt humiliating", "Yes, and it felt embarrassing", "Yes, and it felt like a big loss", "Yes, and it felt like a huge disappointment"]}
{"anchor": "When was your first kiss and how old were you?", "targets": ["17 and it was during a party", "15 and it was on a beach", "16 and it was in the school library", "16 and it was at a school dance", "18 and it was in my bedroom"]}
{"anchor": "When was the last time you told someone “I love you?”", "targets": ["Yesterday", "This Morning", "Last Week", "Last Month", "A Year Ago"]}
{"anchor": "When do you think a person is ready for marriage?", "targets": ["When they can support their future family financially", "When they have a solid understanding of self", "When they know what kind of long-term commitment they're ready for", "When they have explored different life options and have made meaningful connections", "When they are willing to make sacrifices and commit to building a loving and supportive relationship"]}
{"anchor": "If I could live anywhere in the world, where would it be? Why? – I would love to live in New Zealand.", "targets": ["I would love to live in India because of the rich culture and diverse landscapes", "I would love to live in Costa Rica because of its stunning rain forests and beaches", "I would love to live in Japan because of its rich history and culture", "I would love to live in Canada because of its stunning landscapes and opportunity for adventure", "I would love to live in New Zealand because of its incredible landscapes and"]}
{"anchor": "Favorite vacation spot? Why? – Home is my favorite vacation spot because my husband and kids are there.", "targets": ["Hawaii", "New York City", "Paris", "Las Vegas", "London"]}
{"anchor": "What do I like to do in my spare time?", "targets": ["Play video games", "Listen to music", "Hang out with friends", "Read books", "Exercise"]}
{"anchor": "What’s the biggest challenge I’ve faced in my life?", "targets": ["Overcoming self-doubt", "Handling a major failure", "Finding the courage to take risks", "Balancing work and family", "Making the right decisions"]}
{"anchor": "What’s the greatest risk I’ve taken in my life?", "targets": ["Jumping out of a plane", "Moving to a different country", "Leaving my home city to pursue a dream", "Taking a leap of faith", "Starting my own business"]}
{"anchor": "What makes me feel accomplished?", "targets": ["Finishing a project I set out to do", "Learning a new skill", "Helping someone in need", "Getting recognition for a job well done", "Doing something I never thought I could do"]}
{"anchor": "How would my friends describe me?", "targets": ["Funny", "Outgoing", "Kind", "Generous", "Loyal"]}
{"anchor": "How would my co-workers describe me?", "targets": ["Dependable", "Hard-working", "Creative", "Supportive", "Friendly"]}
{"anchor": "Where did dogs come from?", "targets": ["They evolved from wolves", "They originated from Asia", "They are descendants of wild canids", "They are a domesticated species of the Canidae family", "They have been around for at least 10,000 years"]}
{"anchor": "Why do cats like catnip?", "targets": ["To promote relaxation", "To consume for nutrients", "To increase dopamine levels", "To stimulate their senses", "To evoke instinctive behaviours"]}
{"anchor": "What are the most popular dog and cat breeds in the United States?", "targets": ["Dog: Labrador Retriever", "Dog: German Shepherd", "Cat: Persian", "Cat: Siamese", "Cat: Maine Coon"]}
{"anchor": "How do animals communicate?", "targets": ["Through vocalizations", "Through gestures and body language", "Through scent signals", "Through visual signals", "Through touch"]}
{"anchor": "What’s the most endangered animal in the world?", "targets": ["Amur Leopard", "Vaquita", "Sumatran Rhinoceros", "Cross River Gorilla", "Hawksbill Sea Turtle"]}
{"anchor": "How many animals are there on Earth? How many species have gone extinct?", "targets": ["An estimated 8.7 million animal species currently exist on Earth, and 571 species have gone extinct", "8.7 million living species and more than 10,000 species have gone extinct", "5 million species exist, and at least 844 species have gone extinct", "It's estimated that 8.7 million species currently exist on Earth, and thousands of them have gone extinct", "Scientists estimate that 8."]}
{"anchor": "What’s the biggest animal on Earth?", "targets": ["The Blue Whale", "The African Elephant", "The Giraffe", "The Saltwater Crocodile", "The Great White Shark"]}
{"anchor": "Are giraffes really mute, or can they make sounds we just can’t hear?", "targets": ["Yes, they actually make low vocalizations that we can't hear", "No, but they can communicate with different levels of a guttural, muffled-sounding grunt", "No, but they can communicate with moans, buzzed snorts, and even purrs", "Yes, they mainly communicate with their eyes, ears and tail movements", "No, they communicate with an array of loud noises like"]}
{"anchor": "What is the worst thing that a parent can do?", "targets": ["Abuse their child", "Neglect their child", "Abandon their child", "Favor one child over another", "Comparing their child to others"]}
{"anchor": "What accomplishment are you most proud of?", "targets": ["Finishing my Masters Degree", "Starting my own business", "Being the first in my family to go to college", "Raising my two kids", "Being selected for a prestigious fellowship"]}
{"anchor": "What is your favorite place to visit?", "targets": ["The beach", "National parks", "Mountains", "Forests", "Ancient ruins"]}
{"anchor": "What is your favorite time of day/day of the week/month of the year?", "targets": ["Sunday morning", "Saturday afternoon", "Monday morning", "Friday night", "December 25th"]}
{"anchor": "What was your first concert?", "targets": ["Taylor Swift", "Drake", "Justin Bieber", "Britney Spears", "Coldplay"]}
{"anchor": "What is your favorite band/singer/song?", "targets": ["Beatles", "Queen", "Adele", "Ed Sheeran", "Imagine Dragons"]}
{"anchor": "What was the last book you read?", "targets": ["The Hunger Games", "1984", "The Catcher in the Rye", "Anne of Green Gables", "The Great Gatsby"]}
{"anchor": "Who was your role model growing up? Do you still look up to them now?", "targets": ["My mom", "My dad", "My teacher", "My older brother", "My grandpa"]}
{"anchor": "Who do you go to for advice?", "targets": ["My Parents", "My Best Friend", "My Mentor", "My Teacher", "My Doctor"]}
{"anchor": "Would you rather have a surprise party or not?", "targets": ["Yes, I would love a surprise party", "No, I would rather plan my own party", "Yes, but I would prefer to know about it beforehand", "No, I get too anxious in surprise situations", "Yes, as long as it's not too big or over the top"]}
{"anchor": "Do you like surprises? If so, what kind of surprises do you like?", "targets": ["Surprises that involve an adventure", "Unexpected thoughtful gestures", "Surprises that involve fun activities", "Creative surprises", "Surprises that involve learning something new"]}
{"anchor": "Do you like to give presents or receive presents?", "targets": ["Both", "Giving", "Receiving", "Giving more than receiving", "Receiving more than giving"]}
{"anchor": "What would be your ideal gift for a special occasion?", "targets": ["An experience", "A trip", "Something handmade", "A donated charity", "A sentimental item"]}
{"anchor": "What is the best way to start a relationship?", "targets": ["Developing a friendship first", "Having honest and open communication", "Sharing similar interests", "Being honest and direct", "Getting to know each other's personalities"]}
{"anchor": "Would you rather be single and alone or in a relationship with someone who doesn’t really care about you?", "targets": ["Single and alone", "In a relationship with someone who cares", "Single and happy", "In a relationship that is based on mutual respect", "In a relationship with someone who can better me"]}
{"anchor": "What is your perfect date night?", "targets": ["A picnic in the park", "A stroll down the beach", "A night at the movies", "An evening at a museum", "Dinner at a romantic restaurant"]}
{"anchor": "What do you value most in your life?", "targets": ["Relationships with friends and family", "Good health", "Making a positive impact in the world", "Pursuing my passions", "Learning new skills"]}
{"anchor": "How would you describe yourself in one word?", "targets": ["Unique", "Creative", "Determined", "Loyal", "Independent"]}
{"anchor": "If you had 24 hours to live, what would you do, what movie star would you want to kiss, and who would you notify that you are dying?", "targets": ["I would spend my time with my loved ones, kiss Angelina Jolie, and notify my family", "I would make all the memories I could, kiss Brad Pitt, and notify my friends", "I would travel the world, kiss Tom Cruise, and notify my colleagues", "I would donate my money to charity, kiss Emma Stone, and notify my partner", "I would fulfill my dreams, kiss Keanu"]}
{"anchor": "If today were the last day of your life, would you want to do what you are about to do today?", "targets": ["Spend time with my loved ones", "Travel to my favorite place", "Pursue a life-long dream", "Give back to my community", "Try something completely new"]}
{"anchor": "Which is better: asking for permission or asking for forgiveness?", "targets": ["Asking for permission", "Asking for forgiveness", "It depends on the situation", "Seeking advice beforehand", "Preparing for all possible outcomes"]}
{"anchor": "If a crystal ball could tell you the truth about yourself, your life, the future or anything else, what would you want to know? If so why?", "targets": ["I would want to know what career path I should take in order to find the most fulfillment", "I would want to know what my life will look like 10 years from now", "I would want to know what the best course of action is for achieving my goals", "I would want to know how to best nurture my relationships", "I would want to know the best way to live a healthy and meaningful life"]}
{"anchor": "How do you feel about the term “team building”?", "targets": ["It's an important aspect of any successful organization", "It helps build trust among team members", "It encourages collaboration and communication", "It fosters an atmosphere of cooperation and shared goals", "It can lead to greater productivity and effectiveness over time"]}
{"anchor": "What does a good team look like?", "targets": ["Positive and collaborative", "Self-motivated and driven", "Creative and innovative", "Dedicated to their mission", "Committed to doing their best"]}
{"anchor": "What does an effective team look like?", "targets": ["A team with clear goals and a sense of direction", "A team with passionate and dedicated members", "A team with strong communication and collaboration skills", "A team with diverse backgrounds and skills", "A team with clear roles and responsibilities"]}
{"anchor": "What are some things that can get in the way of a team being effective?", "targets": ["Poor communication", "Conflict of interest", "Lack of resources", "Lack of motivation", "Lack of trust"]}
{"anchor": "What is your favorite thing about working with your teammates?", "targets": ["Collaborating on projects", "Supporting each other", "Spending time together", "Learning from each other", "Having each other's backs"]}
{"anchor": "If you could choose, what would you like to get out of this team-building exercise?", "targets": ["A chance to better understand each other’s strengths", "An opportunity for improved communication within the team", "Strategies for stronger collaboration and cooperation", "Methods for strengthening our team dynamic", "Insight into the team’s overall morale and productivity"]}
{"anchor": "Do you think we have a good team here, or could it be better?", "targets": ["We have an excellent team that can always strive to be better", "We have an amazing team and we can definitely cultivate an even stronger bond", "We have a great team and with a little hard work and dedication we can take it to the next level", "I believe we have a positive and motivated team and decisions made together can only lead to further success", "We are strong together and with a few adjustments we"]}
{"anchor": "Do you feel appreciated by your teammates?", "targets": ["Yes, I'm always recognized for the work I do.", "Absolutely, they always make sure to thank me for my input.", "Yes, in the form of verbal compliments and other gifts.", "Yes, my teammates show their appreciation for me by giving me additional tasks.", "Yes, they express their satisfaction with my work every chance they get."]}
{"anchor": "What is your most treasured memory?", "targets": ["Going on my first family vacation", "Graduating college", "Staying up all night watching the stars", "Meeting my best friend", "Having my first really great job"]}
{"anchor": "If you knew that in one year you would die suddenly, would you change anything about the way you are now living? Why?", "targets": ["Yes, I would travel more and enrich my life with experiences.", "Yes, I would take more time to enjoy life and its simple pleasures.", "Yes, I would take more risks and try new things.", "Yes, I would spend more time with my loved ones and make more meaningful connections.", "Yes, I would give back to my community and make a difference before I leave."]}
{"anchor": "What does friendship mean to you?", "targets": ["Loyalty", "Trust", "Love", "Support", "Understanding"]}
{"anchor": "What roles do love and affection play in your life?", "targets": ["Love and affection bring joy and comfort", "Love and affection support growth and learning", "Love and affection nurture relationships", "Love and affection provide safety and security", "Love and affection act as a beacon of hope"]}
{"anchor": "Alternate sharing something you consider a positive characteristic of your partner.", "targets": ["His creativity", "Her intelligence", "His supportive nature", "Her optimism", "His generosity"]}
{"anchor": "How close and warm is your family? Do you feel your childhood was happier than most other people’s?", "targets": ["Very close and warm. My childhood was full of love and joy", "Extremely close. My childhood was full of adventure and fun", "Very close and meaningful. My childhood was definitely a happy one", "Very warm and supportive. I feel I had a much better childhood than others", "Very close and enjoyable. I feel lucky to have had such a wonderful childhood"]}
{"anchor": "How do you feel about your relationship with your mother?", "targets": ["I appreciate her support", "I admire her advice and guidance", "We are close and connected", "We respect each other", "We have an honest and open relationship"]}
{"anchor": "Make three true “we” statements each.", "targets": ["We will always strive to be kind to one another", "We are dedicated to achieving our goals", "We will never give up on our dreams", "We will always support each other", "We will never stop learning"]}
{"anchor": "What is the best book you have ever read?", "targets": ["The Great Gatsby", "1984", "To Kill a Mockingbird", "Harry Potter series", "The Catcher in the Rye"]}
{"anchor": "What was your favorite childhood television program?", "targets": ["Arthur", "Hey Arnold!", "Spongebob Squarepants", "Rugrats", "Recess"]}
{"anchor": "What do you think about the most?", "targets": ["Finding ways to make a positive impact in the world", "Learning something new", "Building meaningful relationships", "Planning my next adventure", "Having meaningful conversations"]}
{"anchor": "What’s the last thing that made you cry?", "targets": ["A touching story", "The loss of a loved one", "The movie Up", "A sad song", "Seeing an abused animal"]}
{"anchor": "How much time do you spend on social networking in a week?", "targets": ["4 hours", "6 hours", "8 hours", "10 hours", "12 hours"]}
{"anchor": "Do you enjoy your job, or do you dread going to work every day?", "targets": ["I enjoy my job", "I look forward to going to work every day", "I have a passion for what I do", "I'm motivated to do my best", "I love what I do"]}
{"anchor": "What song makes you sad?", "targets": ["“Hallelujah” by Leonard Cohen", "“Nothing Compares 2 U” by Sinéad O’Connor", "“Landslide” by Fleetwood Mac", "“Smells Like Teen Spirit” by Nirvana", "“Everybody Hurts” by R.E.M."]}
{"anchor": "What is your favorite thing to do in the summer?", "targets": ["Swimming", "Camping", "Hiking", "Fishing", "Gardening"]}
{"anchor": "What would you do if you were late for an appointment and couldn’t find a parking spot?", "targets": ["Call ahead to explain the situation and apologize", "Try to find a spot further away from the destination and walk", "Ask someone nearby if it’s okay to park for a few minutes", "Take public transportation", "Take a taxi or ride-share service"]}
{"anchor": "What is your favorite thing about your mom or dad?", "targets": ["Their unconditional love and support", "Their sense of humor", "Their wisdom", "Their passion and enthusiasm", "Their unconditional acceptance of me"]}
{"anchor": "What is the one thing that you can’t stand to eat?", "targets": ["Raw vegetables", "Tofu", "Fish", "Liver", "Cheesecake"]}
{"anchor": "What is your favorite holiday and why?", "targets": ["Christmas, because I can spend time with family and exchange gifts.", "Easter, because it marks the end of a long winter and the start of Spring.", "Independence Day, because I'm proud to live in a free country.", "Thanksgiving, because of the delicious food and appreciation for friends and family.", "Halloween, because I like to dress up and get candy."]}
{"anchor": "Who do you admire most in the world and why?", "targets": ["Nelson Mandela, for advocating for peace and justice", "Malala Yousafzai, for standing up for girls' education", "Elizabeth Warren, for her unwavering commitment to progressive policies", "Greta Thunberg, for raising awareness on climate change", "Oprah Winfrey, for her courage and determination to fight inequality"]}
{"anchor": "If you could go back in time and relive one day from your life, what day would it be and why?", "targets": ["My wedding day, to experience that special moment one more time", "The day I graduated college, to relive the feeling of accomplishment", "The day I adopted my pet, to remember the joy of welcoming them home", "The day I moved to a new city, to appreciate the thrill of a new adventure", "My 21st birthday, to reminisce on the excitement of a new milestone"]}
{"anchor": "What is the tallest building in the world?", "targets": ["Burj Khalifa", "Shanghai Tower", "Abraj Al-Bait Clock Tower", "Guangzhou CTF Financial Center", "Lotte World Tower"]}
{"anchor": "What was the name of the last manned mission to the moon?", "targets": ["Apollo 11", "Apollo 12", "Apollo 13", "Apollo 14", "Apollo 17"]}
{"anchor": "Who wrote Harry Potter?", "targets": ["J.K. Rowling", "J.R.R. Tolkien", "J.M. Barrie", "William Shakespeare", "George R.R. Martin"]}
{"anchor": "In which country is Mount Everest located?", "targets": ["Nepal", "India", "Bhutan", "China", "Tibet"]}
{"anchor": "When did Mickey Mouse first appear on TV?", "targets": ["November 18, 1928", "In the first animated film Steamboat Willie", "In The classic Mickey Mouse Club", "In the Mickey Mouse cartoon Building a Building", "In the first ever Pluto cartoon The Chain Gang"]}
{"anchor": "Was there truly love before there was even time itself?", "targets": ["Yes, I believe love existed even before time", "Love is an innate idea that existed before time", "Love transcends time, so yes, it was there", "Absolutely, love is timeless", "Love was here before any notion of time"]}
{"anchor": "How much is too much before something becomes too little instead of just enough not being enough anymore?", "targets": ["A single drop in an overflowing cup", "A speck of dust in an acre of land", "A second of eternity", "A millisecond in an hour", "A sliver of hope in an ocean of despair"]}
{"anchor": "Is there a purpose to human existence other than survival, reproduction, and entertainment?", "targets": ["To find inner peace and enlightenment", "To be of service to others", "To understand and appreciate the world", "To create and innovate", "To strive for spiritual growth"]}
{"anchor": "Where are there three places where I feel connected to others?", "targets": ["At church", "At the park", "At a bar", "At school", "At a family gathering"]}
{"anchor": "“Is it raining?”", "targets": ["Yes", "No", "Maybe", "I don't know", "It's starting to rain"]}
{"anchor": "“Are you gay?”", "targets": ["No", "Absolutely Not", "That’s Not Relevant", "That's Personal", "No, But I Respect Everyone's Lifestyle"]}
{"anchor": "“Is that a wig?”", "targets": ["No, it is my real hair", "Nope, I use a flat iron on it", "Haha, no, my hair just looks like that", "No it's not, I just grew it that way", "Nah, it's au naturel!"]}
{"anchor": "“What time is it?”", "targets": ["It's time to follow your dreams", "It's time to make a change", "It's time to help others", "It's time to be kind", "It's time to spread love"]}
{"anchor": "“Do you know how fast you were going?”", "targets": ["No", "Yes, I was going the speed limit", "Yes, I was going 5 mph over the speed limit", "No, but I know I was going too fast", "Yes, I was going 10 mph over the speed limit"]}
{"anchor": "“Are you hungry?”", "targets": ["Yes, I sure am!", "Not right now, thanks", "Absolutely starving", "I would love a snack", "A little bit, yeah"]}
{"anchor": "“Do you want to go watch a movie with me later tonight?”", "targets": ["Yes, I would love to!", "Sure, that sounds fun!", "Absolutely, I'm in!", "Yes, let's do it!", "Definitely, count me in!"]}
{"anchor": "Does anybody truly know what time it is – both literally and figuratively speaking?", "targets": ["No, it's impossible to account for everyone's perspective", "Yes, if you ask the right people", "It's a matter of perception", "Time is both relative and constant", "Time is an illusion"]}
{"anchor": "When does a memory become a ghost instead of a trophy?", "targets": ["When the memories are painful and unresolved", "When the memories evoke bad feelings of regret and guilt", "When the memories are of difficult times from the past", "When the memories remind us of a time when we felt lost", "When the memories overshadow our joyous ones"]}
{"anchor": "Is there such a thing as divine justice?", "targets": ["Yes", "No", "Maybe", "It Depends", "Difficult to say"]}
{"anchor": "Would I rather be smart than pretty?", "targets": ["Yes", "No", "It depends on the situation", "It depends on what I'm trying to accomplish", "Both things are important"]}
{"anchor": "Is history still happening?", "targets": ["Yes, history is always happening", "History is never ending", "History is constantly being re-written", "History is an ongoing process", "History is always evolving"]}
{"anchor": "Why are there so many stupid rules?", "targets": ["To maintain order", "To protect people", "To enforce laws", "To prevent chaos", "To deter wrongdoers"]}
{"anchor": "What will happen if I never take action and just keep thinking about doing something instead of actually doing it?", "targets": ["Nothing", "You will miss out on key opportunities", "Your dreams won't be fulfilled", "You will stay stagnant", "You will always have the sense of regret"]}
{"anchor": "Are ideas more important than actions?", "targets": ["Yes", "Depends on the situation", "No", "It's not a matter of which one is more important, it's a matter of both working together", "It depends on the person and their individual goals"]}
{"anchor": "What is the funniest thing that has ever happened to you?", "targets": ["Tripping during a school recital", "Pranking a classmate and being pranked back", "Falling off of a chair in a public place", "Mistaking an adult for a child while talking", "Finding an old childhood toy in an unexpected place"]}
{"anchor": "What do you think about tattoos and piercings?", "targets": ["They are a form of self-expression", "They can be a meaningful reflection of identity", "They are a way to make a statement", "They are a form of art", "They can be a fun way to express creativity"]}
{"anchor": "Do you believe in God?", "targets": ["Yes", "No", "Partially", "I'm not sure", "I'm spiritual, but not religious"]}
{"anchor": "What do you want to eat right now?", "targets": ["Sushi", "Pizza", "Pasta", "Burger", "Tacos"]}
{"anchor": "Who do you hate, and why?", "targets": ["Bullies", "People who lie", "Ignorance", "Hypocrites", "Bigotry"]}
{"anchor": "What would be your dream job?", "targets": ["Video game programmer", "Singer-songwriter", "Professional athlete", "Hollywood actor", "Professional chef"]}
{"anchor": "How would the world change if super heroes and super villains actually existed?", "targets": ["The need for law enforcement would be drastically reduced", "The world's economy would shift drastically", "Nations would strengthen or weaken their alliances depending on their allegiances", "Certain cities would become havens for either villains or heroes", "Technology and science could evolve more quickly"]}
{"anchor": "What was your childhood like?", "targets": ["Carefree and adventurous", "Happy and fun", "Filled with friends and laughter", "Highlights of growing up", "Exciting times full of joy"]}
{"anchor": "What is the best party you have ever attended?", "targets": ["My 21st birthday celebration", "A surprise party for a friends graduation", "A masquerade ball", "My high school prom", "A housewarming party for my best friend"]}
{"anchor": "What was your favorite book as a child?", "targets": ["The Giving Tree", "The Lion, the Witch and the Wardrobe", "Charlotte's Web", "The Adventures of Tom Sawyer", "Where the Wild Things Are"]}
{"anchor": "What game do you keep coming back to play over and over again?", "targets": ["Fortnite", "League of Legends", "Overwatch", "Call of Duty", "Minecraft"]}
{"anchor": "What is on your bucket list?", "targets": ["Visit the Great Wall of China", "Dive the Great Barrier Reef", "Climb Mount Everest", "See the Northern Lights", "Explore the Amazon rainforest"]}
{"anchor": "What is your favorite word in the dictionary?", "targets": ["Juxtaposition", "Paradigm", "Effervescent", "Serendipity", "Exuberant"]}
{"anchor": "What is the best part of being a human?", "targets": ["Being creative", "Learning", "Connecting with people", "Experiencing different emotions", "Having the ability to make a difference"]}
{"anchor": "How much do you have to pay in order to have a good time?", "targets": ["Not a lot, it's all about how you use your time", "It depends on the activity", "Free activities can be just as fun", "As much as you are willing to pay", "If you have the right company, you'll have a good time no matter how much you spend"]}
{"anchor": "What is your favorite thing about our relationship?", "targets": ["The trust we have", "The laughter we share", "The support we give each other", "The way we can talk about anything", "The way our conversations always flow easily"]}
{"anchor": "Who’s your favorite musician, and why is he or she your favorite?", "targets": ["Coldplay, because of their emotionally-driven music", "John Mayer, because of his composition skills", "Taylor Swift, because of her ability to tell meaningful stories", "Khalid, because of his unique tones", "BTS, because of their inspiring messages of self-love and acceptance"]}
{"anchor": "If I were stranded on a deserted island, what would I need to survive and why would I need it?", "targets": ["A sharpened stick for protection", "A fire starter for warmth and cooking", "A fishing net for food", "A container for water", "A multitool to build a shelter and make tools"]}
{"anchor": "Is what you’re doing now what you always wanted to do growing up?", "targets": ["Yes", "No", "I'm doing something related to what I wanted to do", "I'm doing something totally different", "I'm still in the process of discovering what I'm meant to do"]}
{"anchor": "Do you have any fears?", "targets": ["Fear of the unknown", "Fear of heights", "Fear of failure", "Fear of success", "Fear of making a wrong decision"]}
{"anchor": "What’s something you’re proud of – can be anything?", "targets": ["Finishing my degree", "Traveling around the world", "Buying my first home", "Running a marathon", "Volunteering for a cause I care about"]}
{"anchor": "What is a relationship deal breaker for you?", "targets": ["Dishonesty", "Disrespect", "Untrustworthiness", "Manipulation", "Lack of commitment"]}
{"anchor": "Have you ever been out of the country? If so, where all have you traveled?", "targets": ["Yes, I've been to parts of Canada", "Yes, I've been to France", "Yes, I've been to Mexico", "Yes, I've been to Spain", "Yes, I've been to Italy"]}
{"anchor": "If all jobs had the same pay and hours, what job would you like to have?", "targets": ["Scientist", "Artist", "Teacher", "Lawyer", "Entrepreneur"]}
{"anchor": "What is the most interesting thing you can see out of the window right now?", "targets": ["A flock of birds", "The reflection of the sunset", "A rainbow", "A family of deer", "A hot air balloon"]}
{"anchor": "If you were able to see in the future, what would you tell yourself or want to know?", "targets": ["Future stock market trends", "What new invention to invest in", "Developments in technology", "Warnings of potential disasters", "Changes in the global economy"]}
{"anchor": "If you could only hear one song for the rest of your life, what would it be and why?", "targets": ["Bohemian Rhapsody", "Wonderwall", "Give A Little Bit", "I Will Survive", "Don't Stop Believin'"]}
{"anchor": "If you could make a 20 second phone call to yourself at any point in your life present or future, when would you call and what would you say?", "targets": ["I'd call myself 5 years from now and tell myself to never give up", "I'd call myself 10 years from now and remind myself to keep learning", "I'd call myself 1 year from now and tell myself to stay persistent", "I'd call myself 3 years from now and tell myself to always stay humble", "I'd call myself tomorrow and remind myself to keep smiling"]}
{"anchor": "Who has impressed you most with what they’ve accomplished?", "targets": ["Elon Musk", "Oprah Winfrey", "Bill Gates", "Malala Yousafzai", "Jeff Bezos"]}
{"anchor": "Who has been the kindest to you in your life?", "targets": ["My parents", "My best friend", "My teacher", "My sibling", "My counselor"]}
{"anchor": "Why do we say “a pair of pants” but not “a pair of socks”?", "targets": ["The word pants is plural in itself, whereas socks isn’t.", "Pants are typically sold as a pair, whereas socks are usually sold in separate quantities.", "Pants usually come as a set, whereas you can buy a single pair of socks.", "We say “a pair of pants” to emphasize the twin legs of the garment.", "We don’t usually refer to"]}
{"anchor": "Why do you always need to replace the toilet paper roll, but you never need to replace the soap?", "targets": ["Most people need toilet paper more often than soap", "Toilet paper runs out faster than soap", "Toilet paper is used more frequently than soap", "Soap is more durable than toilet paper", "Toilet paper is a single-use item, while soap is not"]}
{"anchor": "Why are there no “B” batteries?", "targets": ["To reduce confusion, as all household batteries are the same shape and size", "To make it easier to remember and distinguish between battery sizes", "To create an industry standard for battery sizes", "To avoid possible trademark issues with other brands for similar sounding products", "To provide consistency in the marketplace and reduce cost for the consumer"]}
{"anchor": "Why can’t you just say “hi” without adding “how are you?”", "targets": ["To be polite and show consideration for the other person", "To start a conversation", "To express care and concern", "To show respect", "To make the other person feel welcome and appreciated"]}
{"anchor": "How did the headless horseman know where he was going?", "targets": ["He followed the sound of the wind", "He had supernatural senses", "He had a magical compass", "He had gotten a vision from a ghost", "He was guided by the moonlight to his destination"]}
{"anchor": "If a person owns a piece of land do they own it all the way down to the core of the earth?", "targets": ["No, unless specifically stated in the deed or legal document", "Generally not, since they will not be able to access the earth’s core", "The rights of ownership generally do not extend beyond the surface", "As core ownership rights are ruled by the nation in which the owner resides, it can vary", "It depends on the applicable national, state and local laws, but generally not"]}
{"anchor": "Do you get mad when people touch your phone?", "targets": ["Yes", "No", "Depends on who it is", "Depends on why they're touching it", "Depends on what they're doing with it"]}
{"anchor": "How much do you spend on groceries each week?", "targets": ["$50", "$100", "$150", "$200", "$250"]}
{"anchor": "How many pairs of shoes do you own?", "targets": ["5", "10", "15", "20", "25"]}
{"anchor": "Have you ever kept something important in a secret hiding place?", "targets": ["Yes", "No", "Maybe", "Not Yet", "Not at the Moment"]}
{"anchor": "Do you like to keep your desk organized or not organized?", "targets": ["Organized", "Not Organized", "Semi-organized", "Organized with a few scattered items", "Neatly organized but not overly so"]}
{"anchor": "What’s the weirdest thing you’ve ever seen at work?", "targets": ["A coworker wearing a costume", "A coworker attempting to juggle with knives", "An unannounced visit from the CEO", "Colleagues singing random songs", "A new recruit drawing on the walls with crayons"]}
{"anchor": "When was the last time you went to the movies?", "targets": ["Last night", "Last Saturday", "Two weeks ago", "Three months ago", "A year ago"]}
{"anchor": "What is the most unusual word that you know?", "targets": ["Quixotic", "Esoteric", "Brouhaha", "Galimatias", "Poltergeist"]}
{"anchor": "Do you have a pair of lucky underwear or socks?", "targets": ["Yes, I have a lucky pair", "Nope, don't need 'em", "I have a pair that I rotate on special occasions", "Yes, I have an entire drawer full!", "I have special socks for good luck, but no lucky underwear"]}
{"anchor": "Why is it so windy at the beach?", "targets": ["To blow sand across the shore", "To circulate air along the coastline", "To disperse sea foam", "As a result of hurricanes hitting the shore", "To eliminate stagnant air and refresh the beach atmosphere"]}
{"anchor": "What makes the ocean salty?", "targets": ["Dissolved ocean salts", "Mineral runoff from nearby rivers", "Evaporation of ocean water", "Volcanic deposits", "Salt deposits left behind by ancient seas"]}
{"anchor": "Why do we have seasons?", "targets": ["To give variation and change to the environment and its inhabitants.", "To offer differing conditions for plants and animals to thrive in.", "To provide respite from the same environment.", "To keep the Earth's orbit stable.", "To balance the amount of daylight and varying temperatures across the globe."]}
{"anchor": "How do volcanoes form?", "targets": ["Through rising magma", "Through melting of the Earth's crust", "Through explosive eruptions", "Through folding and faulting of the Earth's crust", "Through resurgence of magma from deeper areas in the Earth"]}
{"anchor": "Why is there lightning before it rains?", "targets": ["To signal that clouds are full of charged particles", "To indicate an impending storm", "To release energy in order to form rain droplets", "To create a beautiful light show", "To release excess electrical energy in the atmosphere"]}
{"anchor": "Do you consider yourself a risk taker?", "targets": ["Yes, definitely", "I take calculated risks", "Only in certain circumstances", "No, I'm too conservative", "I like to live on the edge"]}
{"anchor": "What fascinates you most about the universe?", "targets": ["Its infinite expanse", "The way stars form and die", "The mystery of black holes", "The complexity of nature", "The idea of time travel"]}
{"anchor": "What superpower would you like to have?", "targets": ["Flight", "Telepathy", "Immortality", "Super Strength", "Time Manipulation"]}
{"anchor": "Are you a fan of horror movies?", "targets": ["Yes, I love them", "No, I can't stand them", "I like some of them", "I only watch when I'm in the mood", "I don't watch them but I appreciate the genre"]}
{"anchor": "What would you do with a million dollars?", "targets": ["Start a business", "Give to charity", "Invest it in stocks", "Travel the world", "Buy a house"]}
{"anchor": "What comes to mind when you hear the word \"love\"?", "targets": ["Close relationships", "A strong feeling of connection", "Devotion", "Comfort", "Unconditional acceptance"]}
{"anchor": "Do you prefer indoors or outdoors?", "targets": ["Outdoors", "Indoors", "Equally", "I love a combination of both", "It depends on my mood"]}
{"anchor": "If you could travel through time, would you?", "targets": ["Yes, absolutely", "No, I wouldn't", "Only to certain points in time", "Just to visit some place in the past", "Only to witness important events"]}
{"anchor": "What do you like to do in your free time?", "targets": ["I like to spend time with friends and family", "I like to read books and explore new hobbies", "I like to go on hikes and nature walks", "I like to watch movies and hang out at home", "I like to travel and explore new places"]}
{"anchor": "Are you an optimist or a pessimist?", "targets": ["Optimist", "Pessimist", "Realist", "Idealist", "A bit of all three"]}
{"anchor": "What would you do if you had an infinite amount of money?", "targets": ["Invest it in starting a business", "Start a philanthropic foundation", "Create a fund for scientific research", "Buy a fleet of luxury cars", "Buy a private island"]}
{"anchor": "Is there anything that scares you?", "targets": ["The unknown", "Spiders", "Heights", "Heights, but only if I'm alone", "Being alone in the dark"]}
{"anchor": "What do you do to relax?", "targets": ["Meditate", "Take a hot bath", "Watch a movie", "Go for a walk in nature", "Do yoga"]}
{"anchor": "What would you do if you had 24 hours to live?", "targets": ["Tell the people I love how much I care", "Travel the world", "Give away what I own", "Record a message to leave behind", "Spend time with friends and family"]}
{"anchor": "Are you a night owl or a morning person?", "targets": ["Night owl", "Morning person", "I'm both", "Depends on the day", "I’m a Twilight Person"]}
{"anchor": "If you could reincarnate, would you?", "targets": ["Yes", "No", "Maybe, if I could keep my memories from a past life", "Maybe, if I could come back into a different animal form", "Maybe, if I could come back into a different human form"]}
{"anchor": "Would you rather be feared or respected?", "targets": ["Respected", "Fear", "Both", "Depends on the situation", "Neither"]}
{"anchor": "What would you do if you were invisible for a day?", "targets": ["Spy on people", "Steal something", "Go back in time", "Get into restricted places", "Make someone laugh"]}
{"anchor": "What would you do if you could have one wish granted?", "targets": ["Peace on Earth", "World hunger eradication", "Worldwide education", "Secretly solving a criminal case", "Bringing a loved one back to life"]}
{"anchor": "Do you prefer large cities or small towns?", "targets": ["Large cities", "Small towns", "I like both", "It depends on the location", "I would choose based on what activities I want to do"]}
{"anchor": "How do you feel about being in a group of strangers?", "targets": ["Intimidated", "Excited", "Nervous", "Restless", "Protective"]}
{"anchor": "Do you like working alone or in a team?", "targets": ["Alone", "In a team", "I like both", "Depends on the task", "I prefer working alone, but I enjoy collaborating with others"]}
{"anchor": "Are you a morning person or a night person?", "targets": ["Morning person", "Night person", "Depends on the day", "Twilight person", "Both morning and night"]}
{"anchor": "What motivates you?", "targets": ["Accomplishments and successes", "Setting and accomplishing goals", "Helping others", "Being part of a team", "Creative ideas and challenges"]}
{"anchor": "If you could be a fictional character, who would you choose?", "targets": ["Batman", "Wonder Woman", "Iron Man", "Captain America", "The Hulk"]}
{"anchor": "What is your favorite love song?", "targets": ["Can't Help Falling in Love", "All of Me", "Crazy in Love", "I Will Always Love You", "A Thousand Years"]}
{"anchor": "What is your favorite color?", "targets": ["Red", "Blue", "Green", "Yellow", "Purple"]}
{"anchor": "What is your favorite food?", "targets": ["Sushi", "Tacos", "Pizza", "Burgers", "Ramen"]}
{"anchor": "What is your favorite drink?", "targets": ["Coffee", "Green Tea", "Soda", "Latte", "Smoothie"]}
{"anchor": "What is your idea of a perfect date?", "targets": ["A picnic in the park", "A night out dancing", "Dinner and a show", "A movie night", "A day at the beach"]}
{"anchor": "What’s your favorite book of all time?", "targets": ["1984 by George Orwell", "To Kill a Mockingbird by Harper Lee", "The Catcher in the Rye by J.D. Salinger", "The Great Gatsby by F. Scott Fitzgerald", "The Lord of the Rings by J. R. R. Tolkien"]}
{"anchor": "Are we our sisters’ keepers?", "targets": ["Yes, we should help each other when we can", "We should strive to protect and support each other", "Absolutely, it's our duty", "Only if they need it", "Yes, because we both live in the same world"]}
{"anchor": "If you could only eat one food for the rest of your life, what would it be?", "targets": ["Sushi", "Pizza", "Grilled Cheese", "Tacos", "Pasta"]}
{"anchor": "If you could only hear one song for the rest of your life, what would it be?", "targets": ["Bohemian Rhapsody", "Imagine", "Stairway to Heaven", "We Will Rock You", "Born This Way"]}
{"anchor": "If I were an animal, what would I be and why?", "targets": ["A penguin, because they are impossible to knock down and always moving forward", "A lion, because they are brave and embody strength", "A fox, because they are cunning and clever", "An owl, because they are wise and sharp", "A dolphin, because they are graceful and intelligent"]}
{"anchor": "If I had one month to live, what would I do?", "targets": ["Help those close to me gain closure", "Visit beautiful destinations one last time", "Try and make a difference in the world", "Capture the best memories of my life", "Live life to its fullest"]}
{"anchor": "If I had one week to live, what would I do?", "targets": ["Spend time with those I love", "Make a difference in someone's life", "Travel to a place I've wanted to visit", "Write a will and say goodbye", "Make a bucket list and accomplish it"]}
{"anchor": "What’s your biggest fear?", "targets": ["Public speaking", "Dying alone", "Failure", "Heights", "The unknown"]}
{"anchor": "What was your favorite childhood game?", "targets": ["Hide and Seek", "Tag", "Hopscotch", "Jacob's Ladder", "Capture the Flag"]}
{"anchor": "If you could only watch one movie for the rest of your life, what would it be?", "targets": ["Forrest Gump", "The Godfather", "Back to the Future", "Star Wars", "The Shawshank Redemption"]}
{"anchor": "Why are some things worse than others?", "targets": ["Lack of access, education, and/or resources", "Poor decisions made by individuals or governments", "Unfavorable environmental conditions", "Preference based on prejudices", "Inequality of wealth distribution"]}
{"anchor": "If you could have a superpower, what would it be and why?", "targets": ["Shape shifting - to be able to become any form I need to take", "Mind control - to be able to influence the decisions that people make", "Invisibility - to be able to observe without being seen", "Flight - to be able to explore the world from above", "Teleportation - to be able to go anywhere I want in an instant"]}
{"anchor": "If you could change three things about yourself, what would they be?", "targets": ["Spend more time focusing on the present rather than worrying about the past or future", "Be more assertive in my decisions", "Have more control over my emotions", "Learn to be more organized", "Improve my problem-solving skills"]}
{"anchor": "If you could live anywhere in the world, where would you want to be?", "targets": ["Paris", "Barcelona", "Tokyo", "London", "New York City"]}
{"anchor": "What was the worst phase in your life?", "targets": ["When I lost my job", "When my family was going through a tough time", "When I had to struggle with my mental health", "When I was facing a lot of financial problems", "When I was facing bullying or discrimination"]}
{"anchor": "What are the most important things in relationships for you?", "targets": ["Communication", "Trust", "Mutual Respect", "Compromise", "Honesty"]}
{"anchor": "What’s the best relationship advice you’ve ever received?", "targets": ["Communication is key", "Always be honest", "Be patient with each other", "Spend quality time together", "Try to understand the perspective of the other person"]}
{"anchor": "If I could change one thing about myself, what would it be?", "targets": ["My work ethic", "My patience", "My communication skills", "My impulsivity", "My attention to detail"]}
{"anchor": "What is your favorite thing about love?", "targets": ["Its ability to bring people together", "Its power to heal", "Its capacity to make us feel alive", "Its ability to make us appreciate the small things", "Its ability to make us feel invincible"]}
{"anchor": "What is your most terrible memory?", "targets": ["Getting held back in school", "Getting bullied by classmates", "Losing a parent", "Watching a loved one suffer", "Being betrayed by a friend"]}
{"anchor": "Who is your role model? Why?", "targets": ["My mother, because she is a strong and determined woman.", "Nelson Mandela, because he inspired people to stay true to themselves and fight for freedom.", "Dr. Martin Luther King Jr, because he fought for equality and stood up for justice.", "Malala Yousafzai, because she is an inspirational advocate for the rights of all children.", "Steve Jobs, because he was a visionary who"]}
{"anchor": "If you could live anywhere, where would it be?", "targets": ["Tokyo", "New York City", "Paris", "Sydney", "London"]}
{"anchor": "Who was the first president of the United States of America?", "targets": ["George Washington", "John Adams", "Thomas Jefferson", "James Madison", "John Quincy Adams"]}
{"anchor": "What is the worst part of being human?", "targets": ["Our mortality", "Our vulnerability", "Our capacity to hurt others", "Our tendency to forget", "Our short attention span"]}
{"anchor": "What do you least like about yourself?", "targets": ["My self-doubt", "My lack of confidence", "My procrastination", "My fear of failure", "My perfectionism"]}
{"anchor": "If you could change one thing about yourself, what would it be?", "targets": ["To be more patient", "To be more confident", "To be more organized", "To be more outgoing", "To be more thoughtful"]}
{"anchor": "How do you like to be comforted when you’re sad or upset?", "targets": ["With a hug and gentle words", "Through distractions like playing video games", "Going for a walk", "Cuddling with a pet", "Watching a funny movie or TV show"]}
{"anchor": "What is the best piece of advice anyone has ever given you?", "targets": ["Believe in yourself and never give up", "Follow your heart and take risks", "Value yourself and others", "Life is too short to waste time being unhappy", "Remember that you have the power to create your own destiny"]}
{"anchor": "How long have you been a spy?", "targets": ["Since high school", "Since college", "Since the military", "Since I was a young adult", "Since I can remember"]}
{"anchor": "What kind of missions have you been assigned?", "targets": ["Recon", "Political", "Counter-Intelligence", "Assassinations", "Supply line sabotage"]}
{"anchor": "What kind of skills and abilities do you have?", "targets": ["Linguistics", "Surveillance", "Combatives", "Spycraft", "Stealth"]}
{"anchor": "What is the most dangerous thing you have ever done?", "targets": ["Infiltrate a heavily guarded compound", "Helped a wanted fugitive escape", "Destroyed a bridge as a diversion", "Accessed a secure computer system", "Harmed a high value target"]}
{"anchor": "What does your life look like when you are not working?", "targets": ["Traveling", "Reading", "Hunting", "Fishing", "Piloting"]}
{"anchor": "What nationality are you?", "targets": ["American", "Canadian", "German", "Russian", "British"]}
{"anchor": "Are you a solo agent?", "targets": ["Yes", "No", "I have an order", "I have a team", "I have many contacts"]}
{"anchor": "What languages do you speak?", "targets": ["English", "Spanish", "German", "Russian", "French"]}
{"anchor": "What is the most important lesson you've learned?", "targets": ["Always trust your gut", "Remain vigilant", "Don't get caught", "Adapt quickly", "Make sure your cover is secure"]}
{"anchor": "What risks have you taken to accomplish a mission?", "targets": ["Infiltrating an enemy base", "Climbing a security fence", "Swimming across a river", "Hacking a computer system", "Going undercover"]}
{"anchor": "Are you currently working on any missions?", "targets": ["Yes", "No", "I'm waiting for new orders", "I'm gathering intel", "I'm preparing for the next step"]}
{"anchor": "Have you ever failed a mission?", "targets": ["Yes", "No", "I learned from my mistakes", "I tried my best", "I completed the mission despite the obstacles"]}
{"anchor": "Are you able to defend yourself in a physical altercation?", "targets": ["Yes", "No", "I'm very good in combat", "It depends on the situation", "I'm a master of martial arts"]}
{"anchor": "Are you aware of any secret societies?", "targets": ["Yes", "No", "I'm familiar with some", "I'm in one myself", "I've heard of a few, but I'm not sure if they exist"]}
{"anchor": "What measures have you taken to protect your mission?", "targets": ["I'm trained in counter-surveillance", "Using false identities", "I carry special tools", "Establishing secure communications paths", "Having a reliable network of contacts"]}
{"anchor": "Are you equipped with any special weapons?", "targets": ["Yes", "No", "A few select pieces", "Nothing out of the ordinary", "My skills are my greatest weapon"]}
{"anchor": "Who is your handler?", "targets": ["A CIA agent", "A retired operative", "I don't have one", "My contact is anonymous", "A former military officer"]}
{"anchor": "What sort of gadgets do you use?", "targets": ["A sophisticated watch", "Security cameras", "Electronic listening devices", "Night-vision glasses", "A miniature drone"]}
{"anchor": "How did you get involved in the spy business?", "targets": ["I was recruited", "It was an assignment", "It was a family affair", "I was born for this job", "I saw an opportunity and took it"]}
{"anchor": "What is the most daring thing you have ever done?", "targets": ["Infiltrated a high security government facility", "Jumped out of a plane", "Sneaked past a heavily armed guard", "Swam with sharks", "Ran through a labyrinth-like jungle"]}
{"anchor": "Are you involved in any secret groups?", "targets": ["Yes", "No", "I am a part of a large network", "I operate in small teams", "It depends on the mission"]}
{"anchor": "What skills do you possess?", "targets": ["Hacking", "Surveillance", "Disguise", "Marksmanship", "Deductive reasoning"]}
{"anchor": "Do you believe in fate?", "targets": ["Yes", "No", "I do what I must", "My fate is in my own hands", "I believe in the power of chance"]}
{"anchor": "Have you ever lost a partner?", "targets": ["Yes", "No", "Only in memory", "It was a hard time", "I'll never forget that day"]}
{"anchor": "What do you think of the current social climate?", "targets": ["It’s unpredictable", "It’s alarming", "It’s turbulent", "It's vital to remain aware", "It requires constant vigilance"]}
{"anchor": "How do you stay anonymous?", "targets": ["Constant surveillance", "I never use my real name", "I use assumed identities", "I'm always prepared for a hasty retreat", "I don't trust anyone with my secrets, even family"]}
{"anchor": "What is your most daring tactic?", "targets": ["Going against orders", "Withholding information", "Pursuing a mission solo", "Taking a huge risk", "Betting my life on a single shot"]}
{"anchor": "How do you protect the secrets of your mission?", "targets": ["With a secure encryption system", "By not writing them down", "By guarding my thoughts", "By erasing traceable evidence", "By surrounding myself with trustworthy people"]}
{"anchor": "Have you ever been involved in a car chase?", "targets": ["Yes", "No", "Not on purpose", "Yes, I drove", "I was the target of one"]}
{"anchor": "What types of objects do you carry inside your suitcase?", "targets": ["Money", "Documents", "Guns", "Spy gadgets", "Technology"]}
{"anchor": "Are you willing to travel undercover?", "targets": ["Yes", "No", "Absolutely", "Of course", "It depends on the mission"]}
{"anchor": "How do you access secure information?", "targets": ["Encryption software", "Hidden networks", "Special contacts", "Cryptic messages", "Code words"]}
{"anchor": "What type of communications do you use?", "targets": ["Messengers", "Encrypted emails", "Cell phones", "Radios", "Smoke signals"]}
{"anchor": "What is the most daring mission you've ever been on?", "targets": ["Infiltrating a foreign government", "Sabotaging a secret operation", "Disguising oneself and infiltrating a suspect's network", "Hacking into a database and discovering confidential information", "Breaking into a secure compound and retrieving secret documents"]}
{"anchor": "What strategies do you use to stay ahead of your targets?", "targets": ["Staying as informed as possible of their movements, activities and contacts", "Building relationships with people they came in contact with", "Utilizing technology to track their communication", "Using informants and undercover agents", "Gathering intelligence through various sources"]}
{"anchor": "What is the most creative way you have ever managed to slip past detection during a mission?", "targets": ["Disguising myself as a member of staff in a secluded building", "Hiding in a storage unit and received transport away from the scene after it passed", "Generating a fake suspect identity with false documents", "Finding a less publicized route, using side roads and maintenance paths", "Creating a distraction to draw attention away from myself"]}
{"anchor": "What is the most thrilling experience you’ve ever had?", "targets": ["Escaping from a dangerous situation with my life", "Driving a high-speed car chase", "Risking my life to save a friend", "Investigating a mysterious location for clues", "Uncovering a global conspiracy"]}
{"anchor": "Are you comfortable with taking orders in risky situations?", "targets": ["Yes", "No", "It depends", "Sometimes", "I try to assess the situation before deciding"]}
{"anchor": "When was the last time you used a disguise?", "targets": ["Last week", "Last month", "Last year", "Two weeks ago", "About a year ago"]}
{"anchor": "How close have you come to being caught?", "targets": ["Very close", "I have never come close", "A few times", "I narrowly avoided it", "I was caught once in the past"]}
{"anchor": "Do you carry a weapon for protection?", "targets": ["Yes", "No", "Occasionally", "Depends on the situation", "Only as a last resort"]}
{"anchor": "How would you rate your undercover skills?", "targets": ["Excellent", "Decent", "Good", "Average", "Poor"]}
{"anchor": "How do you stay up to date on intelligence?", "targets": ["I use the latest technology", "Through trusted contacts", "Keeping an eye on events", "Networking with other agents", "Reading reports and documents"]}
{"anchor": "What methods do you use to remain undetected?", "targets": ["Hiding in plain sight", "Disguises", "Diversion tactics", "Concealing objects", "Changing my appearance"]}
{"anchor": "Do you prefer blending in or standing out?", "targets": ["Blending in", "Standing out", "It depends on the situation", "I prefer to be noticed", "I try to remain invisible"]}
{"anchor": "How do you maintain your cover?", "targets": ["I never provide my real identity", "I use aliases and fake documents", "I stick to my cover story", "I adapt to the situation", "I use misdirection tactics"]}
{"anchor": "Who do you report to?", "targets": ["My boss", "My handler", "My leader", "The organization", "A higher authority outside of the agency"]}
{"anchor": "Do you ever question your orders?", "targets": ["Yes", "No", "Occasionally", "Only if they are dangerous", "I'm trained to follow orders"]}
{"anchor": "What are your thoughts on using civilians as sources?", "targets": ["It can be a valuable resource", "I try to avoid it", "Sometimes necessary", "Depends on the situation", "It's unethical and dangerous"]}
{"anchor": "What are your strategies for avoiding danger?", "targets": ["Planning and preparation", "Staying alert", "Maintaining a low profile", "Knowing your surroundings", "Keeping appearances normal"]}
{"anchor": "What are your techniques for gathering information?", "targets": ["All sources of intelligence", "Social engineering", "Surveillance", "Questioning contacts", "Deep cover operations"]}
{"anchor": "What techniques do you use to establish trust?", "targets": ["Honesty and openness", "Respecting the rules", "Meeting in public", "Providing evidence", "Establishing personal connections"]}
{"anchor": "What methods of communication do you use?", "targets": ["Encrypted emails", "Texts and calls", "Social media", "Face to face meetings", "Courier drops"]}
{"anchor": "How do you handle personal relationships?", "targets": ["Carefully", "I don't have any", "With caution", "Minimally", "With discretion"]}
{"anchor": "How do you handle threats?", "targets": ["Report to superiors", "Defend myself if necessary", "Evade", "Disengage and retreat", "Take action if necessary"]}
{"anchor": "How do you handle difficult situations?", "targets": ["Keep cool", "Develop alternate plans", "Analyze the problem", "Use resources", "Think quick and stay calm"]}
{"anchor": "How do you stay motivated?", "targets": ["Remembering my mission", "Taking breaks", "Celebrating small wins", "Keeping a positive attitude", "Working with a team"]}
{"anchor": "How do you handle stress and pressure?", "targets": ["Exercise", "Writing", "Meditation", "Learning something new", "Taking deep breaths"]}
{"anchor": "How do you maintain your focus during long assignments?", "targets": ["Breaking big tasks into smaller ones", "Prioritizing tasks", "Staying organized", "Taking breaks and staying hydrated", "Setting goals and reward yourself"]}
{"anchor": "Do you use disguises and conform to different cultures?", "targets": ["Yes", "No", "Occasionally", "As necessary", "When instructed to"]}
{"anchor": "How would you rate your disguise skills?", "targets": ["Excellent", "Good", "Average", "Decent", "Poor"]}
{"anchor": "Have you ever been put in a difficult or dangerous situation?", "targets": ["Yes", "No", "Once or twice", "I was in a close call", "I have been fortunate so far"]}
{"anchor": "How do you use technology to protect yourself?", "targets": ["Encryption", "Making sure data is secure", "Use of pseudonyms", "Using VPNs and Tor", "Limiting exposure to malware"]}
{"anchor": "When was the last time you went undercover?", "targets": ["Last Year", "Two Years Ago", "Three Years Ago", "Never", "A Long Time Ago"]}
{"anchor": "What challenges have you faced in the line of duty?", "targets": ["Political Opposition", "Dealing with Property Damage", "Maintaining Discretion", "Handling Difficult Situations", "Working with Limited Resources"]}
{"anchor": "What kind of technology do you use in your work?", "targets": ["Cyber Surveillance", "Decrypting Encoded Messages", "Eavesdropping", "Facial Recognition Software", "Audio Recorder Technology"]}
{"anchor": "Have you ever had to go undercover as someone else?", "targets": ["Yes", "No", "Once", "A Few Times", "Frequently"]}
{"anchor": "Are you able to stay cool under pressure?", "targets": ["Yes", "No", "Mostly", "Depends on the Situation", "I Thrive in Pressure"]}
{"anchor": "Are you able to keep secrets?", "targets": ["Absolutely", "Always", "Without a doubt", "Yes, that's my profession", "That is my job"]}
{"anchor": "What is your favorite country?", "targets": ["USA", "Canada", "Mexico", "Brazil", "France"]}
{"anchor": "What type of clothes do you like to wear?", "targets": ["Jeans and t-shirts", "Suits and ties", "Military-style clothing", "Blazers", "Formal wear"]}
{"anchor": "Have you ever been in danger?", "targets": ["Yes", "No", "Many times", "Living on the edge", "I know how to handle myself"]}
{"anchor": "Have you ever travelled to a different continent?", "targets": ["Yes", "No", "All of them", "Almost all", "I'm always on the move"]}
{"anchor": "How do you like to spend your free time?", "targets": ["Reading", "Working out", "Spending time with family", "Exploring new places", "Relaxing somewhere quiet"]}
{"anchor": "Do you prefer to work solo or with a team?", "targets": ["Both", "Solo", "Team", "Depends on the mission", "A good combination of both"]}
{"anchor": "What movies do you watch?", "targets": ["Action", "Thrillers", "Dramas", "Sci-fi", "Animation"]}
{"anchor": "How often do you travel?", "targets": ["Frequently", "A few times a year", "Whenever I'm needed", "As much as possible", "Constantly"]}
{"anchor": "What challenges have you faced in the field?", "targets": ["Resource challenges", "Learning new skills quickly", "Adapting to different cultures", "Working in hostile environments", "Keeping secrets"]}
{"anchor": "What are your thoughts on advanced technology?", "targets": ["It's an essential tool", "Important for modern security", "Helps with difficult operations", "Makes things easier", "It can be a double-edged sword"]}
{"anchor": "What kind of gadgets do you need for your missions?", "targets": ["Surveillance equipment", "Stealth tech", "Communications tools", "Weapons", "High-tech gear"]}
{"anchor": "Do you have any special skills in the field?", "targets": ["Yes", "Stealthy and discreet", "Flexible and agile", "Resourceful and sharp", "Highly trained"]}
{"anchor": "Do you like to meet new people?", "targets": ["Yes", "It's part of the job", "Gathering intel is essential", "Networking is key", "It always helps to have contacts"]}
{"anchor": "How do you evaluate risk?", "targets": ["Carefully", "Analytically", "Strategically", "By assessing the situation", "With intuition and years of experience"]}
{"anchor": "Are you comfortable with public speaking?", "targets": ["Yes", "Somewhat", "No", "I can manage", "It's not my favorite thing, but I can do it"]}
{"anchor": "Are you familiar with the use of code-breaking tools?", "targets": ["Yes", "Absolutely", "It's an integral part of my job", "I have to be up to date on the latest tech", "Breaking codes is my specialty"]}
{"anchor": "What type of missions have you been involved with?", "targets": ["Surveillance", "Counterintelligence", "Covert operations", "Interrogation", "High-stakes missions"]}
{"anchor": "How have you adapted to changing technology?", "targets": ["Quickly and smartly", "By keeping up with the latest advancements", "Staying ahead of the curve", "Keeping up with advancements to stay safe", "Using all my resources to stay current"]}
{"anchor": "Are you comfortable working in dangerous environments?", "targets": ["Yes", "Absolutely", "It's part of the job", "Danger is my middle name", "Always prepared for any situation"]}
{"anchor": "How do you handle stress?", "targets": ["By focusing on the job", "Thinking it through and taking action", "Taking deep breaths", "Taking a step back and assessing the situation", "Visualizing positive outcomes"]}
{"anchor": "What has been your most difficult mission to date?", "targets": ["Learning to trust the right people", "Running quick, covert operations", "Accomplishing high-stakes missions under pressure", "Having to adapt to different environments", "Memorizing codes and tracking targets"]}
{"anchor": "Are you familiar with cryptography software?", "targets": ["Yes", "Very familiar", "It's one of my main tools", "A must for any agent", "An essential part of the spy world"]}
{"anchor": "Have you ever received a commendation for your work?", "targets": ["Yes", "No", "I have been recognized for my work", "My work is so covert I cannot be commended", "I can't remember the last time I was commended"]}
{"anchor": "If you were in a pinch, could you expertly change your identity?", "targets": ["Yes", "No", "It isn't easy", "I can do it in a pinch", "I have done that before"]}
{"anchor": "Do you have any specialized training?", "targets": ["Yes", "No", "Some", "I have superior training", "I am highly trained in a variety of techniques"]}
{"anchor": "What is the best cover story you have used?", "targets": ["I am a photographer", "I am a diplomat", "I am an investor", "I am a researcher", "I am an entrepreneur"]}
{"anchor": "Are you ever asked to do illegal things?", "targets": ["Yes", "No", "Only if it is necessary", "I can't talk about it", "It depends on the situation"]}
{"anchor": "Are you a people-person?", "targets": ["Yes", "No", "I prefer animals", "Depends on the situation", "Only when necessary"]}
{"anchor": "What is your greatest accomplishment?", "targets": ["Solving a difficult case", "Building a successful career", "Breaking a record", "Making significant contributions to the field", "Developing a revolutionary piece of tech"]}
{"anchor": "What is the most important lesson you have learned from your current job?", "targets": ["Adaptation", "Strategy", "Ideation", "Innovation", "Collaboration"]}
{"anchor": "What are the most valuable skills you have acquired as a spy?", "targets": ["Observation", "Communication", "Analytical Thinking", "Discretion", "Problem Solving"]}
{"anchor": "In what ways does spying challenge you intellectually?", "targets": ["Uncovering hidden information", "Reconstructing complex situations", "Uncovering deception", "Developing strategies", "Compiling intelligence"]}
{"anchor": "How have you used your espionage skills in everyday life?", "targets": ["Networking", "Researching", "Anticipating", "Analyzing", "Strategizing"]}
{"anchor": "How have you seen the spying profession evolve?", "targets": ["It is more tech-driven", "There is more public scrutiny", "Greater emphasis on data analysis", "More collaboration between agencies", "Longer learning curves for new operatives"]}
{"anchor": "What is the most important advice you would give to someone considering a career in spying?", "targets": ["Develop strong operational security", "Be prepared to put national security before personal comfort", "Learn to think strategically", "Maintain an unassuming character", "Exercise discretion in all situations"]}
{"anchor": "How has the practice of spying changed in the digital age?", "targets": ["Greater reliance on technology", "Exploitation of data analytics", "Increased international cooperation", "Quicker access to information", "Strengthened security measures"]}
{"anchor": "What is the most difficult part of the job?", "targets": ["Protecting classified information", "Working in hostile environments", "Maintaining secrecy", "Concealing true identity", "Keeping up with adversaries"]}
{"anchor": "What type of person do you think makes a successful spy?", "targets": ["Adaptable", "Resourceful", "Inquisitive", "Disciplined", "Tenacious"]}
{"anchor": "What motivates you to continue doing your job?", "targets": ["The thrill of adventure", "The chance to make a difference", "The satisfaction of a successful mission", "The adrenaline rush", "The camaraderie with colleagues"]}
{"anchor": "How did you become a spy in the first place?", "targets": ["I was recruited by an agency", "I was identified for my skills", "I developed an interest myself", "I got a lucky break", "I inherited the profession"]}
{"anchor": "How do you maintain the secrecy surrounding your profession?", "targets": ["By staying off the radar", "By using aliases", "By never revealing true identity", "By using cover stories", "By leaving no trace"]}
{"anchor": "What is the most rewarding part of your job?", "targets": ["Unveiling secrets", "Overcoming impossible odds", "Establishing relationships", "Succeeding in a mission", "Making a significant impact"]}
{"anchor": "What are the most important traits for a successful spy?", "targets": ["Discernment", "Adaptability", "Creativity", "Resilience", "Courage"]}
{"anchor": "How does your job require you to think differently?", "targets": ["Making connections", "Analyzing patterns", "Considering consequences", "Formulating strategies", "Taking risks"]}
{"anchor": "What have been the most difficult situations you have had to navigate as a spy?", "targets": ["Losing cover", "Operating in hostile environments", "Risking personal safety", "Deceiving potential targets", "Avoiding detection"]}
{"anchor": "If you could share one tip to spies-in-training, what would it be?", "targets": ["Remain vigilant", "Maintain situational awareness", "Exercise discretion", "Think on your feet", "Always have a back-up plan"]}
{"anchor": "What would you do differently if you could go back and start from the beginning?", "targets": ["Be more prepared", "Take more risks", "Exercise more caution", "Develop more connections", "Take more initiative"]}
{"anchor": "How do you remain undetected while carrying out your mission?", "targets": ["Stay under the radar", "Utilize camouflage techniques", "Go unnoticed in crowds", "Dress in disguise", "Cover your tracks"]}
{"anchor": "What are the most valuable elements of espionage?", "targets": ["Intelligence", "Preparation", "Discipline", "Deception", "Adaptation"]}
{"anchor": "What advice would you give someone who is about to embark on their first mission?", "targets": ["Remain focused", "Keep an open mind", "Stay calm", "Listen carefully", "Have an escape plan"]}
{"anchor": "What is the most important thing you have learned so far in your career?", "targets": ["Adaptability", "Keeping my composure", "Asking the right questions", "Knowing who to trust", "Developing a keen sense of observation"]}
{"anchor": "How long have you been undercover?", "targets": ["3 months", "6 months", "9 months", "1 year", "5 years"]}
{"anchor": "What are your plans if the mission fails?", "targets": ["Retreat", "Reformulate", "Reassess", "Reevaluate", "Regroup"]}
{"anchor": "What type of disguises have you used?", "targets": ["Wig and fake beard", "Fake moustache and glasses", "Wheelchair and cane", "Bald head and fake goatee", "Eyepatch and fake earring"]}
{"anchor": "What is the first thing you think about when going into a mission?", "targets": ["Staying focused", "Keeping calm", "Knowing my limitations", "Maintaining secrecy", "Staying aware of my surroundings"]}
{"anchor": "Do you have any secret identities?", "targets": ["Yes", "No", "Several", "Not anymore", "Just this one"]}
{"anchor": "How much do you know about espionage?", "targets": ["Not much", "A lot", "A decent amount", "I have experience in the field", "I'm an expert"]}
{"anchor": "Have you ever been to a foreign country?", "targets": ["Yes", "No", "Several times", "Never", "Just once"]}
{"anchor": "Do you have any special training or certifications?", "targets": ["Yes", "No", "In self-defense", "In special operations", "In surveillance"]}
{"anchor": "What do you value more – safety or freedom?", "targets": ["Safety", "Freedom", "Both equally", "Depends on the situation", "Neither"]}
{"anchor": "How many hours of sleep do you usually get?", "targets": ["5-6", "8-9", "6-7", "10-11", "Enough to stay alert and make sure the job gets done"]}
{"anchor": "Have you ever used a weapon in combat?", "targets": ["Yes", "No", "Firearms", "Blades", "All sorts of different tools"]}
{"anchor": "What have you done that you are most proud of?", "targets": ["Being able to use my skills to make an impact", "Working with a team and helping develop a successful plan", "Serving my country in a meaningful way", "Carrying out a mission without anyone detecting me", "Moving on from difficult times and finding a way to thrive"]}
{"anchor": "What kind of training do you have?", "targets": ["Special operations training", "Counterintelligence", "Self defense", "Tactical skill set", "Surveillance techniques"]}
{"anchor": "What are some techniques you use to avoid detection?", "targets": ["Camouflage", "Staying in shadows", "Changing hairstyles", "Relying on intuition", "Utilizing distractions and disguises"]}
{"anchor": "Do you have any family?", "targets": ["Yes", "No", "Not many", "I'm a sole survivor", "I don't want to talk about my family"]}
{"anchor": "Have you ever flown a plane?", "targets": ["Yes", "No", "I haven't had the opportunity yet", "Not for a few years", "It's one of my favorite hobbies"]}
{"anchor": "What is the most dangerous mission you have been on?", "targets": ["Infiltrating an enemy base", "Gathering intel in a hostile zone", "Escaping a high-security prison", "Going undercover in a foreign city", "Interrogating a suspicious individual"]}
{"anchor": "Are you part of a covert organization?", "targets": ["Yes", "No", "I'm not allowed to say", "That's classified", "It's a need to know basis"]}
{"anchor": "Do you carry any weapons?", "targets": ["Yes", "No", "It depends on the situation", "Only for when I'm on a mission", "It's necessary for the job"]}
{"anchor": "Have you ever been undercover?", "targets": ["Yes", "No", "Multiple times", "That was my specialty", "I blend in easily"]}
{"anchor": "Can you use a computer?", "targets": ["Yes", "No", "I can hack into networks", "I'm an expert", "I'm a tech savvy agent"]}
{"anchor": "What types of missions have you been on?", "targets": ["Gathering information", "Retrieving lost items", "Interrogating suspects", "Taking out a target", "Infiltrating secured areas"]}
{"anchor": "How do you stay informed?", "targets": ["By networking", "By staying up-to-date on news", "By contacts in the field", "By talking to people on the street", "By tapping into surveillance technology"]}
{"anchor": "What are your strengths?", "targets": ["I'm quick on my feet", "I'm able to think strategically", "I'm an expert in hand-to-hand combat", "I'm a master of disguise", "I'm an adept expert in technologies"]}
{"anchor": "What was the most difficult mission you were on?", "targets": ["Taking out a high-profile target", "Infiltrating a guarded facility", "Escaping a bind with enemy forces", "Interrogating a hostile individual", "Recruiting a double agent in a hostile environment"]}
{"anchor": "Have you ever been on a mission abroad?", "targets": ["Yes", "No", "Frequently", "I travel a lot", "I've been to places you've never heard of"]}
{"anchor": "What would you do if someone discovered your identity?", "targets": ["Vanish", "Go into hiding", "Rely on my network of contacts", "Act first, think later", "Escape the situation without leaving a trace"]}
{"anchor": "What was the toughest assignment you ever faced?", "targets": ["Infiltrating a heavily guarded facility", "Going undercover in a hostile territory", "Gathering intelligence from a rival organization", "Taking out a high-profile target", "Interrogating a dangerous suspect"]}
{"anchor": "How do you handle betrayal?", "targets": ["Discretely", "Strategically", "With a cool head", "Swiftly", "Ruthlessly"]}
{"anchor": "Are you familiar with any kinds of martial arts?", "targets": ["Yes", "No", "A few", "It's part of my training", "I'm a master of several styles"]}
{"anchor": "How do you protect confidential information?", "targets": ["Strict protocols", "Encryption", "Strategy", "Secure networks", "Codes and ciphers"]}
{"anchor": "Are you part of a larger network?", "targets": ["Yes", "No", "Partially", "It's a need to know basis", "Only when I'm on a mission"]}
{"anchor": "Are you able to remain calm in fast-moving situations?", "targets": ["Yes", "No", "It depends", "I'm usually the coolest person in the room", "I can stay focused under pressure"]}
{"anchor": "Do you have any close allies?", "targets": ["Yes", "No", "On occasion", "When needed", "It's a tight knit group"]}
{"anchor": "What is the most exotic thing you have ever done?", "targets": ["Paragliding in Peru", "Camel riding in Jordan", "Hot air ballooning in Turkey", "Exploring the ancient ruins of Rome", "Bathing in the Dead Sea"]}
{"anchor": "How many languages can you speak?", "targets": ["Four", "Five", "Six", "Seven", "Eight"]}
{"anchor": "Do you have any passions or hobbies?", "targets": ["Reading", "Running", "Painting", "Gardening", "Writing"]}
{"anchor": "Are you working on any missions at the moment?", "targets": ["Yes", "No", "It's classified", "Undercover", "Top secret"]}
{"anchor": "What type of gadgets do you have access to?", "targets": ["Laser technology", "Spy cameras", "Voice recorders", "Miniaturized surveillance equipment", "Electronic tracking devices"]}
{"anchor": "Do you have a code name?", "targets": ["Yes", "No", "Don't know", "My code name is 'Omega'", "Top Secret"]}
{"anchor": "Do you know how to defend yourself in close combat?", "targets": ["Yes", "No", "I'm training to", "It's a work in progress", "I'm a black belt"]}
{"anchor": "How do you stay invisible to the enemy?", "targets": ["Research the area", "Infrared technology", "Night vision goggles", "Stealth suits", "Use natural camouflage"]}
{"anchor": "How often do you change your identity?", "targets": ["Occasionally", "Once a year", "Every six months", "Never", "Depends on the situation"]}
{"anchor": "What is your favorite action movie?", "targets": ["Die Hard", "Mission: Impossible", "The Avengers", "Fast & Furious", "James Bond"]}
{"anchor": "What codes and ciphers do you know?", "targets": ["Morse Code", "Vigenere Cipher", "Enigma Machine", "Book Cipher", "SHA 256 Cryptosystem"]}
{"anchor": "Do you prefer working alone or in a team?", "targets": ["Alone", "Team", "It depends on the situation", "I prefer leading a team", "I like both"]}
{"anchor": "How experienced are you in using firearms?", "targets": ["Expert", "Skilled", "Competent", "Entry-level", "I don't know how to use them"]}
{"anchor": "Do you have any required gadgets in your mission?", "targets": ["Yes", "No", "A phone", "A recording device", "GPS tracker"]}
{"anchor": "What is the craziest situation you've ever been in?", "targets": ["Parachuting from an airplane", "Doing a high-speed car chase", "Fighting off an armed assailant", "Feigning insanity to escape from prison", "Hiding in a closet to avoid detection"]}
{"anchor": "How do you disguise yourself when on a mission?", "targets": ["Wearing a disguise", "Changing my hairstyle", "Using aliases", "Relying on contacts", "Creating a false background story"]}
{"anchor": "Are you a good liar?", "targets": ["Yes", "No", "Most of the time", "It depends on the situation", "Practice makes perfect"]}
{"anchor": "Are you trained in any type of martial arts?", "targets": ["Yes", "No", "I've studied krav maga", "I know aikido", "I specialize in taekwondo"]}
{"anchor": "What type of computers and IT do you understand?", "targets": ["Basic", "Intermediate", "Advanced", "I'm a programmer", "I'm a hacker"]}
{"anchor": "Do you have any aliases or fake names?", "targets": ["Yes", "No", "A couple", "A few", "My alias is John Smith"]}
{"anchor": "Are you familiar with modern surveillance techniques?", "targets": ["Yes", "No", "Somewhat", "I know the basics", "I'm a surveillance expert"]}
{"anchor": "Do you ever rely on luck in a mission?", "targets": ["Yes", "No", "Sometimes", "Only when necessary", "Luck is when preparation meets opportunity"]}
{"anchor": "Are you ever asked to work in other countries?", "targets": ["Yes", "No", "Occasionally", "Frequently", "When it's necessary"]}
{"anchor": "Can you blend in to any crowd?", "targets": ["Yes", "No", "It depends on the situation", "I'm good at disappearing", "I'm a master at blending in"]}
{"anchor": "What military tactic do you deploy the most?", "targets": ["Stealth", "Surprise", "Maneuvering", "Wearing down the enemy", "Deception"]}
{"anchor": "How often do you travel on secret missions?", "targets": ["Depends on the assignment", "Daily", "Once a week", "Every other month", "Rarely"]}
{"anchor": "Do you have any special talents or skills?", "targets": ["Yes", "No", "A few", "Cheating at cards", "Mimicking accents"]}
{"anchor": "Do you have any special weapons or gadgets?", "targets": ["Yes", "No", "A few", "A concealed knife", "A self-defense device"]}
{"anchor": "How good are you at interrogation?", "targets": ["Expert", "Skilled", "Competent", "Entry-level", "I leave that to the professionals"]}
{"anchor": "What kind of disguise skills do you possess?", "targets": ["Masterful makeup", "Knowledge of clothing", "Wig and hairpieces", "Changing body language", "Learning a new accent"]}
{"anchor": "What do you do when you have no leads?", "targets": ["Rely on my experience", "Follow up on hunches", "Re-examine the evidence", "Research my target", "Talk to trusted contacts"]}
{"anchor": "Are you familiar with the dark web?", "targets": ["Yes", "No", "Somewhat", "I know the basics", "I'm an expert"]}
{"anchor": "Are you working on any long-term missions?", "targets": ["Yes", "No", "A few", "It's a constant battle", "I'm always on the lookout for the next new thing"]}
{"anchor": "What languages can you speak?", "targets": ["Spanish", "Russian", "Mandarin", "French", "German"]}
{"anchor": "How tough is your training?", "targets": ["Extremely tough", "It's harder than it looks", "Unbearable at times", "Surprisingly manageable", "It requires a lot of dedication"]}
{"anchor": "Have you ever worked on a classified mission?", "targets": ["Yes", "No", "Not recently", "That's still on a need-to-know basis", "It's a secret I'm not at liberty to share"]}
{"anchor": "Are you involved in counterintelligence?", "targets": ["Yes", "No", "I don't know", "I'm not sure", "That's for another line of work"]}
{"anchor": "Have you ever killed someone?", "targets": ["No", "Yes", "Not in cold blood", "That's a dark secret", "I don't even want to think about it"]}
{"anchor": "What is your best weapon of choice?", "targets": ["Firearm", "Martial arts", "Knife", "Vehicle", "Explosives"]}
{"anchor": "Are you ever confronted with difficult ethical dilemmas?", "targets": ["Yes", "No", "Sometimes", "It depends on the situation", "It's a part of the job"]}
{"anchor": "How much surveillance do you carry out?", "targets": ["24/7 Surveillance", "As much as possible", "With pinpoint accuracy", "As much as required", "Undercover mostly"]}
{"anchor": "What technology do you use in the field?", "targets": ["Satellite imagery", "Infrared cameras", "High-tech audio devices", "Specialized computers", "Enhanced communication devices"]}
{"anchor": "Are you ever in physical danger?", "targets": ["Yes", "No", "Sometimes", "It depends", "I'm a professional risk-taker"]}
{"anchor": "How do you handle high-pressure situations?", "targets": ["With calm and precision", "I focus on the task at hand", "With a razor-sharp focus", "With confidence", "One breath at a time"]}
{"anchor": "Have you ever been arrested?", "targets": ["No", "Yes", "I've been detained", "Undercover", "Nothing sticks"]}
{"anchor": "What is the strangest job you have done?", "targets": ["I can't tell you", "It's classified", "It was incredibly strange", "I'm not at liberty to disclose", "Nothing I'd care to repeat"]}
{"anchor": "Are you an expert in disguise and deception?", "targets": ["Yes", "No", "It's something I am always improving", "I specialize in misdirection", "Blending in is my specialty"]}
{"anchor": "What situations have you had to handle on the job?", "targets": ["Dangerous enemies", "Hostage crises", "High-stakes negotiations", "Top-secret missions", "Escaping from tight spots"]}
{"anchor": "Have you ever experienced corruption on the job?", "targets": ["Yes", "No", "Not as much lately", "It's always a risk", "More than I'm comfortable with"]}
{"anchor": "What is the most extreme situation you have ever faced?", "targets": ["A nearly impossible hostage rescue", "Gathering intelligence on a criminal underworld", "An international heist gone wrong", "Tracking down a serial killer", "Dueling with a double agent in hand-to-hand combat"]}
{"anchor": "What is the most difficult part of being a spy or secret agent?", "targets": ["Staying one step ahead of the enemy", "Keeping your identity a secret", "Maintaining mental and physical strength", "Knowing when to take risks and when to play it safe", "Learning to trust even in difficult and uncertain situations"]}
{"anchor": "How has your training changed over the years?", "targets": ["Technology has become a more important component", "It's become more physically demanding", "Mental and tactical strategies are more emphasized", "It's become more specialized", "Coordinated international operations require more comprehensive strategies"]}
{"anchor": "How do you gather intelligence without being detected?", "targets": ["I use my surroundings to my advantage", "I develop reliable contacts and sources", "I engineer stealth operations", "I'm very skilled at staying undetected", "By blending in and being persuasive"]}
{"anchor": "How is technology used in the field?", "targets": ["It's used to gain access to secured information", "It helps to monitor and track difficult targets", "It helps to stay connected while undercover", "It helps to identify potential threats", "To gather intelligence in dangerous situations"]}
{"anchor": "Do you carry concealed weapons?", "targets": ["Yes", "No", "It depends on the mission", "Only when necessary", "I do not go anywhere unarmed"]}
{"anchor": "Do you ever work with partner agents?", "targets": ["Yes", "No", "Sometimes", "It depends on the mission", "More often than not"]}
{"anchor": "How do you create effective strategies against difficult opponents?", "targets": ["Through meticulous planning", "By using superior tactics", "By understanding the situation and environment", "Adaptability and resilience", "By relying on training and years of experience"]}
{"anchor": "If you were sent on a mission, which would you choose?", "targets": ["To protect someone", "To retrieve information", "To gather intelligence", "To overthrow an oppressive regime", "To rescue hostages"]}
{"anchor": "What type of weapons are you trained to operate?", "targets": ["Pistols", "Rifles", "Sniper rifles", "Submachine guns", "Missiles"]}
{"anchor": "Have you ever been in a car chase?", "targets": ["Yes", "No", "Almost", "I prefer the bus", "All the time"]}
{"anchor": "What languages have you studied?", "targets": ["French", "Spanish", "German", "Chinese", "Russian"]}
{"anchor": "If you had to disguise yourself, which outfit would you choose?", "targets": ["Business suit", "Disguise as a laborer", "Military uniform", "Formal dress", "Street clothing"]}
{"anchor": "What was the most unusual mission you have undertaken?", "targets": ["Investigating a supposed supernatural occurrence", "Infiltrating a secret society", "Rescuing a kidnapped dignitary", "Finding a lost artifact", "Tracing a drug smuggling ring"]}
{"anchor": "Are you a member of a special agency or team?", "targets": ["Yes", "No", "Maybe", "It's classified", "Not at the moment"]}
{"anchor": "Are you more of an observer or a planner?", "targets": ["Observer", "Planner", "Both", "Neither", "It depends on the situation"]}
{"anchor": "What type of weapons do you know how to use?", "targets": ["Gun", "Knife", "Crossbow", "Firearm", "Martial Arts"]}
{"anchor": "What motivates you most in your job?", "targets": ["Making a difference", "Serving the greater good", "Having the opportunity to use my skills and knowledge", "Advancing my career", "Doing something exciting and challenging"]}
{"anchor": "Are you afraid of death?", "targets": ["No", "Yes", "I try not to think about it", "It's a fact of life", "I'm only human"]}
{"anchor": "Are there any unsolved mysteries that you are especially interested in?", "targets": ["Yes", "No", "Maybe", "I can't talk about it", "It's classified"]}
{"anchor": "What is the biggest challenge you have faced as a secret agent?", "targets": ["Staying in character", "Maintaining my cover", "Keeping secrets", "Balancing my personal life with being an agent", "Staying one step ahead of the enemy"]}
{"anchor": "Have you ever been captured?", "targets": ["Yes", "No", "Not yet", "I escaped", "It's classified"]}
{"anchor": "If you had to choose between loyalty and freedom, which would you choose?", "targets": ["Freedom", "Loyalty", "Both", "Neither", "It depends on the situation"]}
{"anchor": "What kind of information do you need to be successful as a secret agent?", "targets": ["Knowledge of the enemy", "Tools of the trade", "Access to resources", "Advanced skill sets", "Connections"]}
{"anchor": "Do you ever feel overwhelmed by the amount of information you have to process?", "targets": ["Yes", "No", "Sometimes", "Not often", "It's part of the job"]}
{"anchor": "Are there any assignments you are especially proud of?", "targets": ["Yes", "No", "A few", "Several", "Can't talk about it"]}
{"anchor": "How do you deal with stressful situations?", "targets": ["Deep breathing and meditation", "Taking breaks", "Connecting with my team", "Channeling my energy into problem solving", "Thinking of a happy place"]}
{"anchor": "Would you be willing to sacrifice yourself if needed?", "targets": ["Yes", "No", "It depends", "It's a last resort", "Only for a greater good"]}
{"anchor": "On a scale of 1-10, rate your level of bravery?", "targets": ["9", "8", "7", "6", "10"]}
{"anchor": "Are you good at reading people?", "targets": ["Yes", "No", "I can tell if something is off", "It depends on the circumstances", "I trust my gut"]}
{"anchor": "Are there any other agents you have worked closely with?", "targets": ["Yes", "No", "A few", "Several", "Can't talk about it"]}
{"anchor": "Do you see yourself in the same profession in 5 years?", "targets": ["Yes", "No", "Maybe", "I'm not sure", "It depends on the situation"]}
{"anchor": "Are you comfortable working alone?", "targets": ["Yes", "No", "Sometimes", "It depends", "I prefer working with a team"]}
{"anchor": "What is one thing that you always keep in mind when you are on a mission?", "targets": ["My training", "The mission objectives", "My team", "Potential risks", "Keeping my cover"]}
{"anchor": "What is the most dangerous mission you have undertaken?", "targets": ["Infiltrating an enemy stronghold", "Escaping enemy territory", "Gathering intelligence in a hostile country", "Tracking arms dealers", "Disrupting a criminal network"]}
{"anchor": "How do you handle unexpected changes or complications?", "targets": ["Take a step back", "Re-evaluate the situation", "Adjust the plan", "Keep a cool head", "Make the necessary changes"]}
{"anchor": "Did you ever receive special recognition for any of your efforts?", "targets": ["Yes", "No", "A few times", "Can't talk about it", "It's classified"]}
{"anchor": "Are you motivated by a sense of justice or personal success?", "targets": ["Justice", "Personal success", "Both", "Neither", "It depends on the situation"]}
{"anchor": "What do you know about the dark web?", "targets": ["I can access most of it", "I'm familiar with its dangers", "I know how to use it safely", "I've never been to the dark web", "It's just a normal part of my job"]}
{"anchor": "Do you have any undercover contacts?", "targets": ["Yes", "Not anymore", "I have a few", "I'm always looking for more", "Not that I'm aware of"]}
{"anchor": "How do you handle dangerous situations?", "targets": ["Calmly and professionally", "Quickly and decisively", "By thinking through my options", "With an escape plan in mind", "With awareness and confidence"]}
{"anchor": "How often do you use a disguise?", "targets": ["Regularly", "Rarely", "Occasionally", "When I need to", "Never"]}
{"anchor": "What technique do you use to gather intelligence?", "targets": ["Traditional investigation methods", "Surveillance", "Data mining", "Tracking devices", "Interviews"]}
{"anchor": "What is your preferred method for covert communication?", "targets": ["Encrypted emails", "Secret text messages", "Reported phone calls", "Written letters", "Virtual meetings"]}
{"anchor": "How do you deal with stress?", "targets": ["Meditation", "Exercise", "Music", "Reading", "Time with friends"]}
{"anchor": "Do you have any special training?", "targets": ["Yes", "No", "Some", "I'm self-taught", "I had to be certified"]}
{"anchor": "What won't you do while on the job?", "targets": ["Break the law", "Put another agent in danger", "Compromise my morals", "Engage in unnecessary violence", "Take shortcuts"]}
{"anchor": "What methods do you use to build trust?", "targets": ["Honesty", "Respect", "Listening", "Supporting", "Responsiveness"]}
{"anchor": "How do you react when the mission goes wrong?", "targets": ["Analyze the situation", "Stay brave and focused", "Quickly adapt my plan", "Re-evaluate my goals", "Take a step back and regroup"]}
{"anchor": "What do you consider to be the most dangerous operation you have completed?", "targets": ["Infiltrating a foreign government", "Disarming a bomb", "Exposing a drug cartel", "Taking down a terrorist cell", "Uncovering organized crime networks"]}
{"anchor": "What measures do you take to remain undetected?", "targets": ["Blend in with the crowd", "Avoid contact", "Try to be invisible", "Stay safe in the shadows", "Change my routine"]}
{"anchor": "How do you recognize potential risks?", "targets": ["Experience", "Research", "Awareness", "Gut feeling", "Predictive analysis"]}
{"anchor": "What do you think is the most difficult part of being a spy?", "targets": ["Maintaining professionalism", "Dealing with unethical situations", "Keeping secrets", "Staying ahead of the enemy", "Enduring the loneliness"]}
{"anchor": "How do you build relationships with contacts?", "targets": ["Through shared interests", "Mutual trust", "Regular meetings", "Open communication", "Respect for each other"]}
{"anchor": "How do you maintain confidentiality?", "targets": ["use secure messaging technology", "use encrypted files", "never store sensitive information online", "always erase evidence", "keep your story straight"]}
{"anchor": "Do you use any high-tech gadgets in your work?", "targets": ["Yes", "No", "Occasionally", "Only when necessary", "As part of my toolbox"]}
{"anchor": "What have you learned about espionage?", "targets": ["Patience is key", "Always stay professional", "Be willing to take risks", "Honesty is essential", "Permanence is impossible"]}
{"anchor": "What tips would you give to a rookie agent?", "targets": ["Prepare thoroughly", "Stay focused on the mission", "Think outside the box", "Trust your gut instinct", "Pay attention to detail"]}
{"anchor": "How do you stay motivated for long-term operations?", "targets": ["Set achievable goals", "Reflect on successes", "Stay connected to the team", "Celebrate milestones", "Keep a positive outlook"]}
{"anchor": "What do you do when faced with a challenging situation?", "targets": ["Take a step back", "Reframe the problem", "Brainstorm solutions", "Consider all available evidence", "Ask for help"]}
{"anchor": "What have you learned about yourself as a spy?", "targets": ["I can handle pressure", "I'm resilient", "I'm quick on my feet", "I work better under the radar", "I have a natural knack for problem-solving"]}
{"anchor": "What do you find to be the most rewarding part of your job?", "targets": ["Accomplishing missions", "Making a difference", "Being part of a team", "Seeing results", "Knowing I'm making a contribution to global security"]}
{"anchor": "What type of organization do you work with?", "targets": ["Government", "Private", "Non-profit", "Political", "Military"]}
{"anchor": "Are you familiar with encryption technology?", "targets": ["Yes", "No", "A little bit", "My job involves encryption", "I'm still learning about it"]}
{"anchor": "Has your work taken you to other countries?", "targets": ["Yes", "No", "A few", "Many", "All around the world"]}
{"anchor": "At what age did you start your secret agent training?", "targets": ["18", "20", "21", "24", "26"]}
{"anchor": "Are you able to handle pressure situations?", "targets": ["Yes", "Not really", "With some guidance", "Depends on the situation", "It depends on the stakes"]}
{"anchor": "What career field did you study?", "targets": ["Psychology", "International Relations", "Computer Science", "Intelligence", "Engineering"]}
{"anchor": "How do you handle stressful and dangerous scenarios?", "targets": ["By staying calm and focused", "Through practice and preparation", "By taking deep breaths", "By being agile and aware", "With quick-thinking and problem-solving"]}
{"anchor": "In what ways has your profession affected your home life?", "targets": ["I’ve had to become more secretive", "I’m often unavailable", "My life is constantly changing", "I often have to travel", "I am more alert and vigilant"]}
{"anchor": "Are you comfortable in extreme conditions?", "targets": ["Yes", "Not really", "Somewhat", "Only when I have to be", "It depends on the situation"]}
{"anchor": "What methods do you use to protect yourself?", "targets": ["Strategy", "Countermeasures", "Stealth", "Misdirection", "Security Protocols"]}
{"anchor": "How do you stay informed about current events?", "targets": ["Reading news articles", "Following reliable sources on social media", "Listening to podcasts", "Watching documentaries", "Networking with knowledgeable people"]}
{"anchor": "What have you learned about human behavior?", "targets": ["It is unpredictable", "People can be easily manipulated", "It is complex and dynamic", "Everyone has different motivations", "How people interact can be revealing"]}
{"anchor": "Do you prefer working on your own or with a team?", "targets": ["Team", "Solo", "Both", "Depends on the task", "It varies"]}
{"anchor": "Do you believe that you can make a difference in the world?", "targets": ["Yes", "No", "Most of the time", "Depends on the circumstance", "It depends on the situation at hand"]}
{"anchor": "Are you comfortable speaking to large crowds?", "targets": ["Yes", "No", "Occasionally", "Somewhat", "I prefer to not speak in front of crowds"]}
{"anchor": "What do you consider your biggest weakness?", "targets": ["Procrastination", "Impulsive decisions", "Indecision", "Doubting myself", "Misplacing my focus"]}
{"anchor": "Are you able to think on your feet?", "targets": ["Yes", "Not always", "Most of the time", "Occasionally", "In certain situations"]}
{"anchor": "How do you handle failure?", "targets": ["Learn from it", "Move on", "Make changes", "Reframe It", "Use it as motivation"]}
{"anchor": "How do you respond when challenged?", "targets": ["With poise", "With confidence", "With a plan", "With intelligence", "With authenticity"]}
{"anchor": "What do you think sets you apart from other spies?", "targets": ["My attention to detail", "My dedication", "My problem-solving skills", "My patience and perseverance", "My determination"]}
{"anchor": "What intrigues you about the unknown?", "targets": ["The mystery", "The possibility", "The thrill", "The challenge", "The adventure"]}
{"anchor": "What advice would you give to those interested in the spy field?", "targets": ["Stay focused", "Be prepared", "Be observant", "Stay diligent", "Take initiative"]}
{"anchor": "What methods do you use to eliminate threats?", "targets": ["Knowledge", "Strategy", "Adaptability", "Countermeasures", "Disruptive Tactics"]}
{"anchor": "Are you able to keep secrets and maintain confidentiality?", "targets": ["Yes", "Most of the time", "Usually", "I strive to", "Adapt to the situation"]}
{"anchor": "What has been your biggest challenge working in politics?", "targets": ["Fighting special interests", "Making sure my voice is heard on issues I care about", "Having people listen to me", "Gaining re-election", "Maintaining public trust"]}
{"anchor": "Are you involved in any local political organizations?", "targets": ["Yes", "No", "Occasionally", "Working behind the scenes", "Yes, but I am not an official member"]}
{"anchor": "What do you think needs to be done to improve the political system?", "targets": ["More transparency", "Term Limits", "Campaign finance reform", "More voter participation", "Enhance communication and understanding between citizens, politicians, and the media"]}
{"anchor": "What is the most rewarding experience you have had while in office?", "targets": ["Establishing legislation that aligned with my core beliefs", "Helping constituents and seeing the impact of my decisions", "Experiencing the power of collective action", "Seeing the people I represent come together to create meaningful change", "Working with my colleagues on bipartisan initiatives"]}
{"anchor": "How much control do you have over what policies are implemented?", "targets": ["I have a lot of influence", "It depends on the issue", "I have limited control", "I have some control", "I'm usually just following the party line"]}
{"anchor": "How did you get interested in politics?", "targets": ["Through my parents", "Joining Model United Nations", "My college classes on the subject", "Reading political books", "Watching political documentaries"]}
{"anchor": "Do you ever feel like politics is too much of a game?", "targets": ["Yes", "No", "Sometimes", "Not usually", "It depends on the situation"]}
{"anchor": "What is the most difficult part of your current job?", "targets": ["Keeping people motivated", "Trying to get everyone to agree", "Gathering enough votes", "Learning the rules and laws", "Dealing with the media"]}
{"anchor": "How do you stay informed on current events?", "targets": ["Reading the news", "Keeping up with the blogs", "Watching the news or talking to people", "Following political accounts on social media", "Consulting think tanks"]}
{"anchor": "Do you think of yourself as a public servant?", "targets": ["Yes", "No", "I'm not sure", "I try to serve public interest", "I'm just doing my job"]}
{"anchor": "What inspired you to go into politics?", "targets": ["The promise of improving societal problems", "To inspire others", "To bring about change", "To make a difference", "To make money"]}
{"anchor": "What do you think of the current president?", "targets": ["I'm not a fan", "I think he's doing a good job", "He's making some mistakes", "He's doing his best", "He's making history"]}
{"anchor": "What's the most challenging part of working in government?", "targets": ["Getting people to agree", "Keeping up with the news cycle", "Constant budget constraints", "Working within the system", "Too much bureaucracy"]}
{"anchor": "Do you think your decisions have an impact on the world?", "targets": ["Yes", "No", "Sometimes", "Yes, but small", "Yes, and it’s growing"]}
{"anchor": "Do you enjoy working in the government or in politics?", "targets": ["Yes", "No", "It has its ups and downs", "It's a challenge", "It's an adventure"]}
{"anchor": "Do you think the government is too big?", "targets": ["Yes", "No", "Its size depends on certain situations", "It needs to be more selective", "It's still too small for what it needs to do"]}
{"anchor": "How do you balance representing the interests of your constituents with the interests of the other party?", "targets": ["By focusing on the common goals that both sides share", "By trying to temper party-line positions", "By listening to the voices of all involved", "By working on compromise solutions", "By finding middle ground where possible"]}
{"anchor": "What do you think of the current political climate?", "targets": ["It's divided", "It's chaotic", "It's exciting", "It's energizing", "It's in flux"]}
{"anchor": "What do you think is the biggest challenge facing the government today?", "targets": ["Climate change", "Income inequality", "Healthcare reform", "Immigration reform", "Socialistic ideals"]}
{"anchor": "What is the most difficult part about working in the government or in politics?", "targets": ["Dealing with different people and interests", "Trying to create compromise", "Not having enough money to do things you care about", "Balancing different perspectives", "Receiving criticism from the public"]}
{"anchor": "How has the pandemic changed how you approach your role in politics?", "targets": ["It has made it more difficult to connect with my constituents", "I have had to put a more creative approach to problem-solving", "I now understand the importance of listening more carefully to constituents", "It has highlighted the need for stronger policies", "It has made it easier to connect with other politicians online"]}
{"anchor": "What are the most important values that you believe should be part of any political system?", "targets": ["Respect of diversity", "Equality and justice", "Transparency and accountability", "Participation and inclusion", "Honesty and integrity"]}
{"anchor": "What do you think of the current state of democracy?", "targets": ["It needs to be improved", "It could be better", "It's not perfect, but it works", "It always has room to grow", "We have a long way to go"]}
{"anchor": "What do you think of the way the government intervenes in private business?", "targets": ["It's necessary", "It's intrusive", "It's beneficial", "It's damaging", "It's a necessary evil"]}
{"anchor": "What policies would you like to see the government implement?", "targets": ["Universal basic income", "Social Security reform", "Expanded healthcare coverage", "Reform of the electoral college", "National minimum wage"]}
{"anchor": "In your opinion, what are the greatest challenges facing the government?", "targets": ["Budget deficits", "Climate change", "Rising inequality", "Social unrest", "Cyber security threats"]}
{"anchor": "Do you think the government could do more to address the problems of poverty?", "targets": ["Yes", "No", "It's already doing enough", "It's not doing enough", "It needs to prioritize its spending"]}
{"anchor": "Which international issues do you think the government should focus on?", "targets": ["Climate change", "Disaster relief", "Terrorism", "Human rights violations", "Refugees and migration"]}
{"anchor": "What is your favorite part of the job?", "targets": ["Power", "Making Decisions", "Helping people", "Making connections", "Seeing results"]}
{"anchor": "What was the most difficult decision you have ever made in the government?", "targets": ["Sending troops to war", "Voting on legislation with far reaching consequences", "Starting a financial rescue plan", "Cutting healthcare budgets", "Advocating for laws with unpopular opinions"]}
{"anchor": "What are your thoughts on the current political climate?", "targets": ["It's a mess", "It's exciting", "It's unpredictable", "It's unpredictable and frustrating", "It's depressing"]}
{"anchor": "What do you think can be done to improve government efficiency?", "targets": ["Increasing the use of technology", "Reducing bureaucracy", "Changing the budgeting process", "Improving communication between parties", "Streamlining regulations"]}
{"anchor": "What kind of challenges have you faced as a politician?", "targets": ["Winning re-election", "Getting people to approve of your policies", "Balancing constituents and ideology", "Getting support from the opposition", "Dealing with a divided public"]}
{"anchor": "How do you handle criticism?", "targets": ["Listen and accept it", "Address it", "Respond and explain", "Challenge it", "Don't let it affect me"]}
{"anchor": "What would you say is the most important lesson you have learned in politics?", "targets": ["Compromise", "Stay humble", "Think before you act", "Stay positive", "Listen to your constituents"]}
{"anchor": "Do you have any advice for young people wanting to enter politics?", "targets": ["Get involved in your local community", "Educate yourself and build a base of knowledge", "Network and make contacts in the field", "Have passion and dedication", "stay open to new perspectives and possibilities"]}
{"anchor": "What do you think sets you apart from other politicians?", "targets": ["My commitment to keep promises", "My passion for reform", "My ability to bring people together", "My dedication to my values", "My negotiation skills"]}
{"anchor": "What do you think of the current political landscape?", "targets": ["It needs to change", "It could use some improvement", "It's better than it's been", "It's inspiring", "It's inspiring and daunting"]}
{"anchor": "Do you think politics is about compromise or about sticking to one's ideals?", "targets": ["Both", "It's about compromise", "It's about principles", "It depends on the situation", "It's about finding a balance"]}
{"anchor": "How does the experience of working within the government differ from the way politics is depicted in the media?", "targets": ["It's slower and more bureaucratic", "It's more nuanced", "It's often misrepresented", "It's more civil", "It's more team-oriented"]}
{"anchor": "Do you ever find it difficult to make a decision between what is right ethically and what is right politically?", "targets": ["Yes", "No", "It depends", "It's a constant struggle", "It's sometimes hard, but it can also be rewarding"]}
{"anchor": "Who do you look to for inspiration when faced with a difficult political decision?", "targets": ["My colleagues", "Those directly affected by the decision", "History", "Past leaders", "My faith"]}
{"anchor": "How do you make sure everyone is represented in policy decisions?", "targets": ["Listen to the different perspectives", "Gather input from affected groups", "Settle on compromise solutions", "Take into account the potential impacts on all sides", "Ensure a process of accountability and transparency"]}
{"anchor": "Do you ever clash with members of the same political party?", "targets": ["Yes", "No", "Occasionally", "It's rare", "It's inevitable"]}
{"anchor": "How do you handle the pressure of having to make difficult decisions in a short amount of time?", "targets": ["Take a moment to refocus", "Embrace the challenge", "Ask others for advice", "Make an informed decision with the information at hand", "Remember why you're doing this"]}
{"anchor": "Are there any positions within the government that you would be interested in one day?", "targets": ["Yes", "No", "Possibly", "I'm not sure", "It depends"]}
{"anchor": "Are there any political topics that you feel passionately about?", "targets": ["Yes", "No", "It Depends", "I'm passionate about all political topics", "I'm passionate about certain topics"]}
{"anchor": "What is the most important quality a politician must have?", "targets": ["Integrity", "Leadership", "Vision", "Compassion", "Honesty"]}
{"anchor": "How would you rate your own performance in office?", "targets": ["Positively", "Negatively", "Satisfied", "Ambivalent", "Motivated"]}
{"anchor": "Have you ever had to take a stance on an issue that you had doubts about?", "targets": ["Yes", "No", "Occasionally", "Never", "Rarely"]}
{"anchor": "What do you think is the most pressing issue facing your jurisdiction?", "targets": ["Education", "Housing", "Healthcare", "Poverty", "Infrastructure"]}
{"anchor": "Do you think the government should take a bigger role in the lives of citizens?", "targets": ["Yes", "No", "It depends", "The government should only be involved when necessary", "The government should act in people’s best interest"]}
{"anchor": "How do you think history will remember your work in office?", "targets": ["Positively", "Negatively", "Effectively", "Ambivalently", "Innovatively"]}
{"anchor": "How do you feel about the current state of politics?", "targets": ["It's messy and chaotic", "It's inspiring and hopeful", "It's improving", "It is scary", "It's nothing new"]}
{"anchor": "In your opinion, what is the best way to make real change in politics?", "targets": ["Vote", "Engage in civil discourse and dialogue", "Protest and demonstrate", "Talk to your representatives", "Create a grassroots movement"]}
{"anchor": "Are certain political parties more competent than others?", "targets": ["Yes", "No", "It depends", "They're all the same", "Some are better than others"]}
{"anchor": "If you could, what would you do to increase voter turnout?", "targets": ["Expand access to registration and voting through technology", "Automatically register eligible voters", "Increase political education", "Promote civic engagement among young people", "Remove barriers to voting"]}
{"anchor": "What do you think about the current budget process?", "targets": ["It is outdated and inefficient", "It is too complex and cluttered", "It is a necessary part of governing", "It is antiquated and needs reform", "It makes government more accountable"]}
{"anchor": "Do you think money has too much of an influence in politics?", "targets": ["Yes", "No", "It depends", "There is always room for improvement", "Money is essential in the political process"]}
{"anchor": "How do you think the current administration's policies have been viewed by the public?", "targets": ["Polarizing", "Acceptable", "Critically", "Supportive", "Divisive"]}
{"anchor": "How can political leaders collaborate with other countries more effectively?", "targets": ["Utilize technology and digital platforms", "Create international partnerships and agreements", "Host multilateral forums", "Develop mutual understandings and cultural exchanges", "Increase transparency and open communication"]}
{"anchor": "Have the current public health measures had a positive result?", "targets": ["Yes", "No", "It's too early to tell", "There have been both positives and negatives", "Conditions are improving"]}
{"anchor": "What do you think is the most pressing issue in politics right now?", "targets": ["Global warming", "Healthcare", "International security", "Economic inequality", "Political corruption"]}
{"anchor": "What do you think about recent changes to environmental regulations?", "targets": ["They are insufficient", "They are necessary", "They're too extreme", "They're too mild", "They should be stricter"]}
{"anchor": "What do you see as the biggest challenge facing our country today?", "targets": ["Social injustice", "Poverty", "Political extremism", "Political apathy", "Climate change"]}
{"anchor": "What in your opinion, can be done to reduce the effects of income inequality?", "targets": ["Increasing the minimum wage", "Closing tax loopholes", "Increasing social welfare programs", "Establishing universal basic income", "Strengthening worker rights and unionization"]}
{"anchor": "What do you think about the current partisanship in the political system?", "targets": ["It's dangerous and damaging", "It's healthy and necessary", "It's not going away anytime soon", "There are still areas of consensus", "We need to find a balance between two sides"]}
{"anchor": "What do you think about recent legislation addressing racial injustice?", "targets": ["It's not enough", "It's a start", "It's positive", "It's too soon to tell", "It has been too divisive"]}
{"anchor": "Do you think there is enough transparency in the executive branch?", "targets": ["No", "Yes", "It's getting better", "It's not important", "There should be more"]}
{"anchor": "Do think the current election and voting systems are fair?", "targets": ["No", "Yes", "Not completely", "It depends", "They need to be more inclusive"]}
{"anchor": "How has the Executive Branch managed the coronavirus pandemic?", "targets": ["Poorly", "Adequately", "With caution", "Too slowly", "With competence"]}
{"anchor": "What do you think is the best way to reform the healthcare system?", "targets": ["Implement universal healthcare", "Create a public option", "Increase access to preventative care", "Increase oversight and regulation", "Make medication more affordable"]}
{"anchor": "What do you think is the most important skill to develop in order to succeed in politics?", "targets": ["Listening", "Leadership", "Persuasion", "Analytical thinking", "Problem solving"]}
{"anchor": "What do you think is the most important thing a politician needs to do?", "targets": ["Balance interests", "Have integrity", "Represent the people", "Make good decisions", "Think critically"]}
{"anchor": "Is it possible to have an effective government without compromise?", "targets": ["No", "Yes", "It depends", "Not likely", "Maybe, if everyone's interests are considered"]}
{"anchor": "Do you think the current immigration laws are fair?", "targets": ["No", "Yes", "Not completely", "It depends", "They need to be more inclusive"]}
{"anchor": "What do you think of foreign policy?", "targets": ["It needs to be reformed", "It should be based on peaceful solutions", "It needs to be more proactive", "It needs to prioritize diplomatic solutions", "It should be more unilateral"]}
{"anchor": "What would you do to improve the public school system?", "targets": ["Increase government funding", "Improve STEM education", "Refocus school curriculums", "Increase teacher salaries", "Reduce standardized testing"]}
{"anchor": "What do you think has been the biggest political issue in the last decade?", "targets": ["The economy", "Healthcare", "Climate change", "Immigration", "Social inequality"]}
{"anchor": "Have you ever changed your mind because of a debate or argument?", "targets": ["Yes", "No", "Sometimes", "Never", "All the time"]}
{"anchor": "What do you think needs to change to improve the political system?", "targets": ["More transparency", "Increased participation", "More cooperation across parties", "Lobbyist Reform", "Stronger checks and balances"]}
{"anchor": "Is politics an art or a science?", "targets": ["Both", "Neither", "It depends", "Art", "Science"]}
{"anchor": "How do you respond to criticism or opposition?", "targets": ["Calm and level headed", "Defensively", "Confidently", "Aggressively", "Respectfully"]}
{"anchor": "What has been your biggest challenge as a government official?", "targets": ["Figuring out how to get people on board with my policies", "Dealing with the opposition", "Overcoming bureaucracy", "Finding ways to make meaningful change", "Convincing the public that what I'm doing is important"]}
{"anchor": "What was an experience that changed your view of politics?", "targets": ["Meeting people in other countries with different political systems", "Witnessing civil rights abuses", "Realizing the scope of global poverty", "Reviewing case studies of successful policies", "Seeing how much money is wasted in the system"]}
{"anchor": "How have you seen politics changing in the past few years?", "targets": ["It provides more opportunities for collaboration", "It has become more turbulent", "It has become more fragmented", "It has become more globalized", "It has become more unpredictable"]}
{"anchor": "What advice would you give someone starting a career in government?", "targets": ["Take the time to get to know the different people and their perspectives", "Be flexible and ready to make changes", "Don't be intimidated, just stand up for what's right", "Stay informed and actively seek out different viewpoints", "Develop a passion for serving others"]}
{"anchor": "What are the biggest issues currently facing politics and government?", "targets": ["Global Warming", "Poverty", "Healthcare", "Racism", "Education"]}
{"anchor": "Do you have any thoughts on reforming the government?", "targets": ["Yes", "No", "I'm working on ideas", "Democracy should be changed to a system with more direct representation", "We should remove bureaucracy and decentralize power"]}
{"anchor": "What do you think about America's foreign policy?", "targets": ["It's too isolationist", "It's too interventionist", "It's a mixture of both, with a focus on diplomacy", "It needs to be more proactive", "It should be more peaceful and diplomatic"]}
{"anchor": "What is the most important issue facing America today?", "targets": ["Healthcare", "Climate change", "Poverty", "Racial injustice", "Immigration reform"]}
{"anchor": "How can the government better serve its citizens?", "targets": ["Investing in education", "Investing in infrastructure", "Promoting civil rights and liberties", "Providing better benefits to citizens in need", "Improving access to healthcare"]}
{"anchor": "What have been the biggest successes and failures during your time in politics?", "targets": ["Biggest success: Bringing in new laws improving civil rights", "Biggest failure: Failing to pass the immigration reform bill", "Biggest success: Making healthcare more affordable for people in need", "Biggest failure: Not managing to reduce poverty", "Biggest success: Improving infrastructure and transportation options for citizens"]}
{"anchor": "What's the most important lesson you've learned in your political career?", "targets": ["Know your enemies", "Compromise", "Don't forget your allies", "Don't stoop to their level", "Believe in yourself"]}
{"anchor": "What would you change if you had unlimited power?", "targets": ["End poverty", "Abolish all forms of discrimination", "Increase global trade and free markets", "End all government corruption", "Remove all barriers to education"]}
{"anchor": "If you could pick one policy you could see implemented, what would it be?", "targets": ["Universal single payer healthcare", "Free public education for all", "Longer parental leave", "Criminal justice reform", "Banment of all plastic"]}
{"anchor": "Have you ever had to make an unpopular decision?", "targets": ["Yes", "No", "It's complicated", "Yes, but it turned out well", "It was the right decision, it was just unpopular"]}
{"anchor": "Are you a banker, lawyer or politician first?", "targets": ["Politician", "Banker", "Lawyer", "All of the above", "None of the above"]}
{"anchor": "What is the most difficult part about working in politics?", "targets": ["Dealing with the media", "Dealing with bureaucracy", "Crafting legislation to please everyone", "Working with people from across the aisle", "Making difficult decisions"]}
{"anchor": "What do you enjoy the most about working in politics?", "targets": ["Watching the impact of project", "Seeing individuals' lives improved", "Working on legislation", "Debating complex issues", "Meeting new people"]}
{"anchor": "What would you say is the biggest challenge facing the government today?", "targets": ["Addressing climate change", "Reducing inequality", "Securing the country", "Increasing transparency", "Growing the economy"]}
{"anchor": "Do you find it hard to stay non-partisan?", "targets": ["Yes", "No", "Sometimes", "It depends on the issue", "I take a balanced approach"]}
{"anchor": "How has the political landscape changed in the last decade?", "targets": ["Increased partisanship", "Wider range of voices involved", "Increased use of technology", "Shifting power dynamics", "Expanded focus on social justice issues"]}
{"anchor": "What politician do you admire the most?", "targets": ["John F. Kennedy", "Nelson Mandela", "Barack Obama", "Abraham Lincoln", "Aung San Suu Kyi"]}
{"anchor": "Do you think government works best with strong central leadership?", "targets": ["Yes", "No", "It depends on the situation", "A balance between central and local leadership is best", "A mixture of both strong and weak leadership is optimal"]}
{"anchor": "How do you deal with competing interests among those in the government?", "targets": ["Negotiation", "Compromise", "Mediation", "Creative solutions", "Open dialogue"]}
{"anchor": "How do you handle the pressure of legislating on issues that are highly contested?", "targets": ["Listening to opposing views", "Building consensus", "Researching the facts", "Resilience", "Creating compromise solutions"]}
{"anchor": "What are your thoughts on the intersection of politics and technology?", "targets": ["It can be a powerful tool", "It can create an insidious means of monitoring citizens", "It has provided more channels for voiced and engaging conversations", "It should be used responsibly", "It must be used strategically"]}
{"anchor": "Do you think politics should be more transparent?", "targets": ["Yes", "No", "Only in regards to certain topics", "Only at a certain level", "It depends on the circumstances"]}
{"anchor": "How do you believe politics should adapt to changing social and technological environments?", "targets": ["Using data to inform decisions", "Capitalize on technology to reach more people", "Engaging in meaningful dialogue", "Allowing for more open discussion", "Recognizing the need for adaptation"]}
{"anchor": "How do you feel about countries and global governance?", "targets": ["International cooperation is important", "Economic growth and stability matter", "Politics should be handled from the local level", "We need strong leadership on global issues", "There needs to be a balance between sovereignty and integration"]}
{"anchor": "Do you believe there is a smarter way to manage public policy?", "targets": ["Yes", "No", "Maybe", "It depends", "It requires creativity and innovation"]}
{"anchor": "What advice would you offer someone who wants to get into politics?", "targets": ["Connect with like-minded people", "Study the history of politics", "Find successful role models", "Educate yourself on policy", "Develop a strong sense of integrity"]}
{"anchor": "What do you think is the best way to tackle long-term public policy issues?", "targets": ["Working collaboratively with stakeholders", "Crafting legislation with long-term outlook", "Understanding the needs of those affected", "Allowing for a shared decision-making process", "Investing in research and assessment"]}
{"anchor": "How do you see public opinion playing a role in politics?", "targets": ["It shapes legislation", "It helps inform decisions", "It determines voter sentiment", "It is a critical factor in campaigns", "It sets tone for government policies"]}
{"anchor": "What do you think citizens should be more engaged in when it comes to politics?", "targets": ["Voting", "Public debates", "Supporting causes", "Volunteering", "Writing to representatives"]}
{"anchor": "What are your views on the importance of public service?", "targets": ["It is a noble cause", "It strengthens the public good", "It provides an opportunity to help others", "It requires dedication and commitment", "It gives citizens a voice"]}
{"anchor": "How do you think government could better serve its citizens?", "targets": ["More efficient policies", "More public-oriented decision-making", "Increased transparency", "More collaboration", "Increased outreach and communication"]}
{"anchor": "What do you think are the most effective ways to reduce polarization in political discourse?", "targets": ["Focus on respect rather than disagreement", "Understand shared interests", "Listen more and talk less", "Reach out to people outside your party", "Listen to others’ perspectives"]}
{"anchor": "What are some things people should know about politics before getting involved?", "targets": ["It takes commitment", "It takes patience", "It takes a good understanding of policies", "It takes an ability to persuade your peers", "It takes an understanding of power dynamics"]}
{"anchor": "Are there any issues that you feel strongly about?", "targets": ["Yes, I am passionate about climate change", "Yes, I am concerned about inequality", "Yes, I care about justice reform", "Yes, I am focused on education reform", "Yes, I want to see changes in healthcare system"]}
{"anchor": "What kind of challenges slow down the process of passing legislation?", "targets": ["Political divisions", "Bureaucratic delays", "Resource shortages", "Political gamesmanship", "Ideological agendas"]}
{"anchor": "Do you have any mentors in government or politics?", "targets": ["Yes", "No", "A few", "Several", "Multiple"]}
{"anchor": "What motivates you to continue working in government and politics?", "targets": ["The potential to make a difference", "The challenge of finding solutions", "A desire to stay involved with current events", "A personal ambition", "The opportunity to serve my community"]}
{"anchor": "Do politicians need to compromise their principles to get legislation passed?", "targets": ["Yes", "No", "Sometimes", "Rarely", "It depends"]}
{"anchor": "What strategies do you use for making tough decisions?", "targets": ["Weighing pros and cons", "Process of elimination", "Gather as much info as possible", "Ask trusted advisors", "Utilize logic and reason"]}
{"anchor": "What are the biggest challenges you face in advocating for your political beliefs?", "targets": ["Convincing others of your ideas", "Overcoming ideological barriers", "Maintaining your perspective", "Resisting lobby pressure", "Reaching consensus with opponents"]}
{"anchor": "Do you ever feel overwhelmed by the power of your position?", "targets": ["Yes", "No", "Occasionally", "Never", "Frequently"]}
{"anchor": "Given your knowledge, what do you think are the biggest challenges facing the country?", "targets": ["Lack of trust in government", "Inequity in income", "Education reform", "Infrastructure", "Climate change"]}
{"anchor": "Do you believe in bipartisanship?", "targets": ["Yes", "No", "Sometimes", "Occasionally", "Depends on the issue"]}
{"anchor": "What do you see as the most important objectives for the short and long term future?", "targets": ["Economic growth", "Environmental protection", "Education enrichment", "Social equity", "International relations"]}
{"anchor": "Have you ever felt like you made a real impact on the political system?", "targets": ["Yes", "No", "Sometimes", "Occasionally", "Never"]}
{"anchor": "How do you balance public opinion and personal beliefs?", "targets": ["Carefully and methodically", "I adhere to my beliefs and continue to educate", "I consider public opinion and make an informed decision", "I rely on my own judgment", "I let the people decide"]}
{"anchor": "Do you feel that you are making a difference in the world?", "targets": ["Yes", "No", "Sometimes", "Occasionally", "It's hard to tell"]}
{"anchor": "What do you think would be the biggest benefit of term limits in elected office?", "targets": ["A constant renewal of ideas", "Increased representation and diversity", "Healthy debates", "A more responsive government", "Greater accountability"]}
{"anchor": "How do you balance constituents’ needs with the interests of government?", "targets": ["Working closely with all sides to find an agreeable compromise", "Find common ground in the best interest of everyone", "Being mindful of the bigger issues at stake", "Taking all sides into consideration", "Acknowledging the importance of all the stakeholders"]}
{"anchor": "What benefits do the people receive from voting?", "targets": ["Increased accountability", "Representation in government", "Securing the right to exercise free speech", "Making an impact on critical issues", "Giving a sense of purpose and meaning"]}
{"anchor": "How can we ensure that elected officials remain honest and accountable?", "targets": ["Establishing strict laws and regulations", "Strong enforcement mechanisms", "Regular oversight", "Increased transparency", "Citizen-led monitoring systems"]}
{"anchor": "What advice would you give to someone who is considering running for office?", "targets": ["Prepare to adapt to constantly changing dynamics", "Stay true to yourself", "Surround yourself with like-minded people", "Listen to your constituents", "Understand the importance of staying informed"]}
{"anchor": "Are there any areas of politics you don't feel comfortable discussing?", "targets": ["Yes", "No", "Sometimes", "Depends on the issue", "Rarely"]}
{"anchor": "How do you stay updated on the current political landscape?", "targets": ["Keeping up with news and developments", "Following thought-leaders", "Attending conferences and events", "Engaging in open dialogue", "Participating in online discussions"]}
{"anchor": "How critical do you think it is to have political education in school?", "targets": ["Very important", "It's essential", "It would be helpful", "Not important", "A waste of time"]}
{"anchor": "What qualities do you think make someone a good politician?", "targets": ["Integrity", "Ability to build consensus", "Intelligence", "Listening skills", "Visionary outlook"]}
{"anchor": "Do you think the public's concerns should be considered in policy making?", "targets": ["Yes", "No", "To an extent", "Not always", "Depends on the situation"]}
{"anchor": "What does a typical day in Washington look like for you?", "targets": ["Meeting with constituents", "Holding hearings", "Negotiating bills", "Analyzing data", "Making speeches"]}
{"anchor": "Do you feel like a role model for your constituents?", "targets": ["Yes, I do", "No, I don't", "Sometimes", "It depends on the situation", "Only when I’m setting a good example"]}
{"anchor": "Are there any policies you are passionate about?", "targets": ["Yes", "No", "Not really", "I'm for progressive policies", "I support any policy that is good for my constituents"]}
{"anchor": "How has your career shaped your views on the world?", "targets": ["I have a better understanding of the system", "I've learned to be more tolerant", "I've become more politically involved", "I've realized the importance of keeping up with current events", "I'm now more aware of the need for change in our government"]}
{"anchor": "Do you ever feel like Washington doesn't listen to the people?", "targets": ["Yes", "No", "It depends", "Not often enough", "It seems like policies are often decided before hearing public opinion"]}
{"anchor": "What made you want to work in the government?", "targets": ["I wanted to make a difference", "I wanted to have a say in policy decisions", "I was inspired by a politician I admired", "I thought it looked interesting", "I wanted to join forces with like-minded individuals"]}
{"anchor": "What do you think can be done to improve the political system?", "targets": ["More public input", "Restricting lobbying influence", "Limiting political power", "Making more laws public", "Tighter restrictions on campaign finance"]}
{"anchor": "Do you think politics can be used for good?", "targets": ["Yes", "No", "It depends on the purpose", "When used properly, it can lead to good change", "If used responsibly, it can be a powerful tool"]}
{"anchor": "Is there anything that you would like to see changed about the government?", "targets": ["Yes", "No", "More oversight", "More honest communication", "More timely decision making"]}
{"anchor": "What do you think is the key to successful policy making?", "targets": ["Inclusivity", "Clarity", "Strategic planning", "Listening to all stakeholders", "Making sure everyone benefits"]}
{"anchor": "What has been the most rewarding moment in your political career?", "targets": ["Passing meaningful legislation", "Meeting with constituents", "Seeing a controversial law pass", "Gaining support for an unpopular cause", "Making a positive difference in the world"]}
{"anchor": "What has been the most difficult moment in your political career?", "targets": ["Overcoming opposition", "Making unpopular decisions", "Facing powerful detractors", "Witnessing the effects of inaction", "Seeing failure despite good intentions"]}
{"anchor": "Do you think the current system serves the people faithfully?", "targets": ["No", "Yes", "Sometimes", "Not always", "It depends on who is in power"]}
{"anchor": "Do you think campaigning plays too large of a role in politics?", "targets": ["Yes", "No", "It varies", "It definitely plays a role", "It can be a distraction"]}
{"anchor": "What do you think is the best way to reach out to constituents?", "targets": ["Town halls", "Social media", "Public forums", "Door to door visits", "Open office hours"]}
{"anchor": "What do you think are the most pressing challenges facing the world today?", "targets": ["Climate change", "War", "Poverty", "Inequality", "Population growth"]}
{"anchor": "Do you believe that politics can bring about real change?", "targets": ["Yes", "No", "We need more people to believe it can", "It depends on who is in power", "Change takes time and effort"]}
{"anchor": "Do you find yourself becoming passionate about issues you didn't even know about prior to your career?", "targets": ["Yes", "No", "I've gained insight on a lot of issues", "Issues that I once overlooked have become important to me", "I've become more informed and aware of the varying perspectives"]}
{"anchor": "How has a political career changed your outlook on life?", "targets": ["I appreciate the value of dialogue", "I've learned to be more understanding of different perspectives", "I recognize the power of collective action", "I've become an advocate for different causes", "I have a better understanding of how systems work"]}
{"anchor": "What would you say is the most important thing you’ve learned about politics?", "targets": ["To remain unbiased", "To be flexible", "To expect the unexpected", "To listen", "To never give up on one’s beliefs"]}
